{
    "id": 145861,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/plugins/mu-plugins/"
    },
    "modified": "2024-01-16T20:30:05",
    "modified_gmt": "2024-01-16T20:30:05",
    "slug": "mu-plugins",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/plugins/mu-plugins/",
    "title": {
        "rendered": "Must Use Plugins"
    },
    "content": {
        "rendered": "<p>Must-use plugins (a.k.a. mu-plugins) are plugins installed in a special directory inside the content folder and which are automatically enabled on all sites in the installation. Must-use plugins do not show in the default list of plugins on the Plugins page of wp-admin (although they do appear in a special Must-Use section) and cannot be disabled except by removing the plugin file from the must-use directory, which is found in <strong>wp-content/mu-plugins</strong> by default. For web hosts, mu-plugins are commonly used to add support for host-specific features, especially those where their absence could break the site.</p>\n<p>To change the default directory manually, define <code>WPMU_PLUGIN_DIR</code> and <code>WPMU_PLUGIN_URL</code> in <a href=\"https://wordpress.org/documentation/article/editing-wp-config-php/\">wp-config.php</a>.</p>\n<h2>Features</h2>\n<ul>\n<li>Always on, no need to enable via admin and users cannot disable by accident.</li>\n<li>Can be enabled simply by uploading file to the mu-plugins directory, without having to log-in.</li>\n<li>Loaded by PHP, in alphabetical order, before normal plugins, meaning API hooks added in an mu-plugin apply to all other plugins even if they run hooked-functions in the global namespace.</li>\n</ul>\n<h2>Caveats</h2>\n<p>Despite its suitability for many special cases, the mu-plugins system is not always ideal and has several downsides that make it inappropriate in certain circumstances. Below are several important caveats to keep in mind:</p>\n<ul>\n<li>Plugins in the must-use directory will not appear in the update notifications nor show their update status on the plugins page, so you are responsible for learning about and performing updates on your own.</li>\n<li>Activation hooks are not executed in plugins added to the must-use plugins folder. These hooks are used by many plugins to run installation code that sets up the plugin initially and/or uninstall code that cleans up when the plugin is deleted. Plugins depending on these hooks may not function in the mu-plugins folder, and as such all plugins should be carefully tested specifically in the mu-plugins directory before being deployed to a live site.</li>\n<li>WordPress only looks for PHP files right inside the mu-plugins directory, and (unlike for normal plugins) not for files in subdirectories. You may want to create a proxy PHP loader file inside the mu-plugins directory:</li>\n</ul>\n<pre><code>&lt;?php // mu-plugins/load.php\nrequire WPMU_PLUGIN_DIR.'/my-plugin/my-plugin.php';\n</code></pre>\n<h2>History and Naming</h2>\n<p>The <em>mu-plugins</em> directory was originally implemented by WPMU (Multi-User) to offer site admins an easy way to activate plugins by default on all blogs in the farm. There was a need for this feature because at the time the multi-user-specific code did not offer ways of achieving this effect using the site admin section (today the renamed “Multisite WordPress” has features to manage plugins from inside the admin).</p>\n<p>The code handling /mu-plugins/ was merged into the main WordPress code on 03/07/09 with <a href=\"https://core.trac.wordpress.org/changeset/10737\">this changeset</a> a full 10 months before the wpmu codebase was initially merged, and all WP sites could take advantage of autoloaded plugins, whether they had MU/Multisite enabled or not. The feature is useful for all types of WP installations depending on circumstances, so this makes sense.</p>\n<p>In this process the name “mu plugins” became a misnomer because it did not apply exclusively to multisite installs and because “MU” was not even being used anymore to refer to WP installations with multiple blogs. Despite this, the name was kept and <strong>re-interpreted to mean “must-use plugins”</strong>, i.e. these are plugins that must always be used, thus they are autoloaded on all sites regardless of the settings in the Plugins pane of wp-admin.</p>\n<p>Thus “Must-Use” is effectively a <a href=\"https://en.wikipedia.org/wiki/Backronym\">Backronym</a>, like <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#PHP\">PHP</a> (which originally meant “Personal Home Page” but was later re-interpreted as meaning “PHP Hypertext Preprocessor”, which is also a <a href=\"https://en.wikipedia.org/wiki/Recursive_acronym\">Recursive Acronym</a>).</p>\n<h2>Source Code</h2>\n<ul>\n<li><code>get_mu_plugins()</code> is located in <a href=\"https://core.trac.wordpress.org/browser/tags/4.5.3/src/wp-admin/includes/plugin.php#L0\">wp-admin/includes/plugin.php</a>.</li>\n<li><code>wp_get_mu_plugins()</code> is located in <a href=\"https://core.trac.wordpress.org/browser/tags/4.5.3/src/wp-includes/load.php#L0\">wp-includes/load.php</a>.</li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/must-use-plugins/\">Must Use Plugins</a>. Minor additions and copy-editing.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145860,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145861",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145861",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145861/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151935,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145861/revisions/151935"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145860"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145861"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}