{
    "id": 147341,
    "date": "2023-04-25T15:43:27",
    "date_gmt": "2023-04-25T15:43:27",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/resources/faq/"
    },
    "modified": "2024-01-16T20:30:02",
    "modified_gmt": "2024-01-16T20:30:02",
    "slug": "faq",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/resources/faq/",
    "title": {
        "rendered": "FAQ Troubleshooting"
    },
    "content": {
        "rendered": "<h2>Why can&#8217;t I see my posts? All I see is Sorry, no posts match your criteria?</h2>\n<p>Clearing your browser cache and cookies may resolve this problem. Also, check your <code>search.php</code> and <code>index.php</code> template files for errors.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://wordpress.org/support/topic/i-make-changes-and-nothing-happens/\">I Make Changes and Nothing Happens</a></li>\n</ul>\n<h2>How do I find more help?</h2>\n<p>There are various resources that will help you find more help with WordPress, in addition to these <a href=\"https://codex.wordpress.org/FAQ\">FAQ</a>.</p>\n<ul>\n<li><a href=\"https://codex.wordpress.org/Troubleshooting\">Troubleshooting</a></li>\n<li><a href=\"https://wordpress.org/documentation/article/where-to-find-wordpress-help/\">Finding WordPress Help</a></li>\n<li><a href=\"https://wordpress.org/support/welcome/\">Using the Support Forums</a></li>\n<li><a href=\"https://codex.wordpress.org/Technical%20Articles\">Resources and Technical Articles about WordPress</a></li>\n<li><a href=\"https://codex.wordpress.org/Troubleshooting#Installation_Problems\">Installation Problems</a></li>\n</ul>\n<h2>Where can I find help with the CSS problems I&#8217;m having?</h2>\n<p>The following are articles that will help you troubleshoot and solve many of your <a href=\"https://wordpress.org/documentation/article/css/\">CSS</a> problems:</p>\n<ul>\n<li><a href=\"https://codex.wordpress.org/Blog_Design_and_Layout\">Blog Design and Layout</a></li>\n<li><a href=\"https://codex.wordpress.org/Finding%20Your%20CSS%20Styles\">Finding Your CSS Styles</a></li>\n<li><a href=\"https://codex.wordpress.org/CSS%20Fixing%20Browser%20Bugs\">CSS Fixing Browser Bugs</a></li>\n<li><a href=\"https://codex.wordpress.org/CSS%20Troubleshooting\">CSS Troubleshooting</a></li>\n<li><a href=\"https://wordpress.org/documentation/article/css/\">WordPress CSS Information and Resources</a></li>\n</ul>\n<h2>Why do I get an error message about Sending Referrers?</h2>\n<p>If you got this message when trying to save a post, consider checking <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration</a> &gt; <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Settings</a> &gt; <a href=\"https://wordpress.org/documentation/article/settings-general-screen/\">General</a> and make sure both your <strong>WordPress address (URI)</strong> and the <strong>Blog address (URI)</strong> do not use &#8216;www&#8217;. For example, instead of https://www.example.com use https://example.com in those fields.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://codex.wordpress.org/Enable%20Sending%20Referrers\">Enable Sending Referrers</a></li>\n</ul>\n<h2>How do I empty a database table?</h2>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/server/empty-database/\">Emptying a Database Table</a></li>\n</ul>\n<h2>How do I fix the following error SQL/DB Error errcode 13 Can&#8217;t create/write to file?</h2>\n<p><strong>Problem:</strong> The MySQL variable <code>tmpdir</code> is set to a directory that cannot be written to when using PHP to access MySQL.</p>\n<p>To verify this, enter MySQL at the command line and type <code>show variables</code>;</p>\n<p>You&#8217;ll get a long list and one of them will read: <code>tmpdir = /somedir/</code> (whatever your setting is.)</p>\n<p><strong>Solution:</strong> Alter the <code>tmpdir</code> variable to point to a writable directory.</p>\n<p><strong>Steps:</strong></p>\n<ol>\n<li>Find the <code>my.cnf</code> file. On *nix systems this is usually in <code>/etc/</code>. On Windows system, Find the <code>my.ini</code>.</li>\n<li>Once found, open this in a simple text editor and find the <code>[mysqld]</code> section.</li>\n<li>Under this section, find the <code>tmpdir</code> line. If this line is commented (has a <code>#</code> at the start), delete the <code>#</code> and edit the line so that it reads: <code>tmpdir = /writable/dir</code> where <code>/writable/dir</code> is a directory to which you can write. Some use <code>/tmp</code>, or you might also try <code>/var/tmp</code> or <code>/usr/tmp</code>. On Windows, use <code>C:/Windows/tmp</code>.</li>\n<li>Save the file.</li>\n<li>Shutdown MySQL by typing <code>mysqlshutdown -u -p shutdown</code>.</li>\n<li>Start MySQL by going to the MySQL directory and typing <code>./bin/safe_mysqld &amp;</code>. Usually the MySQL directory is in <code>/usr/local</code> or sometimes in <code>/usr/</code> on Linux systems.</li>\n</ol>\n<p>If none of this make sense and you have someone to administrate your system for you, show the above to them and they should be able to figure it out.</p>\n<p><strong>Description:</strong> You get a warning message on your browser that says:</p>\n<pre><code>Warning: Cannot modify header information – headers already sent by (output started at\n</code></pre>\n<p><strong>Reason and Solution:</strong></p>\n<p>It is usually because there are spaces, new lines, or other stuff before an opening <code>&lt;!--?php &amp;lt;/code&amp;gt;&amp;lt;/strong&amp;gt; tag or after a closing &amp;lt;strong&amp;gt;&amp;lt;code&amp;gt;?--&gt;</code> tag, typically in <code>wp-config.php</code>. This could be true about some other file too, so please check the error message, as it will list the specific file name where the error occurred (see &#8220;Interpreting the Error Message&#8221; below). Replacing the faulty file with one from your most recent backup or one from a fresh WordPress download is your best bet, but if neither of those are an option, please follow the steps below.</p>\n<p>Just because you cannot see anything does not mean that PHP sees the same.</p>\n<ol>\n<li>Download the file mentioned in the error message via <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/ftp/\">FTP</a> or the file manager provided in your host&#8217;s control panel.</li>\n<li>Open that file in a <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#text-editor\">plain text editor</a> (<strong>NOT</strong> MS Word or similar. Notepad or BBEdit are fine).</li>\n<li>Check that the <em>very</em> first characters are with no blank lines or spaces after it.</li>\n<li>Before saving, or use the Save as dialog, ensure the file encoding is not <code>UTF-8 BOM</code> but plain <code>UTF-8</code> or any without the <code>BOM</code> suffix.</li>\n</ol>\n<p>To be sure about the end of the file, do this:</p>\n<ol>\n<li>Place the cursor between the <code>?</code> and <code>&gt;</code></li>\n<li>Now press the DELETE key on your computer <strong>Note to MAC users</strong>: The &#8220;DELETE&#8221; key on a PC deletes characters to the <em>right</em> of the cursor. That is the key noted here.</li>\n<li>Keep that key pressed</li>\n<li>For at least 15 seconds</li>\n<li>Now type <code>&gt;</code> and</li>\n<li><strong>save</strong> without pressing any other key at all.</li>\n<li>If you press another key, you will bring the problem back.</li>\n<li>DO <strong>NOT</strong> PUT CODE IN UNNECESSARY CODE BLOCKS, PUT THEM IN A SINGLE PHP BLOCK.</li>\n</ol>\n<p>Wrong:</p>\n<pre><code>&lt;?php\nsome code;\n?&gt;\n\n&lt;?php\nsome other codes;\n?&gt;\n</code></pre>\n<p>Correct:</p>\n<pre><code>&lt;?php\ncode;\n\nsome other code;\n?&gt;\n</code></pre>\n<p>Upload the file back to your server after editing and saving the file.</p>\n<p><strong>Note</strong>: Also check the encoding of the file. If the file is encoded as UTF-8 with BOM, the BOM is seen as a character which starts the output.</p>\n<p><strong>Interpreting the Error Message:</strong></p>\n<p>If the error message states: <code>Warning: Cannot modify header information - headers already sent by (output started at /path/blog/wp-config.php:34) in /path/blog/wp-login.php on line 42</code>, then the problem is at line <code>#34</code> of <code>wp-config.php</code>, not line <code>#42</code> of <code>wp-login.php</code>. In this scenario, line <code>#42</code> of <code>wp-login.php</code> is the victim. It is being affected by the excess whitespace at line <code>#34</code> of <code>wp-config.php</code>.</p>\n<p>If the error message states: <code>Warning: Cannot modify header information - headers already sent by (output started at /path/wp-admin/admin-header.php:8) in /path/wp-admin/post.php on line 569</code>, then the problem is at line <code>#8</code> of <code>admin-header.php</code>, not line <code>#569</code> of <code>post.php</code>. In this scenario, line <code>#569</code> of <code>post.php</code> is the victim. It is being affected by the excess whitespace at line <code>#8</code> of <code>admin-header.php</code>.</p>\n<p><strong>Other issues that might cause that error:</strong></p>\n<p>In case you&#8217;ve used the function: <a href=\"https://developer.wordpress.org/reference/functions/wp_redirect/\">wp_redirect()</a> or tried to use a header redirect after the header (or any content at all was sent) that error message will pop. Instead use javascript redirection if needed.</p>\n<h2>Why doesn&#8217;t my &#8220;Publish&#8221; or &#8220;Save Draft&#8221; button work?</h2>\n<p>To resolve this and similar issues, disable your plugins one at a time until you find the source of the issue. Generally, this will be due to two or more plugins trying to use the same resources (for example, JQuery or other Java-based tools).</p>\n<p>In addition, it could be that there is a problem with your browser. A common resolution is to empty the browser&#8217;s cache. Please consult the documentation for your preferred browser to learn how to do this.</p>\n<h2>Why can&#8217;t I see the visual rich editor or Quicktag buttons when using Apple&#8217;s Safari browser?</h2>\n<p>Update your Safari browser. Early versions of Safari are not supported.</p>\n<h2>E-mailed passwords are not being received</h2>\n<p><strong>Description:</strong> When users try to register with your blog or change their passwords by entering their username and/or email, WordPress indicates that their password has been emailed to them, but it is never received.</p>\n<p><strong>Reason and Solutions:</strong> WordPress uses the standard PHP <a href=\"https://www.php.net/manual/en/function.mail.php\">mail()</a> function, which uses sendmail. No account information is needed. This is not generally a problem if you are using a hosting service, but if you are using your own box and do not have an SMTP server, the mail will never send. If you are using a *NIX box, you should have either postfix or sendmail on your machine; you will just need to set them up (search the Internet for how-to&#8217;s). If you do not want to go through setting up a complete mail server on your *NIX box you may find <a href=\"https://packages.debian.org/stable/mail/ssmtp\">ssmtp</a> useful — it provides _&#8221;A secure, effective and simple way of getting mail off a system to your mail hub&#8221;_. On a Windows machine, try a sendmail emulator like <a href=\"https://github.com/sendmail-tls1-2/main\">Fake sendmail for Windows with TLS v1.2 support</a>.</p>\n<p>More help can be found on this thread of the WordPress Support Forums <a href=\"https://wordpress.org/support/topic/how-does-wp-send-the-user-registration-email/\">How does WP send the user registration email?</a>. For a plugin based alternative, you could try <a href=\"https://coffee2code.com/wp-plugins/configure-smtp/\">Configure SMTP</a>: <em>&#8220;Configure SMTP mailing in WordPress, including support for sending e-mail via SSL/TLS (such as GMail).&#8221;</em></p>\n<p><strong>Windows Host Server Specific:</strong> Check your &#8220;Relay&#8221; settings on the SMTP Virtual Server. Grant access to <code>127.0.0.1</code> . Then in your <code>php.ini</code> file, set the <code>SMTP</code> setting to the same IP address. Also set <code>smtp_port</code> to <code>25</code>.</p>\n<p><strong>Ensure Proper Return Address is Used:</strong> By default, the WordPress mailer fills in the From: field with <em>wordpress@example.com</em> and the From: name as <em>WordPress</em>.</p>\n<p>This is fine if this is a valid e-mail address. For example, if your real e-mail is <em>wordpress@example.com</em>, your host should pass the email on for delivery. It will probably send your mail as long as <em>example.com</em> is setup to send and receive mail, even if <em>wordpress</em> is not a valid mail box. But if you set you real email as the From: address and it&#8217;s something like <em>wordpress@example.com</em>, the mail may not send because <em>gmail.com</em> is not a domain handled by the mail server.</p>\n<p><strong>Treated as Spam:</strong> Your email message may have been routed to a spam folder or even worse, simply discarded as malicious. There are a couple measures you can use to convince recipient&#8217;s mail servers that your message is legitimate and should be delivered as addressed.</p>\n<p><strong>SPF:</strong> (Sender Policy Framework) This is the most common anti-spam measure used. If you are on a hosted system, there is a good chance your host has set this up for the mail server you are using. Have WordPress email you and check the message headers for evidence that the message passed the SPF check. You can get a message sent by following the Forgot Password link on the login page. To keep your old password, do not follow the link in the message.</p>\n<p>If your system email failed the SPF check, you can set up the credentials if you have access to your DNS records and your mail server&#8217;s domain belongs to you. Check the return path of the email your system sent. If the mail server listed there has your domain name, you can set up SPF credentials. There are several how-tos on the Internet.</p>\n<p><strong>DKIM:</strong> (Domain Key Identified Mail) This system is also used. You can use both SPF and DKIM in the same message. Again, just as with SPF, you can check if your receiving mailserver verified your host&#8217;s domain key by examining the mail header. There is a fair chance no signature key was provided, indicating your host chose to not use this protocol. Also as with SPF, if you can edit your DNS records and the mail server belongs to your domain, you can set up DKIM credentials yourself. Some how-tos exist if you search the Internet.</p>\n<p>To get WordPress to send the proper DKIM keys, hook the <code>'phpmailer_init'</code> action. You are passed the <code>$phpmailer</code> object. Set the necessary properties and return the object. See the class source code for more information. It&#8217;s on <em>wp-includes/class-phpmailer.php</em>.</p>\n<h2>I used the Quicktag <code>nextpage</code> in a post so why doesn&#8217;t it work?</h2>\n<p>In some <a href=\"https://wordpress.org/documentation/article/worik-with-themes/\">Themes</a>, such as the WordPress Classic Theme, you may see the <code>&lt;!–nextpage–&gt;</code> work properly on your main page, but other <a href=\"https://wordpress.org/documentation/article/worik-with-themes/\">Themes</a>, such as the WordPress default Theme, may only show the <em>page break</em> when viewing the posts individually. It may be necessary to change your Theme&#8217;s <a href=\"https://codex.wordpress.org/Templates\">template</a> <em>page.php</em> or <em>index.php</em> file to make this feature work according to your wishes. You&#8217;ll need to add the following:</p>\n<pre><code>&lt;?php wp_link_pages(); ?&gt;\n</code></pre>\n<h2>MySQL Error 28</h2>\n<p>It could be because:</p>\n<ul>\n<li>you are out of space on <code>/tmp</code> (wherever tmpdir is), or,</li>\n<li>you have too many files in <code>/tmp</code> (even if there is lots of free space)</li>\n</ul>\n<p>This is a MySQL error and has nothing to do with WordPress directly; you should contact your host about it. Some users have reported that running a &#8220;repair table&#8221; command in <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a> fixed the problem.</p>\n<h2>Why are the Quote Marks escaped or not escaped?</h2>\n<p>If you write plugins or make advanced custom templates, you may eventually find yourself dealing with data in the database. WordPress <em>usually</em> manages this data for you in such a way that it is immediately usable. There are circumstances though (especially if you are dealing directly with the database without using WordPress) where you will experience weirdness.</p>\n<p>For example, quote marks cannot be stored directly in the MySQL database. MySQL uses quote marks in its SQL language. When a quote mark is used, for example, in a post, when the post is saved to the database, every quote mark gets escaped. That means a backslash character is prepended, which signifies that the next character should be taken as part of the input, and not as part of the SQL command.</p>\n<p>For example, if you are adding the following in your post:</p>\n<pre><code>...an article about \"Happiness\" is at\n&lt;a href=\"https://example.com/happy\" title=\"Happiness\"&gt;Happiness&lt;/a&gt;\nif you would like to read it...\n</code></pre>\n<p>Is actually imported into the database looking like this:</p>\n<pre><code>...an article about \\\"Happiness\\\" is at\n&lt;a href=\\\"https://example.com/happy\\\" title=\\\"Happiness\\\"&gt;Happiness&lt;/a&gt;\nif you would like to read it...\n</code></pre>\n<p>When pulling data out of the database, the backslashes may not always be automatically removed. If this becomes an issue, you can use the <a href=\"https://www.php.net/manual/en/function.stripslashes.php\">stripslashes()</a> PHP function on the text.</p>\n<p><strong>Description:</strong> When anyone tries to comment on a post, the window goes blank and the comment doesn&#8217;t appear to have been recognised by WordPress.</p>\n<p><strong>Reason and Solution:</strong> The Theme that you are using is missing a critical part of the comment form so WordPress doesn&#8217;t know which post the comment refers to. You need to check the comment.php in your Theme and ensure that the following code appears within the form.</p>\n<pre><code>&lt;input type=\"hidden\" name=\"comment_post_ID\" value=\"&lt;?php echo $id; ?&gt;\" /&gt;\n</code></pre>\n<p>Relevant discussion threads:</p>\n<ul>\n<li><a href=\"https://wordpress.org/support/topic/cant-comment-3/\">Can’t comment</a></li>\n</ul>\n<p>Sometimes it may be necessary to deactivate all plugins, but you can&#8217;t access the administrative menus to do so. One of two methods are available to deactivate all plugins.</p>\n<p>Use <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a> to deactivate all plugins.</p>\n<ol>\n<li>In the table wp_options, under the <code>option_name</code> column (field) find the <code>active_plugins</code> row</li>\n<li>Change the <code>option_value</code> field to: <code>a:0:{}</code></li>\n</ol>\n<p>Or reset your plugins folder via <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/ftp/\">FTP</a> or the file manager provided in your host&#8217;s control panel. This method preserves plugin options but requires plugins be manually reactivated.</p>\n<ol>\n<li>Via FTP or your host&#8217;s file manager, navigate to the <code>wp-contents</code> folder (directory).</li>\n<li>Via FTP or your host&#8217;s file manager, rename the folder <code>plugins</code> to <code>plugins.hold</code>.</li>\n<li>Login to your WordPress administration plugins page (<code>/wp-admin/plugins.php</code>) – this will disable any plugin that is &#8220;missing&#8221;.</li>\n<li>Via FTP or your host&#8217;s file manager, rename <code>plugins.hold</code> back to <code>plugins</code>.</li>\n</ol>\n<h2>How to clear the &#8220;Briefly unavailable for scheduled maintenance&#8221; message after doing automatic upgrade?</h2>\n<p>As part of the automatic upgrade WordPress places a file named <code>.maintenance</code> in the blog <strong>base</strong> folder (folder that contains the <code>wp-admin</code> folder). If that file exists, then visitors will see the message <strong>Briefly unavailable for scheduled maintenance. Check back in a minute.</strong></p>\n<p>To stop that message from being displayed to visitors, just delete the <code>.maintenance</code> file. The automatic upgrade should be executed again, just in case it failed.</p>\n<p>Note the core automatic upgrade feature was added with <a href=\"https://wordpress.org/documentation/wordpress-version/version-2-7/\">Version 2.7</a>.</p>\n<h2>How to fix 404 error when using Pretty Permalinks?</h2>\n<p>If an error 404 occurs when using the <a href=\"https://wordpress.org/documentation/article/introduction-to-blogging/#pretty-permalinks\">Pretty Permalink</a> choices such as <strong>Day and Name</strong> in <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration</a> &gt; <a href=\"https://wordpress.org/documentation/article/administration-screens/#permalinks\">Settings</a> &gt; <a href=\"https://wordpress.org/documentation/article/settings-permalinks-screen/\">Settings_Permalinks_Screen</a> it could be a result of the <strong>mod_rewrite</strong> module not being activated/installed. The solution is to activate <strong>mod_rewrite</strong> for the Apache web-server. Check the <code>apache/conf/httpd.conf</code> file for the line <code># LoadModule rewrite_module modules/mod_rewrite.so</code> and delete the <code>#</code> in front of the line. Then stop Apache and start it again. <strong>Note:</strong> you may have to ask your host to activate <strong>mod_rewrite</strong>.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://wordpress.org/documentation/article/customize-permalinks/\">Using Permalinks</a></li>\n</ul>\n<p>Relevant discussion thread:</p>\n<ul>\n<li><a href=\"https://wordpress.org/support/topic/localhost-permalink-question/\">LocalHost: Permalink question</a></li>\n</ul>\n<p>Not sure why this problem happens, but here&#8217;s a couple of things to try one of these two solutions.</p>\n<p>This usually fixes the problem:</p>\n<ol>\n<li>Create new admin user (e.g. newadmin) with Administrator Role</li>\n<li>Login as &#8216;newadmin&#8217;</li>\n<li>Degrade the old &#8216;admin&#8217; user to Role of Subscriber and Save</li>\n<li>Promote the old &#8216;admin&#8217; back to Administrator Role and Save</li>\n<li>Login as the old &#8216;admin&#8217;</li>\n</ol>\n<p>If that doesn&#8217;t work, try:</p>\n<ol>\n<li>Create a new admin user (e.g. newadmin) with Administrator Role</li>\n<li>Login as &#8216;newadmin&#8217;</li>\n<li>Delete the old &#8216;admin&#8217; user and assign any posts to &#8216;newadmin&#8217;</li>\n<li>Create &#8216;admin&#8217; user with Administrator Role</li>\n<li>Login as &#8216;admin&#8217;</li>\n<li>Delete &#8216;newadmin&#8217; user and assign posts to &#8216;admin&#8217;</li>\n</ol>\n<h2>Why is the wrong author name displayed for a post on a blog?</h2>\n<p>This problem is usually solved by the same solution as is presented in the question right before this one:<br />\n<a href=\"https://wordpress.org/documentation/article/faq-troubleshooting/#why-isnt-the-admin-user-listed-as-an-author-when-editing-posts\">Why isn&#8217;t the admin user listed as an author when editing posts?</a>.</p>\n<h2>An update was just released, so why does my blog not recognize the update is available?</h2>\n<p>When an update is released, notification of that release is displayed at the top administration screens saying <strong>WordPress x.x.x is available! Please update now.</strong> Not every blog will see that message at the same time. Your blog is programmed to check for updates every 12 hours, but the timing of that check is purely random. So if your blog just checked for updates minutes before an update was released, you won&#8217;t see the update message until your blog checks for updates 12 hours later.</p>\n<p>If you want your blog to check right now for updates, you can delete the <code>update_core</code> option name record in your <code>wp_options</code> table. Note that plugins and themes each have their own check and update cycle, controlled by the records <code>update_plugins</code> and <code>update_themes</code>, in <code>wp_options</code>.</p>\n<p>Relevant discussion thread:</p>\n<ul>\n<li><a href=\"https://wordpress.org/support/topic/271-please-update-now-not-showing-up-1/\">&#8220;2.7.1 Please update now&#8221; NOT showing up</a></li>\n</ul>\n<h2>Why did I lose custom changes to the WordPress Default Theme during the last automatic upgrade?</h2>\n<p>A core upgrade copies all the new files from the distribution over the old ones, so if you changed existing files in the WordPress default theme (e.g. <code>wp-content/themes/twentysixteen/style.css</code>), those changes got overwritten with the new version of that file.</p>\n<p>Please note, a core upgrade goes through a list of &#8220;old files&#8221;, as defined in <code>wp-admin/includes/update-core.php</code>, and deletes those files. Any files not on the list, and not in the distribution, are preserved.</p>\n<p><strong>Remember, that before upgrades, whether automatic or manual, both the WordPress Files and database should be backed-up as explained in <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/\">WordPress Backups</a>.</strong></p>\n<p>A better way to modify the default theme is by using a <a href=\"https://developer.wordpress.org/themes/advanced-topics/child-themes/\">child theme</a>. It&#8217;s a little more work to set up, but worth the effort because your customizations will be safe when the main theme is updated.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/security/backup/\">WordPress Backups</a></li>\n<li><a href=\"https://developer.wordpress.org/themes/advanced-topics/child-themes/\">Child Themes</a></li>\n</ul>\n<h2>How do you repair a MySQL database table?</h2>\n<p>Every once in a while, it may be necessary to repair one or more MySQL database tables. According to the <a href=\"https://dev.mysql.com/doc/refman/8.0/en/myisam-repair.html\">How to Repair MyISAM Tables at dev.mysql.com</a> there are a number of reasons to repair a table including errors such as <em>&#8220;tbl_name.frm is locked against change&#8221;</em>, <em>&#8220;Can&#8217;t find file tbl_name.MYI (Errcode: nnn)&#8221;</em>, <em>&#8220;Unexpected end of file&#8221;</em>, <em>&#8220;Record file is crashed&#8221;</em>, or <em>&#8220;Got error nnn from table handler&#8221;</em>.</p>\n<p>Here are the steps to repair a table in a MySQL database using <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a>:</p>\n<ol>\n<li>Login to hosting account.</li>\n<li>Login to <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a>.</li>\n<li>Choose the affected database. If you only have one database, it should choose it by default so you don&#8217;t need to do anything.</li>\n<li>In the main panel, you should see a list of your database tables. Check the boxes by the tables that need repair.</li>\n<li>At the bottom of the window just below the list of tables, there is a drop down menu. Choose &#8220;Repair Table&#8221;</li>\n</ol>\n<p>Remember, that it is advisable to have a current backup of your database at all times.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/security/backup/\">WordPress Backups</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2023-02-17: Links updated, and some fixes for deprecated content.</li>\n<li>2023-01-31: Original content from <a href=\"https://wordpress.org/documentation/article/faq-troubleshooting-2/\">FAQ Troubleshooting</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145878,
    "menu_order": 1,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-147341",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/147341",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/147341/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151922,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/147341/revisions/151922"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145878"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=147341"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}