{
    "id": 145852,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/upgrade/migrating/"
    },
    "modified": "2024-03-07T05:39:43",
    "modified_gmt": "2024-03-07T05:39:43",
    "slug": "migrating",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/upgrade/migrating/",
    "title": {
        "rendered": "Migrating WordPress"
    },
    "content": {
        "rendered": "<h2>Changing The Site URL</h2>\n<p>On the <code>Settings -&gt; General</code> screen in a single site installation of WordPress, there are two fields named &#8220;WordPress Address (URL)&#8221; and &#8220;Site Address (URL)&#8221;. They are important settings since they control where WordPress is located. These settings control the display of the URL in the admin section of your page, as well as the front end, and are used throughout the WordPress code.</p>\n<ul>\n<li>The &#8220;Site Address (URL)&#8221; setting is the address you want people to type in their browser to reach your WordPress blog.</li>\n<li>The &#8220;WordPress Address (URL)&#8221; setting is the address where your WordPress core files reside.</li>\n</ul>\n<p><strong>Note:</strong> Both settings should include the https:// part and should not have a slash <code>/</code> at the end.</p>\n<p>Every once in a while, somebody finds a need to manually change (or fix) these settings. Usually, this happens when they change one or both and discover that their site no longer works properly. This can leave the user with no easily discoverable way to correct the problem. This article tells you how to change these settings directly.</p>\n<p>Additional information is presented here for the case where you are moving WordPress from one site to another, as this will also require changing the site URL. You should not attempt to use this additional information if you&#8217;re only attempting to correct a &#8220;broken&#8221; site.</p>\n<p><strong>Alert!</strong> These directions are for single installs of WordPress only. If you are using WordPress MultiSite, you will need to manually edit your database.</p>\n<p>There are four easy methods to change the Site URL manually. Any of these methods will work and perform much the same function.</p>\n<h4>Edit wp-config.php</h4>\n<p>It is possible to set the site URL manually in the <code>wp-config.php</code> file.</p>\n<p>Add these two lines to your <code>wp-config.php</code>, where &#8220;example.com&#8221; is the correct location of your site.</p>\n<pre><code>define( 'WP_HOME', 'https://example.com' );\ndefine( 'WP_SITEURL', 'https://example.com' );\n</code></pre>\n<p>This is not necessarily the best fix, it&#8217;s just hard-coding the values into the site itself. You won&#8217;t be able to edit them on the General settings page anymore when using this method.</p>\n<h4>Edit functions.php</h4>\n<p>If you have access to the site via FTP, then this method will help you quickly get a site back up and running, if you changed those values incorrectly.</p>\n<ol>\n<li>FTP to the site, and get a copy of the active theme&#8217;s functions.php file. You&#8217;re going to edit it in a simple text editor and upload it back to the site.</li>\n<li>Add these two lines to the file, immediately after the initial <code>&lt;?php</code> line:</li>\n</ol>\n<pre><code>update_option( 'siteurl', 'https://example.com' );\nupdate_option( 'home', 'https://example.com' );\n</code></pre>\n<p>Obviously, use your own URL instead of <code>example.com</code>.</p>\n<ol>\n<li>Upload the file back to your site, in the same location. FileZilla offers a handy &#8220;edit file&#8221; function to do all of the above rapidly; if you can use that, do so.</li>\n<li>Load the login or admin page a couple of times. The site should come back up.</li>\n</ol>\n<p><strong>Important!</strong> Do not leave this code in the <code>functions.php</code> file. Remove them after the site is up and running again.</p>\n<p>Note: If your theme doesn&#8217;t have a <code>functions.php</code> file create a new one with a text editor. Add the <code>&lt;?php</code> tag and the two lines using your own URL instead of <code>example.com</code>:</p>\n<pre><code>&lt;?php\nupdate_option( 'siteurl', 'https://example.com' );\nupdate_option( 'home', 'https://example.com' );\n</code></pre>\n<p>Upload this file to your theme directory. Remove the lines or remove the file after the site is up and running again.</p>\n<h4>LAN-based site to externally accessible site</h4>\n<p>Here are some additional details that step you through transferring a LAN-based WordPress site into an externally accessible site, as well as enabling editing the wordpress site from inside the LAN.</p>\n<p>Two important keys are router/firewall modifications and the &#8220;wait 10+ minutes&#8221; after making the changes at the end.</p>\n<ol>\n<li>Using SSH to log into your server (nano is a server preinstalled text editor):</li>\n</ol>\n<p><code>$ nano /var/www/books/wp-content/themes/twentyeleven/functions.php</code></p>\n<ol>\n<li>Add lines just after <code>&lt;?php</code></li>\n</ol>\n<pre><code>update_option( 'siteurl', 'https://example.com:port/yourblog');\nupdate_option( 'home', 'https://example.com:port/yourblog');\n</code></pre>\n<ol>\n<li>Refresh your web browser using your external site URL:</li>\n</ol>\n<p>https://example.com:port/yourblog<br />\n<code>$ nano /var/www/books/wp-content/themes/twentyeleven/functions.php</code></p>\n<ol>\n<li>Remove those lines you just added (or comment them out)</p>\n</li>\n<li>\n<p>Access your router, these steps are for pfSense, other routers should have similar settings to look for/watch out for)</p>\n</li>\n<li>\n<p>Add to firewall/nat table a line like this</p>\n</li>\n</ol>\n<p><code>wan/tcp/port/LAN.server.IP/80</code></p>\n<ol>\n<li>Add to firewall/rules table a line like this:</li>\n</ol>\n<p><code>tcp/*/port/LAN.server.IP/port/*</code></p>\n<ol>\n<li>Uncheck the box at System/advanced/network address translation/Disable NAT Reflection</li>\n</ol>\n<p><code>\"Disables the automatic creation of NAT redirect rules for access to your public IP addresses from within your internal networks. Note: Reflection only works on port forward type items and does not work for large ranges &gt; 500 ports.\"</code></p>\n<ol>\n<li>Then go do something for ten minutes and when you get back see if the external url https://example.com:port/yourblog from a LAN browser brings the page up correctly. </li>\n</ol>\n<h4>Relocate method</h4>\n<p>WordPress supports an automatic relocation method intended to be a quick assist to getting a site working when relocating a site from one server to another.</p>\n<h4>Code function</h4>\n<p>When RELOCATE has been defined as true in <code>wp-config.php</code> (see next chapter), the following code in <code>wp-login.php</code> will take action:</p>\n<pre><code>if ( defined( 'RELOCATE' ) AND RELOCATE ) {    \n    // Move flag is set\n    if ( isset( $_SERVER['PATH_INFO'] ) AND ($_SERVER['PATH_INFO'] != $_SERVER['PHP_SELF']) ) \n        $_SERVER['PHP_SELF'] = str_replace( $_SERVER['PATH_INFO'], \"\", $_SERVER['PHP_SELF'] );\n    $url = dirname( set_url_scheme( 'https://'. $_SERVER['HTTP_HOST'] . $_SERVER['PHP_SELF'] ) );\n    if ( $url != get_option( 'siteurl' ) )\n        update_option( 'siteurl', $url );\n}\n</code></pre>\n<p><strong>Steps</strong></p>\n<ol>\n<li>Edit the <code>wp-config.php</code> file.</li>\n<li>After the &#8220;define&#8221; statements (just before the comment line that says &#8220;That&#8217;s all, stop editing!&#8221;), insert a new line, and type: <code>define('RELOCATE',true);</code></li>\n<li>Save your <code>wp-config.php</code> file.</li>\n<li>Open a web browser and manually point it to <code>wp-login.php</code> on the new server. For example, if your new site is at https://www.example.com, then type https://www.example.com/wp-login.php into your browser&#8217;s address bar.</li>\n<li>Login as per normal.</li>\n<li>Look in your web browser&#8217;s address bar to verify that you have, indeed, logged in to the correct server. If this is the case, then in the Admin back-end, navigate to <code>Settings &gt; General</code> and verify that both the address settings are correct. Remember to Save Changes.</li>\n<li>Once this has been fixed, edit <code>wp-config.php</code> and either completely remove the line that you added (delete the whole line), comment it out (with <code>//</code>) or change the true value to false if you think it&#8217;s likely you will be relocating again.</li>\n</ol>\n<p><strong>Note:</strong> When the <code>RELOCATE</code> flag is set to true, the Site URL will be automatically updated to whatever path you are using to access the login screen. This will get the admin section up and running on the new URL, but it will not correct any other part of the setup. You&#8217;ll still need to alter those manually.</p>\n<p><strong>Important!</strong> Leaving the RELOCATE constant in your <code>wp-config.php</code> file is insecure, as it allows an attacker to change your site URL to anything they want in some configurations. Always remove the RELOCATE line from <code>wp-config.php</code> after you&#8217;re done.</p>\n<h4>Changing the URL directly in the database</h4>\n<p>If you know how to access phpMyAdmin on your host, then you can edit these values directly to get your site up and running again.</p>\n<ol>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/security/backup/database/\">Backup your database</a> and save the copy off-site.</li>\n<li>Login to <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a>.</li>\n<li>Click the link to your <strong>Databases</strong>.</li>\n<li>A list of your databases will appear. Choose the one that is your WordPress database.</li>\n<li>All the tables in your database will appear on the screen.</li>\n<li>From the list, look for <code>wp_options</code>. <strong>Note:</strong> The table prefix of <code>wp_</code> may be different if you changed it when installing.</li>\n<li>Click on the small icon indicated as <strong>Browse</strong>.</li>\n<li>A screen will open with a list of the fields within the wp_options table.</li>\n<li>Under the field option_name, scroll down and look for <code>siteurl</code>.</li>\n<li>Click the <strong>Edit Field</strong> icon which usually is found at the far left at the beginning of the row.</li>\n<li>The <strong>Edit Field</strong> window will appear.</li>\n<li>In the input box for option_value, carefully change the URL information to the new address.</li>\n<li>Verify this is correct and click <strong>Go</strong> to save the information.</li>\n<li>You should be returned to your <code>wp_options</code> table.</li>\n<li>Look for the home field in the table and click <strong>Edit Field</strong>. <strong>Note:</strong> There are several pages of tables inside <code>wp_options</code>. Look for the &gt; symbol to page through them.</li>\n<li>In the input box for option_value, carefully change the URL information to the new address.</li>\n<li>Verify this is correct and click <strong>Go</strong> to save the information.</li>\n</ol>\n<h3>Moving Sites</h3>\n<p>When moving sites from one location to another, it is sometimes necessary to manually modify data in the database to make the new site URL information to be recognized properly. Many tools exist to assist with this, and those should generally be used instead of manual modifications.</p>\n<p>This is presented here as information only. This data may not be complete or accurate.</p>\n<p>You should read the <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/migrating/\">Moving WordPress</a> article first, if attempting to move WordPress from one system to another.</p>\n<h4>Altering Table Prefixes</h4>\n<p>Like many WordPress administrators, you may be running several WordPress installations off of one database using various <code>wp-config.php</code> hacks. Many of these hacks involve dynamically setting table prefixes, and if you do end up altering your table prefix, you must update several entries within the <code>prefix_usermeta</code> table as well.</p>\n<p>As in the above section, remember that SQL changes are permanent and so you should back up your database first:</p>\n<p>If you are changing table prefixes for a site, then remember to alter the table prefix in the usermeta tables as well. This will allow the new site to properly recognize user permissions from the old site.</p>\n<pre><code>UPDATE `newprefix_usermeta` SET `meta_key` = REPLACE( `meta_key` , 'oldprefix_', 'newprefix_' );\n</code></pre>\n<h4>Changing Template Files</h4>\n<p>In your WordPress Theme, open each template file and search for any manually entered references to your old domain name and replace it with the new one. Look for specific hand-coded links you may have entered on the various template files such as the <code>sidebar.php</code> and <code>footer.php</code>. WordPress uses a template tag called <code>bloginfo()</code> to automatically generate your site address from information entered in your Administration &gt; Settings &gt; General panel. The tag in your template files will not have to be modified.</p>\n<h4>Changing the Config file</h4>\n<p>You will need to update your WordPress configuration file if your database has moved or changed in certain ways.</p>\n<ol>\n<li>You will only need to modify the config file if:\n<ul>\n<li>your database has moved to another server and is not running on your localhost</li>\n<li>you have renamed your database</li>\n<li>you have changed the database user name</li>\n</ul>\n</li>\n<li>Make a backup copy of your <code>wp-config.php</code> file.</li>\n<li>Open the <code>wp-config.php</code> file in a <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#Text_editor\">text editor</a>.</li>\n<li>Review its contents. In particular, you are looking for the <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/#set-database-host\">database host entry</a>.</li>\n<li>Save the file.</li>\n<li>At this point, your WordPress blog should be working.  </li>\n</ol>\n<h4>Verify the Profile</h4>\n<ol>\n<li>In your <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration</a> &gt; <a href=\"https://wordpress.org/documentation/article/administration-screens/#general\">Settings</a> &gt; <a href=\"https://wordpress.org/documentation/article/settings-general-screen/\">General</a> panel, you will verify that the changes you made in Changing the URL above, are correct.</li>\n<li>Verify that the reference in your <strong>WordPress Address (URL)</strong> contains the new address.</li>\n<li>Verify that the reference in your <strong>Site Address (URL)</strong> contains the new address.</li>\n<li>If you have made changes, click <strong>Save Changes</strong>.</li>\n</ol>\n<h4>Changing the .htaccess file</h4>\n<p>After changing the information in your Administration &gt; Settings &gt; General panel, you will need to update your .htaccess file if you are using Permalinks or any rewrites or redirects.</p>\n<ol>\n<li><strong>Make a backup copy</strong> of your <code>.htaccess</code> file. This is not a recommendation but a requirement.</li>\n<li>Open the <code>.htaccess</code> file in a <a href=\"https://wordpress.org/documentation/article/glossary/#text-editor\">text editor</a>.</li>\n<li>Review its contents, looking for any custom rewrites or redirects you entered. <strong>Copy</strong> these to another text file for safe keeping.</li>\n<li>Close the file.</li>\n<li>Follow the instructions on the Permalinks SubPanel for updating your Permalinks to the <code>.htaccess</code> file.</li>\n<li>Open the new <code>.htaccess</code> file and check to see if your custom rewrites and redirects are still there. If not, copy them from the saved file and paste them into the new <code>.htaccess</code> file.</li>\n<li>Make any changes necessary in those custom rewrites and redirects to reflect the new site address.</li>\n<li>Save the file.</li>\n<li>Test those redirects to ensure they are working.</li>\n</ol>\n<p>If you make a mistake, you can <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/\">Restore Your Database</a> from your backup and try this again. So make sure it is right the first time.</p>\n<h4>Additional items of note</h4>\n<p>There are other things you may wish to change in order to correct URLs when moving sites.</p>\n<ol>\n<li>Images link: image links are stored in &#8220;post_content&#8221; in the <code>wp_posts</code> table. You can use the similar code above to update image links.</li>\n<li>wp_options: Besides the &#8220;siteurl&#8221; and &#8220;home&#8221; items mentioned above, there are other option_value that also need revision, such as &#8220;upload path&#8221;, and some plugin items (depends on what you&#8217;ve installed, such as widgets, stats, DMSGuestbook, sitemap, etc.)</li>\n<li>To fix widgets that contain outdated URL&#8217;s, you may edit them in Dashboard / Appearance / Widgets.</li>\n<li>Do a FULL database search for any items left. <strong>MAKE SURE</strong> you know what you are changing and go through each item for possible improper replacement.</li>\n<li>If you a running a network / have multiple sites, you will need to replace instances of the URL in the database. They are stored in many tables, including each one of the sites (blogs). Be careful in what you replace and be sure you know the meaning of the field before changing it. See the Important GUID note below for an example of what not to change.</li>\n<li><strong>Note:</strong> If you find your old URL in the database options table under <code>dashboard_incoming_links</code>, you can ignore or delete that option. It&#8217;s unused since WP 3.8.</li>\n</ol>\n<h4>Important GUID Note</h4>\n<p>When doing the above and changing the URLs directly in the database, you will come across instances of the URL being located in the &#8220;guid&#8221; column in the <code>wp_posts</code> tables. It is critical that you do NOT change the contents of this field.</p>\n<p>The term &#8220;GUID&#8221; stands for &#8220;Globally Unique Identifier&#8221;. It is a field that is intended to hold an identifier for the post which a) is unique across the whole of space and time and b) never, ever changes. The GUID field is primarily used to create the WordPress feeds.</p>\n<p>When a feed-reader is reading feeds, it uses the contents of the GUID field to know whether or not it has displayed a particular item before. It does this in one of various ways, but the most common method is simply to store a list of GUID&#8217;s that it has already displayed and &#8220;marked as read&#8221; or similar.</p>\n<p>Thus, changing the GUID will mean that many feedreaders will suddenly display your content in the user&#8217;s reader again as if it was new content, possibly annoying your users.</p>\n<p>In order for the GUID field to be &#8220;globally&#8221; unique, it is an accepted convention that the URL or some representation of the URL is used. Thus, if you own <code>example.com</code>, then you&#8217;re the only one using <code>example.com</code> and thus it&#8217;s unique to you and your site. This is why WordPress uses the permalink, or some form thereof, for the GUID.</p>\n<p>However, the second part of that is that the GUID must <em>never</em> change. Even if you shift domains around, the post is still the same post, even in a new location. Feed readers being shifted to your new feeds when you change URLs should still know that they&#8217;ve read some of your posts before, and thus the GUID <em>must</em> remain unchanged.</p>\n<p><strong>Never, ever, change the contents of the GUID column, under any circumstances.</strong></p>\n<p>If the default uploads folder needs to be changed to a different location, then any media URLs will need to be changed in the <code>post_content</code> column of the posts table. For example, if the default uploads folder is changing from <code>wp-content/uploads</code> to <code>images</code>:</p>\n<p><code>UPDATE wp_posts SET post_content = REPLACE(post_content,'www.domain.com/wp-content/uploads','www.domain.com/images');</code></p>\n<h4>Multi-site notes</h4>\n<p>See <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/migrating/#moving-wordpress-multisite\">Moving WordPress Multisite</a></p>\n<h4>wp-cli</h4>\n<p><a href=\"https://wp-cli.org/\">wp-cli</a> is a super useful shell tool.</p>\n<p><code>wp search-replace 'example.dev' 'example.com' --skip-columns=guid</code></p>\n<p>Or, if you only want to change the option, you can do:</p>\n<pre><code>wp option update home 'https://example.com'\nwp option update siteurl 'https://example.com'\n</code></pre>\n<h1>Moving WordPress</h1>\n<p>Whether you are moving WordPress to a new server or to a different location on your server, you don&#8217;t need to reinstall. WordPress is flexible enough to handle all of these situations.</p>\n<h2>Moving to a New Server</h2>\n<p>If you are moving WordPress from one server to another, begin by backing up your WordPress directory, images, plugins, and other files on your site as well as the database. See <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/\">WordPress Backups</a> and <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/database/\">Backing Up Your Database</a>.</p>\n<h3>Keeping Your Domain Name and URLs</h3>\n<p>Moving your domain without changing the Home and Site URLs of your WordPress site is very simple, and in most cases can be done by moving the files.</p>\n<ul>\n<li>If database and URL remain the same, you can move by just copying your files and database.</li>\n<li>If database name or user changes, <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">edit wp-config.php</a> to have the correct values.</li>\n<li>If you want to test before you switch, you must temporarily change &#8220;siteurl&#8221; and &#8220;home&#8221; in the database table &#8220;wp_options&#8221; (through phpMyAdmin or similar).</li>\n<li>If you had any kind of rewrites (permalinks) setup you must disable .htaccess and reconfigure permalinks when it goes live.</li>\n</ul>\n<h3>Changing Your Domain Name and URLs</h3>\n<p>Moving a website and changing your domain name or URLs (i.e. from https://example.com/site to https://example.com, or https://example.com to https://example.net) requires the following steps – in sequence.</p>\n<ol>\n<li>Download your existing site files.</li>\n<li>Export your database – go in to MySQL and export the database.</li>\n<li>Move the backed up files and database into a new folder – somewhere safe – this is your site backup.</li>\n<li>Log in to the site you want to move and go to Settings &gt; General, then change the URLs. (ie from https://example.com/ to https://example.net) – save the settings and expect to see a 404 page.</li>\n<li>Download your site files again.</li>\n<li>Export the database again.</li>\n<li>Edit <code>wp-config.php</code> with the new server&#8217;s MySQL database name, user and password.</li>\n<li>Upload the files.</li>\n<li>Import the database on the new server.</li>\n</ol>\n<p>When your domain name or URLs change there are additional concerns. The files and database can be moved, however references to the old domain name or location will remain in the database, and that can cause issues with links or theme display.</p>\n<p>If you do a search and replace on your entire database to change the URLs, you can cause issues with data serialization, due to the fact that some themes and widgets store values with the length of your URL marked. When this changes, things break. To avoid that serialization issue, you have three options:</p>\n<ol>\n<li>Use the <a href=\"https://wordpress.org/plugins/velvet-blues-update-urls/\">Velvet Blues Update URLs</a> or <a href=\"https://wordpress.org/plugins/better-search-replace/\">Better Search Replace</a> plugins if you can access your Dashboard.</li>\n<li>Use <a href=\"https://developer.wordpress.org/cli/commands/search-replace/\">WP-CLI&#8217;s search-replace</a> if your hosting provider (or you) have installed WP-CLI.</li>\n<li>Use the <a href=\"https://interconnectit.com/products/search-and-replace-for-wordpress-databases/\">Search and Replace for WordPress Databases Script</a> to safely change all instances on your old domain or path to your new one. (<strong>only use this option if you are comfortable with database administration</strong> )</li>\n</ol>\n<p>Note: Only perform a search and replace on the wp_posts table.<br />\nNote: Search and Replace from Interconnectit is a 3rd party script</p>\n<h2>Moving Directories On Your Existing Server</h2>\n<p>Moving the WordPress files from one location on your server to another – i.e. changing its URL – requires some special care. If you want to move WordPress to its own folder, but have it run from the root of your domain, please read Giving WordPress Its Own Directory for detailed instructions.</p>\n<p>Here are the step-by-step instructions to move your WordPress site to a new location on the same server:</p>\n<ol>\n<li>Create the new location using one of these two options:\n<ul>\n<li>If you will be moving your WordPress core files to a new directory, create the new directory.</li>\n<li>If you want to move WordPress to your root directory, make sure all <code>index.php</code>, <a href=\"https://wordpress.org/documentation/article/glossary/#htaccess\">.htaccess</a>, and other files that might be copied over are backed up and/or moved, and that the root directory is ready for the new WordPress files.</li>\n</ul>\n</li>\n<li>Log in to your site.</li>\n<li>Go to the <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration</a> &gt; <a href=\"https://wordpress.org/documentation/article/administration-screens/#settings-configuration-settings\">Settings</a> &gt; <a href=\"https://wordpress.org/documentation/article/settings-general-screen/\">General</a> screen.</li>\n<li>In the box for <strong>WordPress Address (URL)</strong>: change the address to the new location of your main WordPress core files.</li>\n<li>In the box for <strong>Site Address (URL)</strong>: change the address to the new location, which should match the WordPress (your public site) address.</li>\n<li>Click <strong>Save Changes</strong>.</li>\n<li>(Do not try to open/view your site now!)</li>\n<li>Move your WordPress core files to the new location. This includes the files found within the original directory, such as https://example.com/wordpress, and all the sub-directories, to the new location.</li>\n<li>Now, try to open your site by going to yourdomain.com/wp-admin. Note, you may need to go to yourdomain.com/wp-login.php</li>\n<li>If you are using <a href=\"https://wordpress.org/documentation/article/using-permalinks/\">Permalinks</a>, go to the Administration &gt; Settings &gt; <a href=\"https://wordpress.org/documentation/article/settings-permalinks-screen/\">Permalinks</a> panel and update your Permalink structure to your <a href=\"https://wordpress.org/documentation/article/glossary/#htaccess\">.htaccess</a>, file, which should be in the same directory as the main <code>index.php</code> file.</li>\n<li>Existing image/media links uploaded media will refer to the old folder and must be updated with the new location. You can do this with the <a href=\"https://wordpress.org/plugins/better-search-replace/\">Better Search Replace</a> or <a href=\"https://wordpress.org/plugins/velvet-blues-update-urls/\">Velvet Blues Update URLs</a> plugins, <a href=\"https://developer.wordpress.org/cli/commands/search-replace/\">WP-CLI&#8217;s search-replace</a> if your hosting provider (or you) have installed WP-CLI, manually in your SQL database, or by using the 3rd party database updating tool <a href=\"https://interconnectit.com/products/search-and-replace-for-wordpress-databases/\">Search and Replace Databases Script</a> * <strong>Note:</strong> this script is best used by experienced developers.</li>\n<li>In some cases your permissions may have changed, depending on your ISP. Watch for any files with &#8220;0000&#8221; permissions and change them back to &#8220;0644&#8221;.</li>\n<li>If your theme supports menus, links to your home page may still have the old subdirectory embedded in them. Go to Appearance &gt; Menus and update them.</li>\n<li>Sometimes you would need to restart your server, otherwise your server may give out an error. (happens in MAMP software (Mac)).</li>\n<li>It is important that you set the URI locations BEFORE you move the files.</li>\n</ol>\n<h4>If You Forget to Change the Locations</h4>\n<p>If you accidentally moved the files before you changed the URIs: you have two options.</p>\n<ol>\n<li>Suppose the files were originally in /path/to/old/ and you moved them to /path/to/new before changing the URIs. The way to fix this would be to make </li>\n</ol>\n<pre><code>/path/to/old/ a symlink (for Windows users, \"symlink\" is equivalent to \"shortcut\") to /path/to/new/, i.e.\nln -s /path/to/new /path/to/old\n</code></pre>\n<p>and then follow the steps above as normal. Afterwards, delete the symlink if you want.</p>\n<ol>\n<li>If you forget to change the WordPress Address and Blog Address, you will be unable to change it using the WordPress interface. However, you can fix it if you have access to the database. Go to the database of your site and find the wp_options table. This table stores all the options that you can set in the interface. The WordPress Address and Blog Address are stored as <code>siteurl</code> and <code>home</code> (the option_name field). All you have to do is change the option_value field to the correct URL for the records with <code>option_name='siteurl‘</code> or <code>option_name='home‘</code>.</li>\n</ol>\n<p>Note: Sometimes, the WordPress Address and Blog Address are stored in <a href=\"https://developer.wordpress.org/apis/handbook/transients/\">WordPress Transients</a>. Search and replace scripts can have trouble modifying those to the new address and some plugins might therefore refer to the old address because of them. Transients are temporary (cached) values stored in the wp_options database table that can be recreated on-demand when removed. It&#8217;s therefore safe to delete them from the migrated database copy and let them be recreated. This database query (again, have a backup!) clears all transients:</p>\n<pre><code>DELETE FROM `wp_options` WHERE option_name LIKE '%\\_transient\\_%' \n</code></pre>\n<h4>If You Have Accidentally Changed your WordPress Site URL</h4>\n<p>Suppose you accidentally changed the URIs where you cannot move the files (but can still access the login page, through a redirection or something).</p>\n<p><code>wp-login.php</code> can be used to (re-)set the URIs. Find this line:</p>\n<pre><code>require( dirname(__FILE__) . '/wp-load.php' );\n</code></pre>\n<p>and insert the following lines below:</p>\n<pre><code>//FIXME: do comment/remove these hack lines. (once the database is updated)\nupdate_option('siteurl', 'https://example.com/the/path' );\nupdate_option('home', 'https://example.com/the/path' );\n</code></pre>\n<p>You&#8217;re done. Test your site to make sure that it works right. If the change involves a new address for your site, make sure you let people know the new address, and consider adding some redirection instructions in your <code>.htaccess</code> file to guide visitors to the new location.</p>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/upgrade/migrating/\">Changing The Site URL</a> also provides the details of this process.</p>\n<h2>Managing Your Old Site</h2>\n<h3>Shutting It Down</h3>\n<ol>\n<li>Download a copy of the main WordPress files from your OLD site to your hard drive and <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">edit wp-config.php</a> to suit the new server.</li>\n<li>Go back to your OLD site and go to <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration</a> &gt; <a href=\"https://wordpress.org/documentation/article/administration-screens/#settings-configuration-settings\">Settings</a> &gt; <a href=\"https://wordpress.org/documentation/article/settings-general-screen/\">General</a> screen and change the URL (both of them) to that of your new site.</li>\n<li>Login on your server, go to phpMyAdmin, export as file, and save your database (but keep the old one just in case). Now, upload this new database and the copy of the wordpress core files with the edited wp-config.php to your new server. That&#8217;s it!</li>\n</ol>\n<h4>Keeping it Running</h4>\n<p>Caution: Make sure you have a backup of your old site&#8217;s WordPress database before proceeding!</p>\n<p><em>Part A – Activating Your New Site</em></p>\n<ol>\n<li>Download your entire WordPress installation to your hard drive. Name the folder appropriately to indicate that this is your OLD site&#8217;s installation.</li>\n<li>Download your database.</li>\n<li>Go back to your OLD site and go to options and change the url (both of them) to that of your new site.</li>\n<li>Again, download your entire WordPress installation to your hard drive. Name the folder appropriately to indicate that this is your NEW site&#8217;s installation.</li>\n<li>Download your database once again (but keep the old one). Upload this database to your new server. It will be easiest if you use the same database name and you create a user with the same login credentials on your new server as on your old server.</li>\n<li>If you used a different database name and/or user (see previous step), <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">edit wp-config.php</a> in your NEW site&#8217;s installation folder appropriately.</li>\n<li>Upload the NEW site&#8217;s installation folder to your new site. Presto, your NEW site should be working!</li>\n</ol>\n<p><em>Part B – Restoring Your Old Site</em></p>\n<ol>\n<li>On the original server, delete your OLD site&#8217;s database (remember, you should have a copy on your local computer that you made at the very beginning).</li>\n<li>Upload your OLD site&#8217;s installation folder to your original server, overwriting the files that are currently there (you may also delete the installation folder on the server and simply re-upload the OLD site&#8217;s files).</li>\n<li>Upload your OLD site&#8217;s database from your local computer to the server. That should do it!</li>\n</ol>\n<p>Another procedure for making copies of posts, comments, pages, categories and custom field (post status, data, permalinks, ping status, etc.) easy to follow:</p>\n<ol>\n<li>Install a new WordPress site</li>\n<li>Go to the old site Admin panel. Here, in Manage &gt; Export select &#8220;all&#8221; in the menu Restrict Author.</li>\n<li>Click on Download Export File</li>\n<li>In the new site go to Manage &gt; Import, and choose WordPress item.</li>\n<li>On the page that will be shown, select the file just exported. Click on Upload file and Import</li>\n<li>It will appear on a page. In Assign Authors, assign the author to users that already exist or create new ones.</li>\n<li>Click on Submit</li>\n<li>At the end, click on Have fun</li>\n</ol>\n<p><em>Note: using this method, if there are some articles in the new site (like Hello World, Info Page, etc.), these will not be erased. Articles are only added. Using the former procedure, the articles in the new site will be deleted.</em></p>\n<h2>Moving WordPress Multisite</h2>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">Multisite</a> is somewhat more complicated to move, as the database itself has multiple references to the server name as well as the folder locations. If you&#8217;re simply moving to a new server with the same domain name, you can copy the files and database over, exactly as you would a traditional install.</p>\n<p>If, instead, you are changing domains, then the best way to move Multisite is to move the files, edit the <code>.htaccess</code> and <code>wp-config.php</code> (if the folder name containing Multisite changed), and then manually edit the database. Search for all instances of your domain name, and change them as needed. This step cannot yet be easily automated. It&#8217;s safe to search/replace any of the <code>wp_x_posts</code> tables, however do not attempt blanket search/replace without the <a href=\"https://github.com/interconnectit/Search-Replace-DB\">Search and Replace for WordPress Databases</a> script (aka the interconnectit script).</p>\n<p>If you&#8217;re moving Multisite from one folder to another, you will need to make sure you edit the <code>wp_blogs</code> entries to change the folder name correctly. You should manually review both <code>wp_site</code> and <code>wp_blogs</code> regardless, to ensure all sites were changed correctly.</p>\n<p>Also, manually review all the wp_x_options tables look for three fields, and edit them as needed:</p>\n<ul>\n<li>home</li>\n<li>siteurl</li>\n<li>fileupload_url</li>\n</ul>\n<p>If you are moving from subdomains to subfolders, or vice-versa, remember to adjust the .htaccess file and the value for SUBDOMAIN_INSTALL in your <code>wp-config.php</code> file accordingly.</p>\n<h3>Related Links</h3>\n<ul>\n<li><a href=\"https://problogger.com/how-to-move-from-wordpresscom-to-wordpressorg/\">Moving a blog from wordpress.com to self-hosted blog</a></li>\n<li><a href=\"https://sltaylor.co.uk/blog/moving-wordpress-new-domain-server/\">Moving WordPress to a new domain or server</a></li>\n<li><a href=\"https://www.valent-blog.eu/2007/09/14/trasferire-wordpress/\">Italian version of this article – Versione italiana dell&#8217;articolo</a></li>\n<li><a href=\"https://interconnectit.com/search-and-replace-for-wordpress-databases/\">Search and Replace for WordPress Databases</a></li>\n<li><a href=\"http://blog.lavoie.sl/2012/07/php-script-to-replace-site-url-in.html\">PHP script to replace site url in WordPress database dump, even with WPML</a></li>\n<li><a href=\"https://wordpress.org/plugins/duplicator/\">The Duplicator plugin helps administrators move a site from one location to another</a></li>\n<li><a href=\"https://agileweboperations.com/2011/01/20/migrate-your-wordpress-blog-to-a-bitnami-ec2-instance/\">Technical tutorial on moving your WordPress blog to Bitnami&#8217;s AWS configuration</a></li>\n</ul>\n<h1>Migrating multiple blogs into WordPress multisite</h1>\n<p>This tutorial explains how to migrate multiples WordPress installs to a WordPress multisite install. You can migrate sites that use their own domain names, as well as sites that use a subdomain on your primary domain.</p>\n<p>This tutorial assumes that you are hosting WordPress on a server using cPanel. If you are using another solution to manage your server, you&#8217;ll have to adapt these instructions.</p>\n<h3>Steps to Follow</h3>\n<h4>Backup your site</h4>\n<p>Generate a full site backup in cPanel. It might also help to copy all the files on the server via FTP, so that you can easily access the files for plugins and themes, which you&#8217;ll need in a later step.</p>\n<h4>Export from your existing WordPress installs</h4>\n<p>In each of your existing WordPress installations, go to Tools &gt; Export in WordPress. Download the WXR files that contain all your posts and pages for each site. See the instructions on the <a href=\"https://wordpress.org/documentation/article/tools-export-screen/\">Tools Export Screen</a>.</p>\n<p>Make sure that your export file actually has all the posts and pages. You can verify this by looking at the last entry of the exported file using a text editor. The last entry should be the most recent post.</p>\n<p>Some plugins can conflict with the export process, generating an empty file, or a partially complete file. To be on the safe side, you should probably disable all plugins before doing the exports.</p>\n<p>It&#8217;s also a good idea to first delete all quarantined spam comments as these will also be exported, making the file unnecessarily large.</p>\n<p><strong>Note:</strong> Widget configuration and blog/plugin settings are NOT exported in this method. If you are migrating within a single hosting account, make note of those settings at this stage, because when you delete the old domain, they will disappear.</p>\n<h4>Install WordPress</h4>\n<p>Install WordPress. Follow the instructions for <a href=\"https://developer.wordpress.org/advanced-administration/before-install/howto-install/\">Installing WordPress</a>.</p>\n<h4>Activate multisite</h4>\n<p>Activate multi-site in your WordPress install. This involves editing <code>wp-config.php</code> a couple of times. You need to use the subdomain, not the subdirectory, option. See the instructions on how to <a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">Create A Network</a>.</p>\n<h4>Create blogs for each site you want to import</h4>\n<p>Create blogs for each of the sites you want to host in separate domains. For example, <code>importedblogdotorg.mydomain.com</code>.</p>\n<p>Note: choose the name carefully, because changing it causes admin redirection issues. This is particularly important if you are migrating a site within the same hosting account.</p>\n<h4>Import WXR files for each blog</h4>\n<p>Go to the backend of each blog, and import the exported WXR file for each blog. Map the authors to the proper users, or create new ones. Be sure to check the box that will pull in photos and other attachments. See the instructions on Tools Import SubPanel.</p>\n<p><strong>Note:</strong> If you choose to import images from the source site into the target site, make sure they have been uploaded into the right place and are displayed correctly in the respective post or page.</p>\n<h4>Edit WordPress configuration settings for each site</h4>\n<p>Edit the configuration settings, widget, etc. for each site. By the end of this step, each site should look exactly as it did before, only with the URL <code>subdomain.example.com</code> or <code>example.com/subsite</code> rather than its correct, final URL.</p>\n<h4>Limitations of PHP configuration</h4>\n<p>You may run into trouble with the PHP configuration on your host. There are two potential problems. One is that PHP&#8217;s <code>max_upload_size</code> will be too small for the WXR file. The other problem is that the PHP memory limit might be too small for importing all the posts.</p>\n<p>There are a couple of ways to solve it. One is to ask your hosting provider to up the limits, even temporarily. The other is to put a php.ini file in your /wp-admin/ and /wp-includes directories that ups the limits for you (php.ini files are not recursive, so it has to be in those directories). Something like a 10 MB upload limit and a 128 MB memory limit should work, but check with your hosting provider first so that you don&#8217;t violate the terms of your agreement.</p>\n<p>Search the <a href=\"https://wordpress.org/support/forums/\">WordPress forum support</a> for help with PHP configuration problems.</p>\n<h4>Converting add-on domains to parked domains</h4>\n<p>Deleting add-on domains in cPanel and replacing them with parked domains will also delete any domain forwarders and e-mail forwarders associated with those domains. Be aware of this, so that you can restore those forwarders once you&#8217;ve made the switch.</p>\n<h4>Limitations of importing users</h4>\n<p>As there is the above way to import the content into an instance of the Multisite-blog, you are running into massive troubles, when it gets to import multiple users. Users are generated during the import, but you won&#8217;t get any roles or additional information into the new blog.</p>\n<h4>Losing settings</h4>\n<p>If the old site is no longer available and you find you have forgotten to copy some setting or you want to make sure you have configured everything correctly, run a google search for your site and then click to view the cached version. This option is available only until your new site has been crawled, so you&#8217;d better be quick.</p>\n<p>Another option might be the <a href=\"https://archive.org/web/\">Internet Archive Wayback Machine</a>. They may have a copy of the site (or some part of it) archived.</p>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/changing-the-site-url/\">Changing The Site URL</a>, and <a href=\"https://wordpress.org/documentation/article/moving-wordpress/\">Moving WordPress</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145847,
    "menu_order": 5,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145852",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145852",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 7,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145852/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 152575,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145852/revisions/152575"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145847"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145852"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}