{
    "id": 148820,
    "date": "2023-09-14T14:28:27",
    "date_gmt": "2023-09-14T14:28:27",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/performance/php/"
    },
    "modified": "2024-01-16T20:30:02",
    "modified_gmt": "2024-01-16T20:30:02",
    "slug": "php",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/performance/php/",
    "title": {
        "rendered": "PHP Optimization"
    },
    "content": {
        "rendered": "<h2>PHP</h2>\n<p>PHP (PHP: Hypertext Preprocessor) is a popular programming language on the Internet. PHP turns dynamic content, like that in WordPress, into HTML, CSS, and JavaScript that web browsers can read. WordPress is written primarily in PHP, and a server must have PHP in order for WordPress to be able to run.</p>\n<p>As PHP is an interpreted language, its version and configuration has a large impact on how well and whether WordPress will run.</p>\n<h3>Version</h3>\n<p>When possible, PHP 7.4 or greater should be used to run WordPress. As of the writing of this document, PHP 7.4 is the officially supported version for WordPress while PHP 8.0 and 8.1 are &#8220;compatible with exceptions&#8221;, and PHP 8.2 is on &#8220;beta support&#8221;. PHP 8 is the only major version of PHP still receiving active development and support. The PHP group regularly retires support for older versions of PHP, and older versions are not guaranteed to be updated for security concerns.</p>\n<p>At the same time, newer versions of PHP contain both security and performance improvements, while being accompanied by new features and bug fixes, which are not guaranteed to be backwards compatible. However, extreme care must be taken when upgrading the version of PHP. While WordPress is compatible with the latest releases of PHP, sites built to use older versions of PHP may not be compatible due to their included plugins and themes.</p>\n<p>If upgrading to PHP 8 is not immediately possible, upgrading to PHP 7.4 should be done as soon as possible. While WordPress <em>may</em> work with older versions of PHP, these versions have reached official End Of Life, and running outdated PHP installations <strong>may expose your site to security vulnerabilities</strong>.</p>\n<p>You can find which PHP version is compatible with your WordPress version in the <a href=\"https://make.wordpress.org/core/handbook/references/php-compatibility-and-wordpress-versions/\">PHP Compatibility and WordPress Versions</a> page.</p>\n<p>More information about the support versions of PHP can always be found <a href=\"https://www.php.net/supported-versions.php\">on PHP&#8217;s supported versions page</a>.</p>\n<p>When upgrading PHP, it&#8217;s a good practice to test sites for compatibility before upgrading. If you offer multiple environments, such as a staging and a production environment, PHP version should be configurable separately for each environments. This will allow users to test newer version of PHP in their non-production environment and resolve any issues before upgrading PHP version in the production environment.</p>\n<p>There&#8217;s a useful <a href=\"https://github.com/danielbachhuber/php-compat-command\">WP-CLI command</a> for performing a general compatibility check, but be aware that it is not 100% accurate.</p>\n<h3>Configuration</h3>\n<p>PHP is primarily configured using a configuration file, <code>php.ini</code>, from which PHP reads all of its settings and configuration at runtime. This usually happens through CGI/FastCGI, or a process manager like PHP-FPM.</p>\n<p>Some server environment may allow PHP configurations to be customized with other files like the <code>.htaccess</code> or <code>.user.ini</code> file.</p>\n<p>You can see detailed information about each of these directives <a href=\"https://www.php.net/manual/en/ini.core.php\">in the official PHP documentation</a>.</p>\n<h4>Timeouts</h4>\n<p>There are several timeout settings on a system that limit different aspects of a request. When configuring your timeouts, it&#8217;s important to select values that work well together. For example, it doesn&#8217;t make sense to have a very high script execution timeout on your PHP service, if the web server (e.g. Apache) timeout is lower than that &#8211; in such case, if the request takes longer, it will be killed by the web server no matter your PHP timeout setting is.</p>\n<p>Note that processes take different amount of time, depending on the server load, and those limitations are placed to ensure that your server functions properly. If you have high server load, processes may take longer to complete thus causing a cascade effect leading to even more server load. That&#8217;s why it&#8217;s a matter of balance between giving enough time for your scripts to be compiled and ensuring that you&#8217;re within normal server loads.</p>\n<p>The primary PHP timeout can be set with the <a href=\"https://www.php.net/manual/en/info.configuration.php#ini.max-execution-time\"><code>max_execution_time</code></a> <code>php.ini</code> directive. This limits code execution, and not system library calls or MySQL queries, <a href=\"https://www.php.net/manual/en/function.set-time-limit.php\">except on Windows</a>, where it does.</p>\n<p>The maximum time allowed for data transfer from the web server to PHP is specified with the <a href=\"https://www.php.net/manual/en/info.configuration.php#ini.max-input-time\"><code>max_input_time</code></a> <code>php.ini</code> directive. It is usually used to limit the amount of time allowed to upload files. It&#8217;s important to note that the amount of time is separate from <code>max_execution_time</code>, and defines the amount of time between when the web server calls PHP and execution starts.</p>\n<p>Note that these timeouts are often configured per server and you won&#8217;t be able to modify them if you&#8217;re on a shared hosting account. The best approach would be to contact your hosting company tech support and see if they can be modified to suit your needs.</p>\n<h4>Memory Limits</h4>\n<p>The maximum amount of memory that PHP is allowed to use per page render is specified with the <a href=\"https://www.php.net/manual/en/ini.core.php#ini.memory-limit\"><code>memory limit</code></a> <code>php.ini</code> directive.</p>\n<p>In addition to setting memory limits within PHP, WordPress has two memory configuration constants that can be changed in the <strong>wp-config.php</strong> file. WordPress will raise the PHP <code>memory_limit</code> to these values if it has permission to do so, but if the <code>php.ini</code> specifies higher amounts, WordPress will not lower the amount allowed.</p>\n<p>The option <code>WP_MEMORY_LIMIT</code> declares the amount of memory WordPress should request for rendering the frontend of the website. WordPress default is 40 MB and WordPress MultiSite default is 64 MB.</p>\n<pre><code>define( 'WP_MEMORY_LIMIT', '128M' );\n</code></pre>\n<p>The option <code>WP_MAX_MEMORY_LIMIT</code> declares the amount of memory WordPress should request for rendering the backend of the website. WordPress default is 256 MB.</p>\n<pre><code>define( 'WP_MAX_MEMORY_LIMIT', '256M' );\n</code></pre>\n<p>Since the WordPress backend usually requires more memory, there&#8217;s a separate setting for the amount, that can be set for logged in users. This is mainly required for media uploads. You can have it set higher than the front end limit to ensure your backend has all the resources it needs. Usually, <code>WP_MEMORY_LIMIT &lt;= WP_MAX_MEMORY_LIMIT</code>.</p>\n<h4>File Upload Sizes</h4>\n<p>When uploading media files and other content to WordPress using the WordPress admin dashboard, WordPress uses PHP to process the uploads. PHP&#8217;s configuration includes limits on the size of files that can be uploaded through PHP and on the size of requests that can be sent to the web server for processing. These will need to align with the server&#8217;s timeouts, discussed above.</p>\n<p>The limit on the size of individual file uploads can be configured using the <a href=\"https://www.php.net/manual/en/ini.core.php#ini.upload-max-filesize\"><code>upload_max_filesize</code></a> <code>php.ini</code> directive.</p>\n<p>The limit on the entire size of a request that can be sent from the web server to PHP for processing can be configured using the <a href=\"https://www.php.net/manual/en/ini.core.php#ini.post-max-size\"><code>post_max_size</code></a> <code>php.ini</code> directive. The value for <code>post_max_size</code> must be greater than or equal to the value for <code>upload_max_filesize</code>. PHP will not process requests larger in size than the value for <code>post_max_size</code>.</p>\n<p>Note that <code>post_max_size</code> applies to every PHP request and not only uploads, so it may become important to address separately if a site processes a large amount of other data included with the request.</p>\n<p>Bear in mind that on shared hosting accounts, those limits are usually set on a server level and you may not be able to modify them or increase them above a certain value. In addition to that, different setups have different ways to modify the above mentioned values. Contact your hosting company tech support for additional assistance on that matter.</p>\n<h4>Replacing WordPress&#8217; Cron Triggers</h4>\n<p>The <code>wp-cron.php</code> script is responsible for causing certain tasks to be scheduled and executed automatically. Every time someone visits your website, <code>wp-cron.php</code> checks whether it is time to execute a job or not. Even though these checks are small and fast they consume time and produce load. For this reason, it&#8217;s worth considering setting the <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/#disable-cron-and-cron-timeout\"><code>DISABLE_WP_CRON</code> constant</a> and using an alternative method to trigger WordPress&#8217; cron system. Note, however, that the WordPress cron system is designed with performance in mind and requires minimal resources to operate so it&#8217;s not mandatory to replace it unless you really need to do so.</p>\n<h2>Changelog</h2>\n<ul>\n<li>2023-06-08: New page created.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145870,
    "menu_order": 3,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-148820",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/148820",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/148820/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151921,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/148820/revisions/151921"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145870"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=148820"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}