{
    "id": 145869,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/security/hardening/"
    },
    "modified": "2024-07-17T06:16:14",
    "modified_gmt": "2024-07-17T06:16:14",
    "slug": "hardening",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/security/hardening/",
    "title": {
        "rendered": "Hardening WordPress"
    },
    "content": {
        "rendered": "<p>Security in WordPress is <a href=\"https://wordpress.org/about/security/\">taken very seriously</a>, but as with any other system there are potential security issues that may arise if some basic security precautions aren&#8217;t taken. This article will go through some common forms of vulnerabilities, and the things you can do to help keep your WordPress installation secure.</p>\n<p>This article is not the ultimate quick fix to your security concerns. If you have specific security concerns or doubts, you should discuss them with people whom you trust to have sufficient knowledge of computer security and WordPress.</p>\n<h2 id=\"what-is-security\">What is Security?</h2>\n<p>Fundamentally, security <em>is not</em> about perfectly secure systems. Such a thing might well be impractical, or impossible to find and/or maintain. What security is though is risk reduction, not risk elimination. It&#8217;s about employing all the appropriate controls available to you, within reason, that allow you to improve your overall posture reducing the odds of making yourself a target, subsequently getting hacked.</p>\n<p><strong>Website Hosts</strong></p>\n<p>Often, a good place to start when it comes to website security is your hosting environment. Today, there are a number of options available to you, and while hosts offer security to a certain level, it&#8217;s important to understand where their responsibility ends and yours begins. Here is a good article explaining the complicated dynamic between <a href=\"https://perezbox.com/2014/11/how-hosts-manage-your-website-security/\">web hosts and the security of your website</a>. A secure server protects the privacy, integrity, and availability of the resources under the server administrator&#8217;s control.</p>\n<p>Qualities of a trusted web host might include:</p>\n<ul>\n<li>Readily discusses your security concerns and which security features and processes they offer with their hosting.</li>\n<li>Provides the most recent stable versions of all server software.</li>\n<li>Provides reliable methods for backup and recovery.</li>\n</ul>\n<p>Decide which security you need on your server by determining the software and data that needs to be secured. The rest of this guide will help you with this.</p>\n<p><strong>Website Applications</strong></p>\n<p>It&#8217;s easy to look at web hosts and pass the responsibility of security to them, but there is a tremendous amount of security that lies on the website owner as well. Web hosts are often responsible for the infrastructure on which your website sits, they are not responsible for the application you choose to install.</p>\n<p>To understand where and why this is important you must <a href=\"https://blog.sucuri.net/2015/05/website-security-how-do-websites-get-hacked.html\">understand how websites get hacked</a>, Rarely is it attributed to the infrastructure, and most often attributed to the application itself (i.e., the environment you are responsible for).</p>\n<h3 id=\"security-themes\">Security Themes</h3>\n<p>Keep in mind some general ideas while considering security for each aspect of your system:</p>\n<p><strong>Limiting access</strong></p>\n<p>Making smart choices that reduce possible entry points available to a malicious person.</p>\n<p><strong>Containment</strong></p>\n<p>Your system should be configured to minimize the amount of damage that can be done in the event that it is compromised.</p>\n<p><strong>Preparation and knowledge</strong></p>\n<p>Keeping backups and knowing the state of your WordPress installation at regular intervals. Having a plan to backup and recover your installation in the case of catastrophe can help you get back online faster in the case of a problem.</p>\n<p><strong>Trusted Sources</strong></p>\n<p>Do not get plugins/themes from untrusted sources. Restrict yourself to the WordPress.org repository or well known companies. Trying to get plugins/themes from the outside <a href=\"https://blog.sucuri.net/2014/03/unmasking-free-premium-wordpress-plugins.html\">may lead to issues</a>.</p>\n<h3 id=\"vulnerabilities-on-your-computer\">Vulnerabilities on Your Computer</h3>\n<p>Make sure the computers you use are free of spyware, malware, and virus infections. No amount of security in WordPress or on your web server will make the slightest difference if there is a keylogger on your computer.</p>\n<p>Always keep your operating system and the software on it, especially your web browser, up to date to protect you from security vulnerabilities. If you are browsing untrusted sites, we also recommend using tools like no-script (or disabling javascript/flash/java) in your browser.</p>\n<h3 id=\"vulnerabilities-in-wordpress\">Vulnerabilities in WordPress</h3>\n<p>Like many modern software packages, WordPress is updated regularly to address new security issues that may arise. Improving software security is always an ongoing concern, and to that end <strong>you should always keep up to date with the latest version of WordPress</strong>. Older versions of WordPress are not maintained with security updates.</p>\n<h4 id=\"updating-wordpress\">Updating WordPress</h4>\n<p>Main article: <a href=\"https://wordpress.org/documentation/article/updating-wordpress/\">Updating WordPress</a>.</p>\n<p>The latest version of WordPress is always available from the main WordPress website at https://wordpress.org. Official releases are not available from other sites — <strong>never</strong> download or install WordPress from any website other than https://wordpress.org.</p>\n<p>Since version 3.7, WordPress has featured automatic updates. Use this functionality to ease the process of keeping up to date. You can also use the WordPress Dashboard to keep informed about updates. Read the entry in the Dashboard or the WordPress Developer Blog to determine what steps you must take to update and remain secure.</p>\n<p>If a vulnerability is discovered in WordPress and a new version is released to address the issue, the information required to exploit the vulnerability is almost certainly in the public domain. This makes old versions more open to attack, and is one of the primary reasons you should always keep WordPress up to date.</p>\n<p>If you are an administrator in charge of more than one WordPress installation, consider using <a href=\"https://codex.wordpress.org/Installing/Updating_WordPress_with_Subversion\">Subversion</a> to make management easier.</p>\n<h4 id=\"reporting-security-issues\">Reporting Security Issues</h4>\n<p>If you think you have found a security flaw in WordPress, you can help by reporting the issue. See the <a href=\"https://make.wordpress.org/core/handbook/testing/reporting-security-vulnerabilities/\">Security FAQ</a> for information on how to report security issues.</p>\n<p>If you think you have found a bug, report it. See <a href=\"https://make.wordpress.org/core/handbook/testing/reporting-bugs/\">Submitting Bugs</a> for how to do this. You might have uncovered a vulnerability, or a bug that could lead to one.</p>\n<h3 id=\"web-server-vulnerabilities\">Web Server Vulnerabilities</h3>\n<p>The web server running WordPress, and the software on it, can have vulnerabilities. Therefore, make sure you are running secure, stable versions of your web server and the software on it, or make sure you are using a trusted host that takes care of these things for you.</p>\n<p>If you&#8217;re on a shared server (one that hosts other websites besides your own) and a website on the same server is compromised, your website can potentially be compromised too even if you follow everything in this guide. Be sure to ask your <a href=\"https://wordpress.org/documentation/article/glossary/#Hosting_provider\">web host</a> what security precautions they take.</p>\n<h3 id=\"network-vulnerabilities\">Network Vulnerabilities</h3>\n<p>The network on both ends — the WordPress server side and the client network side — should be trusted. That means updating firewall rules on your home router and being careful about what networks you work from. An Internet cafe where you are sending passwords over an unencrypted connection, wireless or otherwise, is <strong>not</strong> a trusted network.</p>\n<p>Your web host should be making sure that their network is not compromised by attackers, and you should do the same. Network vulnerabilities can allow passwords and other sensitive information to be intercepted.</p>\n<h3 id=\"passwords\">Passwords</h3>\n<p>Many potential vulnerabilities can be avoided with good security habits. A strong password is an important aspect of this.</p>\n<p>The goal with your password is to make it hard for other people to guess and hard for a <a href=\"https://developer.wordpress.org/advanced-administration/security/brute-force/\">brute force attack</a> to succeed. Many <a href=\"https://www.google.com/?q=password+generator\">automatic password generators</a> are available that can be used to create secure passwords.</p>\n<p>WordPress also features a password strength meter which is shown when changing your password in WordPress. Use this when changing your password to ensure its strength is adequate.</p>\n<p>Things to avoid when choosing a password:</p>\n<ul>\n<li>Any permutation of your own real name, username, company name, or name of your website.</li>\n<li>A word from a dictionary, in any language.</li>\n<li>A short password.</li>\n<li>Any numeric-only or alphabetic-only password (a mixture of both is best).</li>\n</ul>\n<p>A strong password is necessary not just to protect your blog content. A hacker who gains access to your administrator account is able to install malicious scripts that can potentially compromise your entire server.</p>\n<p>In addition to using a strong password, it&#8217;s a good idea to enable <a href=\"https://developer.wordpress.org/advanced-administration/security/mfa/\">two-step authentication</a> as an additional security measure.</p>\n<h3 id=\"ftp\">FTP</h3>\n<p>When connecting to your server you should use SFTP encryption if your web host provides it. If you are unsure if your web host provides SFTP or not, just ask them.</p>\n<p>Using SFTP is the same as FTP, except your password and other data is encrypted as it is transmitted between your computer and your website. This means your password is never sent in the clear and cannot be intercepted by an attacker.</p>\n<h3 id=\"file-permissions\">File Permissions</h3>\n<p>Some neat features of WordPress come from allowing various files to be writable by the web server. However, allowing write access to your files is potentially dangerous, particularly in a shared hosting environment.</p>\n<p>It is best to lock down your file permissions as much as possible and to loosen those restrictions on the occasions that you need to allow write access, or to create specific folders with less restrictions for the purpose of doing things like uploading files.</p>\n<p>Here is one possible permission scheme.</p>\n<p>All files should be owned by your user account, and should be writable by you. Any file that needs write access from WordPress should be writable by the web server, if your hosting set up requires it, that may mean those files need to be group-owned by the user account used by the web server process.</p>\n<p><strong><code>/</code></strong></p>\n<p>The root WordPress directory: all files should be writable only by your user account, except <code>.htaccess</code> if you want WordPress to automatically generate rewrite rules for you.</p>\n<p><strong><code>/wp-admin/</code></strong></p>\n<p>The WordPress administration area: all files should be writable only by your user account.</p>\n<p><strong><code>/wp-includes/</code></strong></p>\n<p>The bulk of WordPress application logic: all files should be writable only by your user account.</p>\n<p><strong><code>/wp-content/</code></strong></p>\n<p>User-supplied content: intended to be writable by your user account and the web server process.</p>\n<p>Within <code>/wp-content/</code> you will find:</p>\n<p><strong><code>/wp-content/themes/</code></strong></p>\n<p>Theme files. If you want to use the built-in theme editor, all files need to be writable by the web server process. If you do not want to use the built-in theme editor, all files can be writable only by your user account.</p>\n<p><strong><code>/wp-content/plugins/</code></strong></p>\n<p>Plugin files: all files should be writable only by your user account.</p>\n<p>Other directories that may be present with <code>/wp-content/</code> should be documented by whichever plugin or theme requires them. Permissions may vary.</p>\n<h4 id=\"changing-file-permissions\">Changing file permissions</h4>\n<p>If you have shell access to your server, you can change file permissions recursively with the following command:</p>\n<p>For Directories:</p>\n<pre><code>find /path/to/your/wordpress/install/ -type d -exec chmod 755 {} \\;\n</code></pre>\n<p>For Files:</p>\n<pre><code>find /path/to/your/wordpress/install/ -type f -exec chmod 644 {} \\;\n</code></pre>\n<h4 id=\"regarding-automatic-updates\">Regarding Automatic Updates</h4>\n<p>When you tell WordPress to perform an automatic update, all file operations are performed as the user that owns the files, not as the web server&#8217;s user. All files are set to 0644 and all directories are set to 0755, and writable by only the user and readable by everyone else, including the web server.</p>\n<h3 id=\"database-security\">Database Security</h3>\n<p>If you run multiple blogs on the same server, it is wise to consider keeping them in separate databases each managed by a different user. This is best accomplished when performing the initial <a href=\"https://developer.wordpress.org/advanced-administration/before-install/howto-install/\">WordPress installation</a>. This is a containment strategy: if an intruder successfully cracks one WordPress installation, this makes it that much harder to alter your other blogs.</p>\n<p>If you administer MySQL yourself, ensure that you understand your MySQL configuration and that unneeded features (such as accepting remote TCP connections) are disabled. See <a href=\"https://www.securityfocus.com/infocus/1667\">Secure MySQL Database Design</a> for a nice introduction.</p>\n<h4 id=\"restricting-database-user-privileges\">Restricting Database User Privileges</h4>\n<p>For normal WordPress operations, such as posting blog posts, uploading media files, posting comments, creating new WordPress users and installing WordPress plugins, the MySQL database user only needs data read and data write privileges to the MySQL database; SELECT, INSERT, UPDATE and DELETE.</p>\n<p>Therefore any other database structure and administration privileges, such as DROP, ALTER and GRANT can be revoked. By revoking such privileges you are also improving the containment policies.</p>\n<p><strong>Note:</strong> Some plugins, themes and major WordPress updates might require to make database structural changes, such as add new tables or change the schema. In such case, before installing the plugin or updating a software, you will need to temporarily allow the database user the required privileges.</p>\n<p><strong>WARNING:</strong> Attempting updates without having these privileges can cause problems when database schema changes occur. Thus, it is <strong>NOT</strong> recommended to revoke these privileges. If you do feel the need to do this for security reasons, then please make sure that you have a solid backup plan in place first, with regular whole database backups which you have tested are valid and that can be easily restored. A failed database upgrade can usually be solved by restoring the database back to an old version, granting the proper permissions, and then letting WordPress try the database update again. Restoring the database will return it back to that old version and the WordPress administration screens will then detect the old version and allow you to run the necessary SQL commands on it. Most WordPress upgrades do not change the schema, but some do. Only major point upgrades (3.7 to 3.8, for example) will alter the schema. Minor upgrades (3.8 to 3.8.1) will generally not. Nevertheless, <strong>keep a regular backup</strong>.</p>\n<h3 id=\"securing-wp-admin\">Securing wp-admin</h3>\n<p>Adding server-side password protection (such as <a href=\"https://en.wikipedia.org/wiki/Basic_access_authentication\">BasicAuth</a>) to <code>/wp-admin/</code> adds a second layer of protection around your blog&#8217;s admin area, the login screen, and your files. This forces an attacker or bot to attack this second layer of protection instead of your actual admin files. Many WordPress attacks are carried out autonomously by malicious software bots.</p>\n<p>Simply securing the <code>wp-admin/</code> directory might also break some WordPress functionality, such as the AJAX handler at <code>wp-admin/admin-ajax.php</code>. See the <a href=\"https://developer.wordpress.org/advanced-administration/resources/\">Resources</a> section for more documentation on how to password protect your <code>wp-admin/</code> directory properly.</p>\n<p>The most common attacks against a WordPress blog usually fall into two categories.</p>\n<ol>\n<li>Sending specially-crafted HTTP requests to your server with specific exploit payloads for specific vulnerabilities. These include old/outdated plugins and software.</li>\n<li>Attempting to gain access to your blog by using &#8220;brute-force&#8221; password guessing.</li>\n</ol>\n<p>The ultimate implementation of this &#8220;second layer&#8221; password protection is to require an HTTPS SSL encrypted connection for administration, so that all communication and sensitive data is encrypted. <em>See <a href=\"https://developer.wordpress.org/advanced-administration/security/https/\">Administration Over SSL</a>.</em></p>\n<h3 id=\"securing-wp-includes\">Securing wp-includes</h3>\n<p>A second layer of protection can be added where scripts are generally not intended to be accessed by any user. One way to do that is to block those scripts using mod_rewrite in the .htaccess file. <strong>Note:</strong> to ensure the code below is not overwritten by WordPress, place it outside the <code># BEGIN WordPress</code> and <code># END WordPress</code> tags in the .htaccess file. WordPress can overwrite anything between these tags.</p>\n<pre><code># Block the include-only files.\n&lt;IfModule mod_rewrite.c&gt;\nRewriteEngine On\nRewriteBase /\nRewriteRule ^wp-admin/includes/ - [F,L]\nRewriteRule !^wp-includes/ - [S=3]\nRewriteRule ^wp-includes/[^/]+\\.php$ - [F,L]\nRewriteRule ^wp-includes/js/tinymce/langs/.+\\.php - [F,L]\nRewriteRule ^wp-includes/theme-compat/ - [F,L]\n&lt;/IfModule&gt;\n# BEGIN WordPress\n</code></pre>\n<p>Note that this won&#8217;t work well on Multisite, as <code>RewriteRule ^wp-includes/[^/]+\\.php$ - [F,L]</code> would prevent the ms-files.php file from generating images. Omitting that line will allow the code to work, but offers less security.</p>\n<h3 id=\"securing-wp-config-php\">Securing wp-config.php</h3>\n<p>You can move the <code>wp-config.php</code> file to the directory above your WordPress install. This means for a site installed in the root of your webspace, you can store <code>wp-config.php</code> outside the web-root folder.</p>\n<p><strong>Note:</strong> Some people assert that <a href=\"https://wordpress.stackexchange.com/questions/58391/is-moving-wp-config-outside-the-web-root-really-beneficial\">moving wp-config.php has minimal security benefits</a> and, if not done carefully, may actually introduce serious vulnerabilities. <a href=\"https://wordpress.stackexchange.com/questions/58391/is-moving-wp-config-outside-the-web-root-really-beneficial/74972#74972\">Others disagree</a>.</p>\n<p>Note that <code>wp-config.php</code> can be stored ONE directory level above the WordPress (where wp-includes resides) installation. Also, make sure that only you (and the web server) can read this file (it generally means a 400 or 440 permission).</p>\n<p>If you use a server with .htaccess, you can put this in that file (at the very top) to deny access to anyone surfing for it:</p>\n<pre><code>&lt;Files \"wp-config.php\"&gt;\nRequire all denied\n&lt;/Files&gt;\n</code></pre>\n<h3 id=\"disable-file-editing\">Disable File Editing</h3>\n<p>The WordPress Dashboard by default allows administrators to edit PHP files, such as plugin and theme files. This is often the first tool an attacker will use if able to login, since it allows code execution. WordPress has a constant to disable editing from Dashboard. Placing this line in wp-config.php is equivalent to removing the &#8216;edit_themes&#8217;, &#8216;edit_plugins&#8217; and &#8216;edit_files&#8217; capabilities of all users:</p>\n<pre><code>define( 'DISALLOW_FILE_EDIT', true );\n</code></pre>\n<p>This will not prevent an attacker from uploading malicious files to your site, but might stop some attacks.</p>\n<h3 id=\"plugins\">Plugins</h3>\n<p>First of all, make sure your plugins are always updated. Also, if you are not using a specific plugin, delete it from the system.</p>\n<h4 id=\"firewall\">Firewall</h4>\n<p>There are many plugins and services that can act as a firewall for your website. Some of them work by modifying your .htaccess<br />\nfile and restricting some access at the Apache level, before it is processed by WordPress. A good example is <a href=\"https://wordpress.org/plugins/better-wp-security/\">iThemes Security</a> or <a href=\"https://wordpress.org/plugins/all-in-one-wp-security-and-firewall/\">All in One WP Security</a>. Some firewall plugins act at the WordPress level, like <a href=\"https://wordpress.org/plugins/wordfence/\">WordFence</a> and <a href=\"https://wordpress.org/plugins/wp-simple-firewall/\">Shield</a>, and try to filter attacks as WordPress is loading, but before it is fully processed.</p>\n<p>Besides plugins, you can also install a WAF (web firewall) at your web server to filter content before it is processed by WordPress. The most popular open source WAF is ModSecurity.</p>\n<p>A website firewall can also be added as intermediary between the traffic from the internet and your hosting server. These services all function as reverse proxies, in which they accept the initial requests and reroute them to your server, stripping it of all malicious requests. They accomplish this by modifying your DNS records, via an A record or full DNS swap, allowing all traffic to pass through the new network first. This causes all traffic to be filtered by the firewall before reaching your site. A few companies offer such service, like <a href=\"https://www.cloudflare.com/\">CloudFlare</a>, <a href=\"https://sucuri.net/wordpress-security/\">Sucuri</a> and <a href=\"https://www.imperva.com/\">Incapsula</a>.</p>\n<p>Additionally, these third parties service providers function as Content Distribution Network (CDNs) by default, introducing performance optimization and global reach.</p>\n<h4 id=\"plugins-that-need-write-access\">Plugins that need write access</h4>\n<p>If a plugin wants write access to your WordPress files and directories, please read the code to make sure it is legit or check with someone you trust. Possible places to check are the <a href=\"https://wordpress.org/support/welcome/\">Support Forums</a> and <a href=\"https://make.wordpress.org/support/handbook/appendix/other-support-locations/introduction-to-irc/\">IRC Channel</a>.</p>\n<h4 id=\"code-execution-plugins\">Code execution plugins</h4>\n<p>As we said, part of the goal of hardening WordPress is containing the damage done if there is a successful attack. Plugins which allow arbitrary PHP or other code to execute from entries in a database effectively magnify the possibility of damage in the event of a successful attack.</p>\n<p>A way to avoid using such a plugin is to use <a href=\"https://wordpress.org/documentation/article/pages/#Creating_your_own_Page_Templates\">custom page templates</a> that call the function. Part of the security this affords is active only when you <a href=\"#File_Permissions\">disallow file editing within WordPress</a>.</p>\n<h3 id=\"security-through-obscurity\">Security through obscurity</h3>\n<p><a href=\"https://en.wikipedia.org/wiki/Security_through_obscurity\">Security through obscurity</a> is generally an unsound primary strategy. However, there are areas in WordPress where obscuring information <em>might</em> help with security:</p>\n<ol>\n<li><strong>Rename the administrative account:</strong> When creating an administrative account, avoid easily guessed terms such as <code>admin</code> or <code>webmaster</code> as usernames because they are typically subject to attacks first. On an existing WordPress install you may rename the existing account in the MySQL command-line client with a command like:</li>\n</ol>\n<pre><code>UPDATE wp_users SET user_login = 'newuser' WHERE user_login = 'admin';\n</code></pre>\n<p>or by using a MySQL frontend like <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/phpmyadmin/\">phpMyAdmin</a>.<br />\n2. <strong>Change the table_prefix:</strong> Many published WordPress-specific SQL-injection attacks make the assumption that the table_prefix is <code>wp_</code>, the default. Changing this can block at least some SQL injection attacks.</p>\n<h3 id=\"data-backups\">Data Backups</h3>\n<p>Back up your data regularly, including your MySQL databases. See the main article: <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/database/\">Backing Up Your Database</a>.</p>\n<p>Data integrity is critical for trusted backups. Encrypting the backup, keeping an independent record of MD5 hashes for each backup file, and/or placing backups on read-only media increases your confidence that your data has not been tampered with.</p>\n<p>A sound backup strategy could include keeping a set of regularly-timed snapshots of your entire WordPress installation (including WordPress core files and your database) in a trusted location. Imagine a site that makes weekly snapshots. Such a strategy means that if a site is compromised on May 1st but the compromise is not detected until May 12th, the site owner will have pre-compromise backups that can help in rebuilding the site and possibly even post-compromise backups which will aid in determining how the site was compromised.</p>\n<h3 id=\"logging\">Logging</h3>\n<p>Logs are your best friend when it comes to understanding what is happening with your website, especially if you&#8217;re trying to perform forensics. Contrary to popular beliefs, logs allow you to see what was done and by who and when. Unfortunately the logs will not tell you who, username, logged in, but it will allow you to identify the IP and time and more importantly, the actions the attacker might have taken. You will be able to see any of these attacks via the logs – Cross Site Scripting (XSS), Remote File Inclusion (RFI), Local File Inclusion (LFI) and Directory Traversal attempts. You will also be able to see brute force attempts. There are various <a href=\"https://blog.sucuri.net/2015/08/ask-sucuri-how-did-my-wordpress-website-get-hacked-a-tutorial.html\">examples and tutorials</a> available to help guide you through the process of parsing and analyzing your raw logs.</p>\n<p>If you get more comfortable with your logs you&#8217;ll be able to see things like, when the theme and plugin editors are being used, when someone updates your widgets and when posts and pages are added. All key elements when doing forensic work on your web server. The are a few WordPress Security plugins that assist you with this as well, like the <a href=\"https://wordpress.org/plugins/sucuri-scanner/\">Sucuri Auditing tool</a> or the <a href=\"https://wordpress.org/plugins/audit-trail/\">Audit Trail</a> plugin.</p>\n<p>There are two key open-source solutions you&#8217;ll want on your web server from a security perspective, this is a layered approach to security.</p>\n<p>OSSEC can run on any NIX distribution and will also run on Windows. When configured correctly its very powerful. The idea is correlate and aggregate all the logs. You have to be sure to configure it to capture all access_logs and error_logs and if you have multiple websites on the server account for that. You&#8217;ll also want to be sure to filter out the noise. By default you&#8217;ll see a lot of noise and you&#8217;ll want to configure it to be really effective.</p>\n<h3 id=\"monitoring\">Monitoring</h3>\n<p>Sometimes prevention is not enough and you may still be hacked. That&#8217;s why intrusion detection/monitoring is very important. It will allow you to react faster, find out what happened and recover your site.</p>\n<h4 id=\"monitoring-your-logs\">Monitoring your logs</h4>\n<p>If you are on a dedicated or virtual private server, in which you have the luxury of root access, you have the ability easily configure things so that you can see what&#8217;s going on. <a href=\"https://www.ossec.net/\">OSSEC</a> easily facilitates this and here is a little write up that might help you out <a href=\"https://perezbox.com/2013/03/ossec-for-website-security-part-i/\">OSSEC for Website Security – Part I</a>.</p>\n<h4 id=\"monitoring-your-files-for-changes\">Monitoring your files for changes</h4>\n<p>When an attack happens, it always leave traces. Either on the logs or on the file system (new files, modified files, etc). If you are using <a href=\"https://www.ossec.net/\">OSSEC</a> for example, it will monitor your files and alert you when they change.</p>\n<h5 id=\"goals\">Goals</h5>\n<p>The goals of file system tracking include:</p>\n<ul>\n<li>Monitor changed and added files</li>\n<li>Log changes and additions</li>\n<li>Ability to revert granular changes</li>\n<li>Automated alerts</li>\n</ul>\n<h5 id=\"general-approaches\">General approaches</h5>\n<p>Administrators can monitor file system via general technologies such as:</p>\n<ul>\n<li>System utilities</li>\n<li>Revision control</li>\n<li>OS/kernel level monitoring</li>\n</ul>\n<h5 id=\"specific-tools\">Specific tools</h5>\n<p>Options for file system monitoring include:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Diff_utility\">diff</a> – build clean test copy of your site and compare against production</li>\n<li><a href=\"https://git-scm.com/\">Git</a> – source code management</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Inotify\">inotify</a> and <a href=\"https://inotify.aiken.cz/?section=incron&amp;page=doc&amp;lang=en\">incron</a> – OS kernel level file monitoring service that can run commands on filesystem events</li>\n<li><a href=\"https://github.com/gregghz/Watcher/blob/master/jobs.yml\">Watcher</a> – Python inotify library</li>\n<li><a href=\"https://www.ossec.net/\">OSSEC</a> – Open Source Host-based Intrusion Detection System that performs log analysis, file integrity checking, policy monitoring, rootkit detection, real-time alerting and active response.</li>\n</ul>\n<h5 id=\"considerations\">Considerations</h5>\n<p>When configuring a file based monitoring strategy, there are many considerations, including the following.</p>\n<h6>Run the monitoring script/service as root</h6>\n<p>This would make it hard for attackers to disable or modify your file system monitoring solution.</p>\n<h6>Disable monitoring during scheduled maintenance/upgrades</h6>\n<p>This would prevent unnecessary notifications when you are performing regular maintenance on the site.</p>\n<h6>Monitor only executable filetypes</h6>\n<p>It may be reasonably safe to monitor only executable file types, such as .php files, etc.. Filtering out non-executable files may reduce unnecessary log entries and alerts.</p>\n<h6>Use strict file system permissions</h6>\n<p>Read about securing file permissions and ownership. In general, avoid allowing <em>execute</em> and <em>write</em> permissions to the extent possible.</p>\n<h4 id=\"monitoring-your-web-server-externally\">Monitoring your web server externally</h4>\n<p>If the attacker tries to deface your site or add malware, you can also detect these changes by using a web-based integrity monitor solution. This comes in many forms today, use your favorite search engine and look for Web Malware Detection and Remediation and you&#8217;ll likely get a long list of service providers.</p>\n<h3 id=\"resources\">Official WordPress Resources</h3>\n<ul>\n<li><a href=\"https://wordpress.org/about/security/\">WordPress Security Whitepaper</a></li>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/security/brute-force/\">Brute Force Attacks</a></li>\n<li><a href=\"https://make.wordpress.org/core/handbook/testing/reporting-security-vulnerabilities/\">Security FAQ</a></li>\n<li><a href=\"https://wordpress.org/documentation/article/faq-my-site-was-hacked/\">FAQ – My site was hacked</a></li>\n</ul>\n<h3 id=\"see-also\">See Also</h3>\n<ul>\n<li><a href=\"https://snyk.io/series/open-source-security/\">Open Source Security Explained</a> (Snyk)</li>\n<li><a href=\"https://patchstack.com/articles/is-wordpress-safe/\">Is WordPress Safe?</a> (Patchstack)</li>\n<li><a href=\"https://httpd.apache.org/docs/current/howto/auth.html\">Authentication and Authorization — Official documentation for Apache HTTP server 2.2</a></li>\n<li><a href=\"https://docs.nginx.com/nginx/admin-guide/security-controls/\">Security Controls</a> and <a href=\"https://docs.nginx.com/nginx-management-suite/acm/how-to/policies/advanced-security/\">Advanced Security documentation for NGINX</a></li>\n<li>Gridpane&#8217;s <a href=\"https://gridpane.com/knowledgebase/security/\">WordPress Security Knowledgebase</a> and <a href=\"https://gridpane.com/knowledgebase/security-strategies-and-tools/\">WordPress Security Step-by-Step</a></li>\n<li><a href=\"https://snicco.io/blog/how-wordpress-uses-authentication-cookies-and-sessions\">How WordPress Uses Authentication Cookies &amp; Sessions: A Technical Deep-Dive</a> (Snicco)</li>\n<li><a href=\"https://snicco.io/blog/wordpress-salts\">How WordPress Uses Salts and Why You Should Not Rotate Them: A Technical Deep-Dive</a> (Snicco)</li>\n<li><a href=\"https://github.com/snicco/fortress/blob/beta/docs/modules/session/session-managment-and-security.md#session-management-and-security\">Session Management and Security</a> (Snicco)</li>\n<li><a href=\"https://cio.ubc.ca/information-security/policy-standards-and-resources/securing-wordpress\">Securing WordPress Information Security Guideline</a> (The University of British Columbia’s OCIO)</li>\n<li><a href=\"https://dothewoo.io/security-from-the-basics-to-enterprise-with-calvin-alkan/\">Security, From the Basics to Enterprise with Calvin Alkan, Kathy Zant, and Carl Alexander</a> (Video)</li>\n<li><a href=\"https://blog.sucuri.net/2012/08/wordpress-security-cutting-through-the-bs.html\">WordPress Security Cutting Through the BS</a></li>\n<li><a href=\"https://newcodepoet.files.wordpress.com/2012/07/lockingdownwordpress1-1.pdf\">e-Book: Locking Down WordPress</a></li>\n<li><a href=\"https://wordpress.tv/2010/01/23/brad-williams-security-boston10/\">Brad Williams: Lock it Up (Video)</a></li>\n<li><a href=\"https://wordpress.org/plugins/tags/security\">Security Plugins</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2022-10-25: Original content from <a href=\"https://wordpress.org/documentation/article/hardening-wordpress/\">Hardening WordPress</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145863,
    "menu_order": 6,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145869",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145869",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145869/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 154468,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145869/revisions/154468"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145863"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145869"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}