{
    "id": 145865,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/security/mfa/"
    },
    "modified": "2024-01-16T20:30:05",
    "modified_gmt": "2024-01-16T20:30:05",
    "slug": "mfa",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/security/mfa/",
    "title": {
        "rendered": "Two Step Authentication"
    },
    "content": {
        "rendered": "<p>Also known as Two-Factor Authentication.</p>\n<p>Two-step authentication is showing up all over the Internet as more sites look for better ways to secure logins, which are the weakest part of anything a user does online.</p>\n<h3 id=\"what-is-two-step-authentication\">What is Two-Step Authentication</h3>\n<p>Passwords are the de-facto standard for logging in on the web, but they&#8217;re relatively easy to break. Even if you make good passwords and change them regularly, they need to be stored wherever you&#8217;re logging in, and a server breach can leak them. There are three ways to identify a person, things they are, things they have, and things they know.</p>\n<p>Logging in with a password is single-step authentication. It relies only on something you know. Two-step authentication, by definition, is a system where you use two of the three possible factors to prove your identity, instead of just one. In practice, however, current two-step implementations still rely on a password you know, but use your Phone or another device to authenticate with something you have.</p>\n<h4 id=\"three-possible-factors\">Three Possible Factors</h4>\n<p>There are three possible ways to identify users.</p>\n<p><strong>Something You Are</strong></p>\n<p>There are a lot of properties that are unique to each user and can be used to identify them. The most popular is fingerprints, but retinas, voice, DNA, or anything else specific to an individual will work. This is called biometric information because these pieces of information all belong to a person&#8217;s biology.</p>\n<p>Biometric factors are interesting because they are not easily forged and the user can never lose or forget them. However, biometric authentication is tricky because a lost fingerprint can never be replaced. If hackers were to gain access to a database of fingerprints, there is no way that users could reset them or get a new set.</p>\n<p>In 2013, Apple released TouchID which lets users unlock their iPhones using their fingerprints. This technology is interesting because the fingerprints are stored locally on the phone, not in the cloud where they would be easier for hackers to steal. There are still trade-offs with this kind of approach, but it is the most widespread consumer use of biometric authentication to date.</p>\n<p><strong>Something You Have</strong></p>\n<p>Also known as the possession factor, users can be identified by the devices which they carry. Traditionally, a company that wanted to enable two-step authentication would distribute secure keychain fobs to users. The keychain fobs would display a new number every 30 seconds, and that number would be needed to be typed along with the password every time a user logged in.</p>\n<p>Modern two-step authentication more frequently relies on a user&#8217;s smartphone than on a new piece of hardware. One common model of this uses SMS in order to provide an easy second factor. When the user enters their password, they are sent a text message with a unique code. By entering that code, after the password, they supposedly prove that they also have their phone. Unfortunately, SMS is not a secure communication channel, so smartphone apps and <a href=\"#plugins-for-two-step-authentication\">plugins</a> have been developed to create that secure channel.</p>\n<p><strong>Something You Know</strong></p>\n<p>The most familiar form of authentication is the knowledge factor, or password. As old as <a href=\"https://en.wikipedia.org/wiki/Open_sesame\">Open Sesame</a>, passwords have long been a standard for anonymous authentication. In order for a knowledge factor to work, both parties need to know the password, but other parties must not be able to find or guess it.</p>\n<p>The first challenge is in exchanging the password with the trusted party safely. On the web, when you register for a new site, your password needs to be sent to that site&#8217;s servers and might be intercepted in the process (which is why you should always check for SSL when registering or logging in — <a href=\"https://developer.wordpress.org/advanced-administration/security/https/\">HTTPS</a>).</p>\n<p>Once the password has been received, it must be kept secret. The user shouldn&#8217;t write it down or use it anywhere else, and the site needs to carefully guard its database to ensure that hackers can&#8217;t access the passwords.</p>\n<p>Finally, the password needs to be verified. When a user visits the site, they need to be able to provide the password and have it verified against the stored copy. This exchange can also be intercepted (and so should always be done over SSL — <a href=\"https://developer.wordpress.org/advanced-administration/security/https/\">HTTPS</a>) and exposes the user to another risk.</p>\n<h4 id=\"benefits\">Benefits</h4>\n<p>There are a lot of different places to increase the security of a site, but the WordPress Security Team <a href=\"https://wpvip.com/security/\">has said</a> that &#8220;The weakest link in the security of anything you do online is your password,&#8221; so it makes sense to put energy into strengthening that aspect of your site.</p>\n<h4 id=\"drawbacks\">Drawbacks</h4>\n<p>As the name implies, two-step authentication is adding a step to a process that can already be long and painful. While most very high-security logins are protected by two-step authentication today, most consumer applications barely offer it as an option if they offer it at all. This is because users are less likely to sign up for and log in to a service if it is more difficult.</p>\n<p>Two-step authentication can also prevent legitimate logins. If a user forgets their phone at home and has two-step authentication enabled, then they won&#8217;t be able to access their account. This is one of the main reasons why smartphones have been useful for two-step authentication — users are more likely to be carrying their phones than almost anything else.</p>\n<h4 id=\"plugins-for-two-step-authentication\">Plugins for Two-Step Authentication</h4>\n<p>You can <a href=\"https://wordpress.org/plugins/tags/two-factor-authentication\">search for two-step authentication plugins</a> available in the WordPress.org plugin repository. Here are some of the most popular ones to get you started (in alphabetical order):</p>\n<ul>\n<li><a href=\"https://wordpress.org/plugins/duo-wordpress/\">Duo</a></li>\n<li><a href=\"https://wordpress.org/plugins/google-authenticator/\">Google Authenticator</a></li>\n<li><a href=\"https://wordpress.org/plugins/rublon/\">Rublon</a></li>\n<li><a href=\"https://wordpress.org/plugins/two-factor/\">Two-Factor</a></li>\n<li><a href=\"https://wordpress.org/plugins/wordfence/\">WordFence</a></li>\n</ul>\n<h3 id=\"related\">Related</h3>\n<ul>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/security/brute-force/\">Brute Force Attacks</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2022-10-25: Original content from <a href=\"https://wordpress.org/documentation/article/two-step-authentication/\">Two Step Authentication</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145863,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145865",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145865",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145865/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151567,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145865/revisions/151567"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145863"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145865"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}