{
    "id": 145872,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/performance/optimization/"
    },
    "modified": "2024-01-16T20:30:04",
    "modified_gmt": "2024-01-16T20:30:04",
    "slug": "optimization",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/performance/optimization/",
    "title": {
        "rendered": "Optimization"
    },
    "content": {
        "rendered": "<p>Whether you run a high traffic WordPress installation or a small blog on a low cost shared host, you should optimize WordPress and your server to run as efficiently as possible. This article provides a broad overview of WordPress optimization, with specific recommended approaches. However, it&#8217;s not a detailed technical explanation of each aspect.</p>\n<p>If you need a quick fix now, go straight to the Caching section, you&#8217;ll get the biggest benefit for the smallest hassle there. If you want to get started on a more thorough optimization process immediately, go to <a href=\"#how-to-improve-performance-in-wordpress\">How to Improve Performance on WordPress</a>.</p>\n<p>A broad overview of the topic of performance is included below in <a href=\"#performance-factors\">Performance factors</a> and <a href=\"#performance-testing-tools\">Performance testing tools</a>. Many of the techniques discussed here also apply to WordPress Multisite (MU).</p>\n<h2>Performance factors</h2>\n<p>Several factors can affect the performance of your WordPress blog (or website). Those factors include, but are not limited to, the hosting environment, WordPress configuration, software versions, number of images and their file sizes.</p>\n<p>Most of these performance degrading factors are addressed here in this article.</p>\n<h3>Hosting</h3>\n<p>The optimization techniques available to you will depend on your hosting setup.</p>\n<h4>Shared Hosting</h4>\n<p>This is the most common type of hosting. Your site will be hosted on a server along with many others. The hosting company manage the web server for you, so you have very little control over server settings and so on. In most shared hosting, the user can access the file system of the website root via SFTP and many of the common domain/hosting tasks via a <a href=\"https://developer.wordpress.org/advanced-administration/server/control-panel/\">web hosting control panel</a>.</p>\n<p>The areas most relevant to this type of hosting are: <a href=\"#caching\">Caching</a>, <a href=\"#optimizing-your-wordpress-website\">WordPress Performance</a>, and <a href=\"#content-offloading\">Content Offloading</a>.</p>\n<h4>Managed Hosting</h4>\n<p>Managed hosting is similar to shared hosting, but more locked down to a set of software stacks that the users can run for a particular set of usage scenarios. Hence, the hosting provider manages the software stacks for the users, but with the condition of limiting the software selections. The users typically don&#8217;t have (or the need) to access the file system and manage any tasks via a <a href=\"https://developer.wordpress.org/advanced-administration/server/control-panel/\">web hosting control panel</a>. Some hosting providers will offer more choice in the selection of software or plug-ins in the upper tier of the hosting plans.</p>\n<p>Most of the content platforms on the web today (e.g. blogging / social media) are a form of managed hosting, as their purpose is to provide a platform for a particular set of usage scenarios.</p>\n<h4>Virtual Private Servers and Dedicated Servers</h4>\n<p>In this hosting scenario, you have control over your own server: the entire file system, SSH, and the ability to install/configure any software on an independent operating system dedicated to the server. The server might be a dedicated piece of hardware or one of many virtual servers sharing the same physical hardware.</p>\n<p>The key thing is, you have control over the server settings. In addition to the areas above (caching and WordPress performance), the key areas of interest here are: <a href=\"#optimize-software\">Optimize Software</a> and <a href=\"#content-offloading\">Content Offloading</a>.</p>\n<h4>Number of Servers</h4>\n<p>When dealing with very high traffic situations, it may be necessary to employ multiple servers. If you&#8217;re at this level, you should already have employed all the applicable techniques listed above.</p>\n<p>The WordPress database can be easily moved to a different server and only requires a small change to the config file. Likewise, images and other static files can be moved to alternative servers (see <a href=\"#content-offloading\">Content Offloading</a>).</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Load_balancing_(computing)\">Load balancers</a> can help spread traffic across multiple web servers but requires a higher level of expertise. If you&#8217;re employing multiple database servers, the <a href=\"https://codex.wordpress.org/HyperDB\">HyperDB</a> class provides a drop-in replacement for the standard <a href=\"https://developer.wordpress.org/reference/classes/wpdb/\">WPDB</a> class, and can handle multiple database servers in both replicated and partitioned structures.</p>\n<h4>Hardware Performance</h4>\n<p>Your hardware capability will have a huge impact on your site performance. The number of processors, the processor speed, the amount of available memory, disk space, and the disk storage medium are important factors. Hosting providers generally offer higher performance for a higher price.</p>\n<h4>Geographical distance</h4>\n<p>The distance between your server and your website visitors also has an impact on performance. A Content Delivery Network, or CDN, can mirror static files (like images) across various geographic regions so that all your site visitors have optimal performance.</p>\n<h4>Server Load</h4>\n<p>The amount of traffic on your server and how it&#8217;s configured to handle the load will have a huge impact as well. For example, if you don&#8217;t use a caching solution, performance will slow to a halt as additional page requests come in and stack up, often crashing your web or database server.</p>\n<p>If configured properly, most hosting solutions can handle very high traffic amounts. Offloading traffic to other servers can also reduce server load.</p>\n<p>Abusive traffic such as login <a href=\"https://developer.wordpress.org/advanced-administration/security/brute-force/\">Brute Force attacks</a>, image hotlinking (other sites linking to your image files from high traffic pages) or DoS attacks can also increase server load. Identifying and blocking these attacks is critical.</p>\n<h4>Software version &amp; performance</h4>\n<p>Making sure you are using the latest software is also important, as software upgrades often fix bugs and enhance performance. Making sure you&#8217;re running the latest version of Linux (or Windows), Apache, MySQL/MariaDB, and PHP is essential.</p>\n<h3>WordPress Configuration</h3>\n<p>Your theme will have a huge impact on the performance of your site. A fast lightweight theme will perform much more efficiently than a heavy graphic-laden inefficient one.</p>\n<p>The number of plugins and their performance will also have a huge impact on your site&#8217;s performance. Deactivating and deleting unnecessary plugins is a significant way to improve performance.</p>\n<p>Keeping up with WordPress upgrades is also important.</p>\n<h4>Size of Graphics</h4>\n<p>Making sure the images in your posts are optimized for the web can save time, bandwidth, and increase your search engine ranking.</p>\n<h2>Performance testing tools</h2>\n<ul>\n<li><a href=\"https://duckduckgo.com/?q=online+web+page+benchmarking+tools\">Online web page benchmarking tools</a> can test real life website performance from different locations, browsers, and connection speeds.</li>\n<li>The built-in browser developer tools (e.g. Firefox or Chrome) all have performance measurement tools.</li>\n</ul>\n<h2>How to improve performance on WordPress</h2>\n<h3>Optimizing Your WordPress Website</h3>\n<h4>Minimizing Plugins</h4>\n<p>The first and easiest way to improve WordPress performance is by looking at the plugins. Deactivate and delete any unnecessary plugins. Try selectively disabling plugins to measure server performance.</p>\n<p>Is one of your plugins significantly affecting your site&#8217;s performance? Look at the plugin documentation, ask for support in the appropriate plugin support forum or look for alternative plugins with similar featuresets.</p>\n<h4>Optimizing content</h4>\n<p><em>Image Files</em></p>\n<ul>\n<li>Are there any unnecessary images? (e.g. Can you replace some of the images with text?)</li>\n<li>Make sure all image files are optimized. Choose the correct format (JPG/PNG/GIF) and compression for each image.</li>\n<li>Consider using a more modern image format like WebP which is smaller in size. </li>\n</ul>\n<p><em>Total File Number/Size</em></p>\n<ul>\n<li>Can you reduce the number of files needed to display the average page on your site?</li>\n<li>When still using HTTP/1.x, it&#8217;s recommended to combine multiple files in a single optimized file.</li>\n<li>Minify CSS and JavaScript files.</li>\n</ul>\n<h3>Upgrade Hardware</h3>\n<p>Paying more for higher service levels at your hosting provider can be very effective. Increasing CPU and memory (RAM) or switching to a host with Solid-State Drives (SSD) or NVMe can make a big difference. Increased number of processors and processor speed will also help. Where possible, try to separate services with different functions – like HTTP and MySQL – on multiple servers or VPS (the servers should ideally be in the same location to reduce latency). If you are on shared hosting, upgrading to a plan with higher resource limits like Disk I/O, IOPS, NPROC and total processes of your hosting plan may help if you are maxing out your limits.</p>\n<h3>Optimize Software</h3>\n<p>Make sure you are running the latest operating system version (e.g. Linux or Windows Server), the latest web server version (e.g. Apache or IIS), database (e.g. MySQL server), and PHP.</p>\n<p>If you are unable to perform the following tasks below, your hosting provider may be able to perform some of them for you, or you may seek external help such as freelancers to help you. A good hosting provider will upgrade or move your account to an upgraded server to match the recommended spec, but not all of them will help you manage/optimize your servers, since it&#8217;s typically outside the scope of hosting plan offerings. If needed, a managed WordPress hosting solution, with a pre-chosen set of software stacks and fixed versions, could be a potential fit for your needs.</p>\n<p><strong>DNS</strong>: Don&#8217;t run a DNS on your WordPress server. Use a commercial DNS service or your domain registrar&#8217;s free offering. Using an external service can also make switching between backup servers during maintenance or emergencies much easier. It also provides a degree of fault tolerance. If you host your DNS on external servers, it will reduce the load on your primary web server. It&#8217;s a simple change, but it will offload some traffic and CPU load.</p>\n<p><strong>Web Server</strong>: Your web server can be configured to increase performance. There is a range of techniques, from web server caching to setting cache headers to reduce load per visitor. Search for your specific web server optimizations (for example, search for &#8220;Apache optimization&#8221; for more info). Some web servers have higher speed versions you can pay for. There are also a number of ways to tune Apache for higher performance based on your particular hosting and site configuration (e.g. Memcached).</p>\n<p><strong>PHP</strong>: There are various PHP accelerators available which can dramatically improve the performance of your PHP files. This will apply to all PHP files, not just your WordPress installation. Search for PHP optimization for more information (e.g. <a href=\"https://www.php.net/manual/book.apcu.php\">APC</a> or <a href=\"https://www.php.net/manual/book.opcache.php\">OPcache</a>). Some WordPress caching plugins offer integrated support for Memcached, APC and other Opcode caching. Newer PHP versions will usually include better performance optimization as well.</p>\n<p><strong>MySQL/MariaDB</strong>: MySQL or MariaDB optimization is a black art in itself. A few simple changes to the query cache settings can have a dramatic effect on WordPress performance because WordPress repeats many queries on every request. Nowadays, with InnoDB being the default storage engine for MySQL, you have to make sure to use that. InnoDB can be optimized and fine-tuned, search the web for <a href=\"https://duckduckgo.com/?q=mysql+optimization\">mysql optimization</a>, <a href=\"https://duckduckgo.com/?q=mysql+innodb+performance\">mysql innodb performance</a> or <a href=\"https://duckduckgo.com/?q=innodb+optimization\">innodb optimization</a> for more information and examples. Search the web for <a href=\"https://duckduckgo.com/?q=mysql+convert+myisam+to+innodb\">mysql convert myisam to innodb</a> for information on how to convert older MyISAM tables to InnoDB.</p>\n<p><strong>Other services</strong>: Don&#8217;t run a mail server on your WordPress server. For your contact form, use a contact form plug-in along with an external mailing service.</p>\n<h3>Caching</h3>\n<h4>Caching Plugins</h4>\n<p>Caching plugins can be easily installed and will cache your WordPress posts and pages as static files. These static files are then served to users, reducing the processing load on the server. This can improve performance several hundred times over for fairly static pages. You can get a list of relevant plugins by searching for <a href=\"https://wordpress.org/plugins/search/cache/\">cache</a> in the plugins directory.</p>\n<p>When combined with a system-level page cache such as Varnish, this can be powerful. If your posts/pages have a lot of dynamic content, configuring caching can be more complex.</p>\n<h4>Server-side Caching</h4>\n<p>Web server caching is more complex, but is used on very high traffic sites. A wide range of options are available, beyond the scope of this article. The simplest solutions start with the server caching locally, while more complex and involved systems may use multiple caching servers (also known as reverse proxy servers) &#8220;in front&#8221; of web servers where the WordPress application is currently running. Some web servers can also act as a reverse proxy at the same time. Adding an opcode cache like <a href=\"https://www.php.net/manual/book.apcu.php\">Alternative PHP Cache</a> (APC) to your server will improve the performance of PHP by many times.</p>\n<p><a href=\"https://varnish-cache.org/\">Varnish Cache</a> works in concert with some cache plug-ins to store pre-built pages in memory and serve them quickly without requiring execution of the Apache, PHP, and WordPress stack.</p>\n<p>As described within, using an external comments plugin for comments instead of native WordPress comments can assist Varnish by not requiring your readers to log in to WordPress and increasing the number of page views that Varnish Cache can serve out of the cache.</p>\n<h4>Browser Caching</h4>\n<p>Browser caching can help to reduce server load by reducing the number of requests per page. For example, by setting the correct file headers on files that don&#8217;t change (static files like images, CSS, JavaScript etc.), browsers will then cache these files on the user&#8217;s computer. This technique allows the browser to check to see if files have changed, instead of simply requesting them. The result is your web server can answer many more 304 responses, confirming that a file is unchanged, instead of 200 responses, which require the file to be sent.</p>\n<p>Look into HTTP Cache-Control (specifically <code>max-age</code>) and Expires headers, as well as <a href=\"https://developer.mozilla.org/docs/Web/HTTP/Headers/ETag\">Entity Tags</a> for more information.</p>\n<p>Some WordPress cache plug-ins integrate support for browser caching and ETag.</p>\n<h4>Object Caching</h4>\n<p>Using a <strong>persistent</strong> Object Cache helps speed up page load times by saving on trips to the database from your web server. For example, your site&#8217;s options data needs to be available for each page view. Without a persistent object cache, your web server must read those options from the database to handle every page view. Those extra trips to the database slow down your web server&#8217;s response times such as &#8220;Time to first byte&#8221; (TTFB) and can quickly overwhelm your database server during traffic spikes.</p>\n<p>For your site to use persistent object caching, your hosting provider must offer you a particular type of server, a <a href=\"https://en.wikipedia.org/wiki/Category:Database_caching\">cache server</a>. Ask your hosting provider or external help such as freelancers to help you install and configure a persistent object cache server, then, install an <a href=\"https://wordpress.org/plugins/search/object+cache/\">object cache WP plug-in</a> that supports the cache server installed:</p>\n<h3>Further Reading</h3>\n<ul>\n<li><a href=\"https://developer.wordpress.org/reference/classes/wp_object_cache/\">WP Object Cache</a></li>\n</ul>\n<h3>Content Offloading</h3>\n<h4>Use a Content Delivery Network (CDN)</h4>\n<p>Using a CDN can greatly reduce the load on your website. Offloading the searching and delivery of images, JavaScript, CSS and theme files to a CDN are not only faster but takes a great load off your WordPress server&#8217;s own app stack. A CDN is most effective if used with a WordPress caching plugin, described above. Some newer CDN will also include Full Page Caching (FPC) or Edge Caching which will cache the entire HTML content of the website.</p>\n<p>For details, see <a href=\"https://en.wikipedia.org/wiki/Content_delivery_network#Notable_content_delivery_service_providers\">list of notable content delivery service providers</a>.</p>\n<h4>Static Content</h4>\n<p>Any static files can be offloaded to another server. For example, any static images, JavaScript, or CSS files can be moved to a different server. This is a common technique in very high-performance systems (Google, Flickr, YouTube, etc.) but can also be helpful for smaller sites where a single server is struggling. Also, moving this content onto different hostnames can lay the groundwork for multiple servers in the future.</p>\n<p>Some web servers are optimized to serve static files and can do so far more efficiently than more complex web servers like Apache, for example <a href=\"https://www.lighttpd.net/\">lighttpd</a>.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Object_storage#Cloud_storage\">Cloud storage</a> is a dedicated static file hosting service on a pay-per-usage basis. With no minimum costs, it might be practical for lower traffic sites which are reaching the peak that a shared or single server can handle.</p>\n<h4>Multiple Hostnames</h4>\n<p>There can also be user improvements by splitting static files between multiple hostnames. Most browsers will only make 2 simultaneous requests to a host, so if your page requires 16 files, they will be requested 2 at a time. If you spread the 16 files between 4 host names, they will be requested 8 at a time. This can reduce page loading times for the user, but it can increase server load (if the different hosts names are served by the same server) by creating more simultaneous requests. Also, known is &#8220;pipelining&#8221; can often saturate the visitor&#8217;s internet connection if overused.</p>\n<p>Offloading images is the easiest and simplest place to start. All images files could be evenly split between three hostnames (<code>assets1.example.com</code>, <code>assets2.example.com</code>, <code>assets3.example.com</code> for example). As traffic grows, these hostnames could be moved to your own dedicated servers. Note: Avoid picking a hostname at random as this will affect browser caching and result in more traffic and may also create excessive DNS lookups which do carry a performance penalty.</p>\n<p>Likewise, any static JavaScript and CSS files can be offloaded to separate hostnames or servers.</p>\n<p>Under HTTP/2 and HTTP/3, &#8220;HTTP pipelining&#8221; is superseded by multiplexing, so the use of the above techniques may no longer be necessary.</p>\n<h4>Feeds</h4>\n<p>Your feeds can easily be offloaded to an external feed service that can handle all the feed traffic and only update the feed from your site every few minutes. This can be a big traffic saver.</p>\n<p>Likewise, you could offload your own feeds to a separate server (feeds.example.com for example) and then handle your own feed stats / advertising.</p>\n<h3>Compression</h3>\n<p>There are a number of ways to compress files and data on your server so that your pages are delivered more quickly to readers&#8217; browsers. Some <a href=\"https://wordpress.org/plugins/search/cache/\">cache plug-ins</a> described above integrate support for most of the common approaches to compression.</p>\n<p>Some WP cache plug-ins support Minify and Tidy to compress and combine your style sheets and JavaScript files. It also supports output compression such as <a href=\"https://zlib.net/\">zlib</a>, see also <a href=\"https://codex.wordpress.org/Output_Compression\">Output Compression</a>.</p>\n<p>It&#8217;s also important to compress your media files – namely images.</p>\n<h3>Database Tuning</h3>\n<h4>Cleaning Your Database</h4>\n<p>Some <a href=\"https://wordpress.org/plugins/search/optimization/\">optimization plug-ins</a> and <a href=\"https://wordpress.org/plugins/search/database/\">database plug-ins</a> can help you reduce extra clutter in your database.</p>\n<p>You can also instruct WordPress to <a href=\"https://wordpress.org/documentation/article/revisions/\">minimize the number of revisions</a> that it saves of your posts and pages.</p>\n<h3>Adding Servers</h3>\n<p>While it requires additional expertise, adding servers can be a powerful way to increase performance.</p>\n<p>You can use <a href=\"https://en.wikipedia.org/wiki/Load_balancing_(computing)\">load balancers</a> to spread traffic across multiple web servers, and you can use <a href=\"https://codex.wordpress.org/HyperDB\">HyperDB</a> or database service in the cloud to run more scalable or multiple database servers.</p>\n<p>There are various guides on the web, as well as WordCamp presentations, about scaling WordPress sites on cloud services.</p>\n<h3>Autoloaded Options</h3>\n<p>Autoloaded options are configuration settings for plugins and themes that are automatically loaded with every page load on WordPress. Each plugin and theme defines their own options and which options are autoloaded. Having too many autoloaded options can slow down your site. Generally, you should try to keep your site&#8217;s autoloaded options under 800kb.</p>\n<p>By default, autoloaded options are saved in the wp_options table. Autoload can be turned off on an option-by-option basis within this table. For step-by-step instructions on viewing and changing autoloaded options, check with your hosting provider.</p>\n<p>If you use a Persistent Object Cache, options (whether autoloaded or not) load faster and more efficiently.</p>\n<h2>Additional Resources</h2>\n<h3>Further Reading</h3>\n<ul>\n<li><a href=\"https://codex.wordpress.org/High_Traffic_Tips_For_WordPress\">High Traffic Tips for WordPress</a></li>\n</ul>\n<h3>WordCamp Performance Presentations</h3>\n<ul>\n<li><a href=\"https://wordpress.tv/2012/09/01/iliya-polihronov-high-performance-wordpress/\">High-Performance WordPress by Iliya Polihronov from WordCamp 2012 (San Francisco)</a></li>\n<li><a href=\"https://www.slideshare.net/AlmogBaku/wordpress-optimization-16678718\">WordPress Optimization from WordCamp Israel 2013</a></li>\n<li><a href=\"https://barry.blog/2007/07/22/high-performance-wordpress/\">Copy of the Slides on HyperDB and High Performance from WordCamp 2007 (San Francisco)</a>\n<ul>\n<li><a href=\"https://onemansblog.com/2007/08/16/wordcamp-2007-hyperdb-and-high-performance-wordpress/\">Presentation on HyperDB and High Performance from WordCamp 2007 (San Francisco)</a></li>\n</ul>\n</li>\n<li><a href=\"https://www.slideshare.net/AndreaCardinali/50-tips-su-web-performance-optimization-per-siti-ad-alto-traffico-wpcamp-bologna-2013\">50 tips su Web Performance Optimization per siti ad alto traffico WordCamp Bologna (Italy) 2013</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2023-05-03: Revised content to comply with <a href=\"https://make.wordpress.org/docs/handbook/documentation-team-handbook/external-linking-policy/\">External Linking Policy</a>.</li>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/optimization/\">Optimization</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145870,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145872",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145872",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145872/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 147627,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145872/revisions/147627"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145870"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145872"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}