{
    "id": 145859,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/multisite/sites-multisite/"
    },
    "modified": "2024-01-16T20:30:06",
    "modified_gmt": "2024-01-16T20:30:06",
    "slug": "sites-multisite",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/multisite/sites-multisite/",
    "title": {
        "rendered": "Migrate WordPress sites into WordPress Multisite"
    },
    "content": {
        "rendered": "<p>This tutorial explains how to migrate multiples WordPress installs to a WordPress multisite install. You can migrate sites that use their own domain names, as well as sites that use a subdomain on your primary domain.</p>\n<p>This tutorial assumes that you are hosting WordPress on a server using cPanel. If you are using another solution to manage your server, you&#8217;ll have to adapt these instructions.</p>\n<h2 id=\"steps-to-follow\">Steps to follow</h2>\n<h3 id=\"backup-your-site\">Backup your site</h3>\n<p>Generate a full site backup in cPanel. It might also help to copy all the files on the server via FTP, so that you can easily access the files for plugins and themes, which you&#8217;ll need in a later step.</p>\n<h3 id=\"export-from-your-existing-wordpress-installs\">Export from your existing WordPress installs</h3>\n<p>In each of your existing WordPress installations, go Tools &gt; Export in WordPress. Download the WXR files that contain all your posts and pages for each site. See the instructions on the <a href=\"https://wordpress.org/documentation/article/tools-export-screen/\">Tools Export Screen</a>.</p>\n<p>Make sure that your export file actually has all the posts and pages. You can verify this by looking at the last entry of the exported file using a text editor. The last entry should be the most recent post.</p>\n<p>Some plugins can conflict with the export process, generating an empty file, or a partially complete file. To be on the safe side, you should probably disable all plugins before doing the exports.</p>\n<p>It&#8217;s also a good idea to first delete all quarantined spam comments as these will also be exported, making the file unnecessarily large.</p>\n<p>Note: widget configuration and blog/plugin settings are NOT exported in this method. If you are migrating within a single hosting account, make note of those settings at this stage, because when you delete the old domain, they will disappear.</p>\n<h3 id=\"install-wordpress\">Install WordPress</h3>\n<p>Install WordPress. Follow the instructions for <a href=\"https://developer.wordpress.org/advanced-administration/before-install/howto-install/\">Installing WordPress</a>.</p>\n<h3 id=\"activate-multisite\">Activate multisite</h3>\n<p>Activate multi-site in your WordPress install. This involves editing wp-config.php a couple of times. You need to use the subdomain, not the subdirectory, option. See the instructions on how to <a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">Create A Network</a>.</p>\n<h3 id=\"create-blogs-for-each-site-you-want-to-import\">Create blogs for each site you want to import</h3>\n<p>Create blogs for each of the sites you want to host at separate domains. For example, <code>importedblogdotorg.mydomain.com</code>.</p>\n<p>Note: choose the name carefully, because changing it causes admin redirection issues. This is particularly important if you are migrating a site within the same hosting account.</p>\n<h3 id=\"import-wxr-files-for-each-blog\">Import WXR files for each blog</h3>\n<p>Go to the backend of each blog, and import the exported WXR file for each blog. Map the authors to the proper users, or create new ones. Be sure to check the box that will pull in photos and other attachments. See the instructions on Tools Import SubPanel.</p>\n<p>Note: if you choose to import images from the source site into the target site, make sure they have been uploaded into the right place and are displayed correctly in the respective post or page.</p>\n<h3 id=\"copy-theme-and-plugin-files\">Copy theme and plugin files</h3>\n<p>Before you start, check that your plugins will work in the network installation. If a plugin is not supported, do not install it. Find suitable alternatives for it by searching for the plugin&#8217;s function with &#8220;multisite&#8221; or even &#8220;mu&#8221;, as in &#8220;social bookmarking plugin wordpress multisite&#8221;.</p>\n<p>Copy the theme and plugin files from your old WP installs to their respective directories in the new wp-content. You can activate themes for the network, or you can go to Superadmin &gt; Sites, then click edit on the site you want, and enable a given theme for just that site.</p>\n<p>Note: if you are using a child theme, copy both parent and child themes to the new site.</p>\n<h3 id=\"edit-wordpress-configuration-settings-for-each-site\">Edit WordPress configuration settings for each site</h3>\n<p>Edit the configuration settings, widget, etc. for each site. By the end of this step, each site should look exactly as it did before, only with the URL subdomain.example.com or example.com/subsite rather than its correct, final URL.</p>\n<h2 id=\"potential-problems\">Potential problems</h2>\n<h3 id=\"limitations-of-php-configuration\">Limitations of PHP configuration</h3>\n<p>You may run into trouble with the PHP configuration on your host. There are two potential problems. One is that PHP&#8217;s <code>max_upload_size</code> will be too small for the WXR file. The other problem is that the PHP memory limit might be too small for importing all the posts.</p>\n<p>There are a couple ways to solve it. One is to ask your hosting provider to up the limits, even temporarily. The other is to put a php.ini file in your <code>/wp-admin/</code> and <code>/wp-includes</code> directories that ups the limits for you (php.ini files are not recursive, so it has to be in those directories). Something like a 10 MB upload limit and a 128 MB memory limit should work, but check with your hosting provider first so that you don&#8217;t violate the terms of your agreement.</p>\n<p>Search the <a href=\"https://wordpress.org/documentation/forums/\">WordPress forum support</a> for help with PHP configuration problems.</p>\n<h3 id=\"converting-add-on-domains-to-parked-domains\">Converting add-on domains to parked domains</h3>\n<p>Deleting add-on domains in cPanel and replacing them with parked domains will also delete any domain forwarders and e-mail forwarders associated with those domains. Be aware of this, so that you can restore those forwarders once you&#8217;ve made the switch.</p>\n<h3 id=\"limitations-of-importing-users\">Limitations of importing users</h3>\n<p>As there is the above way to import the content into an instance of the Multisite-blog, you are running into massive troubles, when it gets to import multiple users. Users are generated during the import, but you won&#8217;t get any roles or additional information into the new blog.</p>\n<h3 id=\"losing-settings\">Losing settings</h3>\n<p>If the old site is no longer available and you find you have forgotten to copy some setting or you want to make sure you have configured everything correctly, run a google search for your site and then click to view the cached version. This option is available only until your new site has been crawled, so you&#8217;d better be quick.</p>\n<p>Another option might be the <a href=\"https://archive.org/web/\">Internet Archive Wayback Machine</a>. They may have a copy of the site (or some part of it) archived.</p>\n<h2>Changelog</h2>\n<ul>\n<li>2023-01-20: Original content from <a href=\"https://wordpress.org/documentation/article/migrating-multiple-blogs-into-wordpress-multisite/\">Migrating multiple blogs into WordPress multisite</a></li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145853,
    "menu_order": 6,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145859",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145859",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 2,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145859/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 146039,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145859/revisions/146039"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145853"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145859"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}