{
    "id": 145820,
    "date": "2023-03-28T04:02:40",
    "date_gmt": "2023-03-28T04:02:40",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/before-install/howto-install/"
    },
    "modified": "2025-03-31T02:19:08",
    "modified_gmt": "2025-03-31T02:19:08",
    "slug": "howto-install",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/before-install/howto-install/",
    "title": {
        "rendered": "How to install WordPress"
    },
    "content": {
        "rendered": "<p>WordPress is well-known for its ease of installation. Under most circumstances, installing WordPress is a very simple process and takes less than five minutes to complete. <a href=\"#\">Many web hosts</a> now offer <a href=\"https://wordpress.org/documentation/article/automated-installation/\">tools (e.g. Fantastico) to automatically install WordPress</a> for you. However, if you wish to install WordPress yourself, the following guide will help.</p>\n<h2>Things to Know Before Installing WordPress</h2>\n<p>Before you begin the install, there are a few things you need to have and do. Refer the article <a href=\"https://developer.wordpress.org/advanced-administration/before-install/\">Before You Install</a>.<br />\nIf you need multiple WordPress instances, refer <a href=\"https://developer.wordpress.org/advanced-administration/before-install/multiple-instances/\">Installing Multiple WordPress Instances.</a></p>\n<h2>Basic Instructions</h2>\n<p>Here&#8217;s the quick version of the instructions for those who are already comfortable with performing such installations. More <a href=\"#detailed-instructions\">detailed instructions</a> follow.</p>\n<ol>\n<li>Download and unzip the WordPress package if you haven&#8217;t already.</li>\n<li>Create a database for WordPress on your web server, as well as a <a href=\"https://wordpress.org/documentation/article/glossary/#mysql\">MySQL</a> (or MariaDB) user who has all privileges for accessing and modifying it.</li>\n<li>(Optional) Find and rename <code>wp-config-sample.php</code> to <code>wp-config.php</code>, then edit the file <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">(see Editing wp-config.php)</a> and add your database information.<br />\n<strong>Note:</strong> If you are not comfortable with renaming files, step 3 is optional and you can skip it as the install program will create the <code>wp-config.php</code> file for you.</li>\n<li>Upload the WordPress files to the desired location on your web server:\n<ul>\n<li>If you want to integrate WordPress into the root of your domain (e.g. https://example.com/), move or upload all contents of the unzipped WordPress directory (excluding the WordPress directory itself) into the root directory of your web server.</li>\n<li>If you want to have your WordPress installation in its own subdirectory on your website (e.g. https://example.com/blog/), create the blog directory on your server and upload the contents of the unzipped WordPress package to the directory via FTP.</li>\n<li><strong>Note:</strong> If your FTP client has an option to convert file names to lower case, make sure it&#8217;s disabled.</li>\n</ul>\n</li>\n<li>Run the WordPress installation script by accessing the URL in a web browser. This should be the URL where you uploaded the WordPress files.</li>\n</ol>\n<p>&#8211; If you installed WordPress in the root directory, you should visit: https://example.com/<br />\n&#8211; If you installed WordPress in its own subdirectory called blog, for example, you should visit: https://example.com/blog/<br />\nThat&#8217;s it! WordPress should now be installed.</p>\n<h2 id=\"detailed-instructions\">Detailed instructions</h2>\n<h3>Step 1: Download and Extract</h3>\n<p>Download and unzip the WordPress package from <a href=\"https://wordpress.org/download/\">wordpress.org/download/</a>.</p>\n<ul>\n<li>If you will be uploading WordPress to a remote web server, download the WordPress package to your computer with a web browser and unzip the package.</li>\n<li>If you will be using FTP, skip to the next step – uploading files is covered later.</li>\n<li>If you have <a href=\"https://wordpress.org/documentation/article/glossary/#shell\">shell</a> access to your web server, and are comfortable using console-based tools, you may wish to download WordPress directly to your <a href=\"https://wordpress.org/documentation/article/glossary/#web-server\">web server</a> using wget (or lynx or another console-based web browser) if you want to avoid <a href=\"https://wordpress.org/documentation/article/glossary/#ftp\">FTPing</a>:\n<ul>\n<li>wget https://wordpress.org/latest.tar.gz</li>\n<li>Then extract the package using:</li>\n<li>tar -xzvf latest.tar.gz</li>\n</ul>\n<p>The WordPress package will extract into a folder called wordpress in the same directory that you downloaded latest.tar.gz.</p>\n</li>\n</ul>\n<h3 id=\"detailed-step-2\">Step 2: Create a database for WordPress</h3>\n<p>If you are using a <a href=\"https://wordpress.org/documentation/article/glossary/#hosting-provider\">hosting provider</a>, you may already have a WordPress database set up for you, or there may be an automated setup solution to do so. Check your hosting provider&#8217;s support pages or your control panel for clues about whether or not you&#8217;ll need to create one manually.</p>\n<p>If you determine that you&#8217;ll need to create one manually, follow the instructions for Using phpMyAdmin below to create your WordPress username and database. For other tools such as Plesk, cPanel and Using the MySQL Client, refer the article <a href=\"https://developer.wordpress.org/advanced-administration/before-install/creating-database/\">Creating Database for WordPress.</a></p>\n<p>If you have only one database and it is already in use, you can install WordPress in it – just make sure to have a distinctive prefix for your tables to avoid over-writing any existing database tables.</p>\n<h4>Using phpMyAdmin</h4>\n<p>If your web server has <a href=\"https://wordpress.org/documentation/article/glossary/#phpmyadmin\">phpMyAdmin</a> installed, you may follow these instructions to create your WordPress username and database. If you work on your own computer, on most Linux distributions you can install PhpMyAdmin automatically.</p>\n<p><em><strong>Note:</strong> These instructions are written for phpMyAdmin 4.4; the phpMyAdmin user interface can vary slightly between versions.</em></p>\n<ol>\n<li>If a database relating to WordPress does not already exist in the <strong>Database</strong> dropdown on the left, create one:\n<ol>\n<li>Choose a name for your WordPress database: &#8216;<code>wordpress</code>&#8216; or &#8216;<code>blog</code>&#8216; are good, but most hosting services (especially shared hosting) will require a name beginning with your username and an underscore, so, even if you work on your own computer, we advise that you check your hosting service requirements so that you can follow them on your own server and be able to transfer your database without modification. Enter the chosen database name in the <strong>Create database</strong> field and choose the best collation for your language and encoding. In most cases it&#8217;s better to choose in the &#8220;utf8_&#8221; series and, if you don&#8217;t find your language, to choose &#8220;utf8mb4_general_ci&#8221; <a href=\"https://make.wordpress.org/core/2015/04/02/the-utf8mb4-upgrade/\">(Refer this article about upgrading to utf8mb4)</a>.<br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/10/phpMyAdmin_create_database_4.4.jpg?ssl=1\" alt=\"Creating a database in phpMyAdmin 4.4\" /></li>\n<li>Click the <strong>phpMyAdmin</strong> icon in the upper left to return to the main page, then click the <strong>Users</strong> tab. If a user relating to WordPress does not already exist in the list of users, create one:<br />\n<img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/codex.wordpress.org/images/2/26/users.jpg?ssl=1\" alt=\"Create user in phpMyAdmin 4.4\" /></p>\n<ol>\n<li>Click <strong>Add user</strong>.</li>\n<li>Choose a username for WordPress (&#8216;<code>wordpress</code>&#8216; is good) and enter it in the <strong>User name</strong> field. (Be sure <strong>Use text field</strong>: is selected from the dropdown.)</li>\n<li>Choose a secure password (ideally containing a combination of upper- and lower-case letters, numbers, and symbols), and enter it in the <strong>Password</strong> field. (Be sure <strong>Use text field</strong>: is selected from the dropdown.) Re-enter the password in the <strong>Re-type</strong> field.</li>\n<li>Write down the username and password you chose.</li>\n<li>Leave all options under <strong>Global privileges</strong> at their defaults.</li>\n<li>Click <strong>Go</strong>.</li>\n<li>Return to the Users screen and click the <strong>Edit privileges</strong> icon on the user you&#8217;ve just created for WordPress.</li>\n<li>In the <strong>Database-specific privileges</strong> section, select the database you&#8217;ve just created for WordPress under the <strong>Add privileges to the following database</strong> dropdown, and click Go.</li>\n<li>The page will refresh with privileges for that database. Click <strong>Check All</strong> to select all privileges, and click <strong>Go</strong>.</li>\n<li>On the resulting page, make note of the host name listed after <strong>Server</strong>: at the top of the page. (This will usually be <strong>localhost</strong>.)</li>\n</ol>\n</li>\n</ol>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/10/phpMyAdmin_server_info_4.4.jpg?ssl=1\" alt=\"Make sure the server is localhost\" /></p>\n</li>\n</ol>\n<h3 id=\"detailed-step-3\">Step 3: Set up wp-config.php</h3>\n<p>You can either create and edit the wp-config.php file yourself, or you can skip this step and let WordPress try to do this itself when you run the installation script (step 5). (you&#8217;ll still need to tell WordPress your database information).</p>\n<p>(For more extensive details, and step by step instructions for creating the configuration file and your secret key for password security, please see <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">Editing wp-config.php</a>).</p>\n<p>Return to where you extracted the WordPress package in Step 1, rename the file wp-config-sample.php to wp-config.php, and open it in a text editor.</p>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/#configure-database-settings\">Enter your database information</a> under the section labeled</p>\n<pre><code> // ** MySQL settings - You can get this info from your web host ** //\n</code></pre>\n<p><strong>DB_NAME</strong><br />\n    The name of the database you created for WordPress in Step 2.<br />\n<strong>DB_USER</strong><br />\n    The username you created for WordPress in Step 2.<br />\n<strong>DB_PASSWORD</strong><br />\n    The password you chose for the WordPress username in Step 2.<br />\n<strong>DB_HOST</strong><br />\n    The hostname you determined in Step 2 (usually localhost, but not always; see <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/#set-database-host\">some possible DB_HOST values</a>). If a port, socket, or pipe is necessary, append a colon (:) and then the relevant information to the hostname.<br />\n<strong>DB_CHARSET</strong><br />\nThe database character set, normally should not be changed (see <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">Editing wp-config.php</a>).<br />\n<strong>DB_COLLATE</strong><br />\nThe database collation should normally be left blank (see <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">Editing wp-config.php</a>).</p>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/wordpress/wp-config/\">Enter your secret key values</a> under the section labeled</p>\n<pre><code>/* Authentication Unique Keys and Salts. */\n</code></pre>\n<p>Save the <code>wp-config.php</code> file.</p>\n<h3>Step 4: Upload the files</h3>\n<p>Now you will need to decide where on your domain you&#8217;d like your WordPress-powered site to appear:<br />\n&#8211; In the root directory of your website. (For example, https://example.com/)<br />\n&#8211; In a subdirectory of your website. (For example, https://example.com/blog/)</p>\n<p><em><strong>Note:</strong> The location of your root web directory in the filesystem on your <a href=\"https://wordpress.org/documentation/article/glossary/#web-server\">web server</a> will vary across <a href=\"https://wordpress.org/documentation/article/glossary/#hosting-provider\">hosting providers</a> and operating systems. Check with your hosting provider or system administrator if you do not know where this is.</em></p>\n<h4>In the Root Directory</h4>\n<ul>\n<li>If you need to upload your files to your web server, use an <a href=\"https://wordpress.org/documentation/article/glossary/#ftp\">FTP</a> client to upload all the contents of the wordpress directory (but not the directory itself) into the root directory of your website.<br />\nIf your files are already on your web server, and you are using <a href=\"https://wordpress.org/documentation/article/glossary/#shell\">shell</a> access to install WordPress, move all of the contents of the wordpress directory (but not the directory itself) into the root directory of your website.</li>\n</ul>\n<h4>In a Subdirectory</h4>\n<ul>\n<li>If you need to upload your files to your web server, rename the wordpress directory to your desired name, then use an <a href=\"https://wordpress.org/documentation/article/glossary/#ftp\">FTP</a> client to upload the directory to your desired location within the root directory of your website.</li>\n<li>If your files are already on your web server, and you are using <a href=\"https://wordpress.org/documentation/article/glossary/#shell\">shell</a> access to install WordPress, move the wordpress directory to your desired location within the root directory of your website, and rename the directory to your desired name.</li>\n</ul>\n<h3>Step 5: Run the Install Script</h3>\n<p>Point a web browser to start the installation script.</p>\n<ul>\n<li>If you placed the WordPress files in the root directory, you should visit: https://example.com/wp-admin/install.php</li>\n<li>If you placed the WordPress files in a subdirectory called blog, for example, you should visit: https://example.com/blog/wp-admin/install.php</li>\n</ul>\n<h4>Setup configuration file</h4>\n<p>If WordPress can&#8217;t find the wp-config.php file, it will tell you and offer to try to create and edit the file itself. (You can also do this directly by loading <code>wp-admin/setup-config.php</code> in your web browser.) WordPress will ask you the database details and write them to a new wp-config.php file. If this works, you can go ahead with the installation; otherwise, go back and <a href=\"https://developer.wordpress.org/advanced-administration/before-install/howto-install/#step-3-set-up-wp-config-php\">create, edit, and upload the wp-config.php file yourself (step 3).</a></p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/10/install-step3_v47.png?ssl=1\" alt=\"The WordPress setup screen\" /></p>\n<h4>Finishing installation</h4>\n<p>The following screenshots show how the installation progresses. Notice that in entering the details screen, you enter your site title, your desired user name, your choice of a password (twice), and your e-mail address. Also displayed is a check-box asking if you would like your blog to appear in search engines like Google and DuckDuckGo. Leave the box unchecked if you would like your blog to be visible to everyone, including search engines, and check the box if you want to block search engines, but allow normal visitors. Note all this information can be changed later in your <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration Screen</a>.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/10/install-step5_v47.png?ssl=1\" alt=\"The WordPress installation screen\" /></p>\n<p>If you successfully install the WordPress, login prompt will be displayed.</p>\n<p>Install script troubleshooting<br />\n&#8211; If you get an error about the database when you run the install script:<br />\n    &#8211; Go back to <a href=\"#detailed-step-2\">Step 2</a> and <a href=\"#detailed-step-3\">Step 3</a>, and make sure you entered all the correct database information into wp-config.php.<br />\n    &#8211; Make sure you granted your WordPress user permission to access your WordPress database in <strong>Step 3.</strong><br />\n    &#8211; Make sure the database server is running.</p>\n<h2 id=\"installing-wordpress-at-popular-hosting-companies\">Installing WordPress at popular Hosting Companies</h2>\n<h3>installing WordPress at Atlantic.net</h3>\n<p><a href=\"https://www.atlantic.net/vps-hosting/how-to-install-wordpress-ubuntu-14/\">Install WordPress On A Ubuntu 14.04 LTS</a><br />\nYou can also install WordPress on Ubuntu with <a href=\"https://www.atlantic.net/vps-hosting/wordpress-vps-hosting/\">one click WordPress Hosting</a> on Atlantic.Net.</p>\n<h3>Installing WordPress at AWS</h3>\n<ul>\n<li><a href=\"https://aws.amazon.com/marketplace/pp/prodview-duuvqpjnl65oe\">Installatron WordPress</a> Installatron WordPress is a pre-configured and ready-to-launch image that contains a WordPress website and Installatron&#8217;s WordPress management tools.</li>\n<li><a href=\"https://www.slideshare.net/harishganesan/scaling-wordpress-in-aws-amazon-ec2\">Architecting a Highly Scalable WordPress Site in AWS</a> A guide for building a more expensive, highly scalable AWS implementation using Amazon&#8217;s Relational Data Store (RDS) et al.</li>\n</ul>\n<h3>Installing WordPress at DigitalOcean</h3>\n<ul>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-wordpress-on-ubuntu-14-04\">How to install WordPress on Ubuntu 14.04</a></li>\n</ul>\n<h3>Installing WordPress at Linode</h3>\n<ul>\n<li><a href=\"https://www.linode.com/docs/websites/cms/manage-web-content-with-wordpress\">Manage Web Content with WordPress</a> Install WordPress on a Debian Server with a LAMP Stack</li>\n</ul>\n<p>You can also install WordPress on Ubuntu with one click using this <a href=\"https://www.linode.com/stackscripts/view/12\">StackScript</a> on Linode.</p>\n<h3>Installing WordPress at iPage Hosting</h3>\n<ul>\n<li><a href=\"https://istartblogging.com/#express-blog-install\">This is a great step by step tutorial by IStartBlogging</a> on how to setup your blog the smart way with iPage Hosting.</li>\n</ul>\n<p>In less than 5 minutes from now, you will have your blog ready on your domain. You will install WordPress on your own domain as an Automated Process with ONE Click WordPress Installation feature from iPage hosting.</p>\n<h3>Installing WordPress at Microsoft Azure</h3>\n<ul>\n<li><a href=\"https://azure.microsoft.com/en-us/marketplace/partners/wordpress/wordpress/\">Installing WordPress on Microsoft Azure</a> is as simple as a few clicks. A hosting space and MySQL database will be created and configured, so you&#8217;re ready to start creating within a matter of seconds.</li>\n<li>Running into some issues and need to troubleshoot your WordPress site on Azure? Follow this handy <a href=\"https://azure.microsoft.com/en-us/blog/wordpress-troubleshooting-techniques-on-azure-websites/\">Troubleshooting guide for WordPress on Azure</a></li>\n<li>There is a full listing of resources on how to <a href=\"https://azure.microsoft.com/en-us/documentation/articles/develop-wordpress-on-app-service-web-apps/\">learn more about WordPress on Microsoft Azure!</a></li>\n</ul>\n<h2>Common installation problems</h2>\n<p>The following are some of the most common installation problems. For more information and troubleshooting for problems with your WordPress installation, check out <a href=\"https://wordpress.org/documentation/article/faq-installation/\">FAQ Installation</a> and <a href=\"https://wordpress.org/documentation/article/faq-troubleshooting/\">FAQ Troubleshooting</a>.</p>\n<p><strong>I see a directory listing rather than a web page.</strong></p>\n<p>The web server needs to be told to view index.php by default. In Apache, use the DirectoryIndex index.php directive. The simplest option is to create a file named .htaccess in the installed directory and place the directive there. Another option is to add the directive to the web server&#8217;s configuration files.</p>\n<p><strong>I see lots of <code>Headers already sent</code> errors. How do I fix this?</strong></p>\n<p>You probably introduced a syntax error in editing wp-config.php.</p>\n<ol>\n<li>Download wp-config.php (if you don&#8217;t have <a href=\"https://wordpress.org/documentation/article/glossary/#shell\">shell</a> access).</li>\n<li>Open it in a <a href=\"https://wordpress.org/documentation/article/glossary/#text-editor\">text editor</a>.</li>\n<li>Check that the first line contains nothing but , and that there is no text after it (not even whitespace).</li>\n<li>If your text editor saves as Unicode, make sure it adds <strong>no byte order mark (BOM)</strong>. Most Unicode-enabled text editors do not inform the user whether or not it adds a BOM to files; if so, try using a different text editor.</li>\n<li>Save the file, upload it again if necessary, and reload the page in your browser.</li>\n</ol>\n<p><strong>My page comes out gibberish. When I look at the source I see a lot of &#8220;<code>&lt;?php ?&gt;</code>&#8221; tags.</strong></p>\n<p>If the <code>&lt;?php ?&gt;</code> tags are being sent to the browser, it means your <a href=\"https://wordpress.org/documentation/article/glossary/#php\">PHP</a> is not working properly. All PHP code is supposed to be executed before the server sends the resulting <a href=\"https://wordpress.org/documentation/article/glossary/#html\">HTML</a> to your web browser. (That&#8217;s why it&#8217;s called a preprocessor.) Make sure your web server meets the requirements to run WordPress, that PHP is installed and configured properly, or contact your hosting provider or system administrator for assistance.</p>\n<p><strong>I keep getting an <code>Error connecting to database</code> message but I&#8217;m sure my configuration is correct.</strong></p>\n<p>Try resetting your MySQL password manually. If you have access to MySQL via shell, try issuing:</p>\n<pre><code>SET PASSWORD FOR 'wordpressusername'@'hostname' = OLD_PASSWORD('password');\n</code></pre>\n<p>If you do not have shell access, you should be able to simply enter the above into an SQL query in phpMyAdmin. Failing that, you may need to use your host&#8217;s control panel to reset the password for your database user.</p>\n<p><strong>I keep getting an <code>Your PHP installation appears to be missing the MySQL extension which is required by WordPress</code> message but I&#8217;m sure my configuration is correct.</strong></p>\n<p>Check to make sure that your configuration of your web-server is correct and that the MySQL plugin is getting loaded correctly by your web-server program. Sometimes this issue requires everything in the path all the way from the web-server down to the MySQL installation to be checked and verified to be fully operational. Incorrect configuration files or settings are often the cause of this issue.</p>\n<p><strong>My image/MP3 uploads aren&#8217;t working.</strong></p>\n<p>If you use the Rich Text Editor on a blog that&#8217;s installed in a subdirectory, and drag a newly uploaded image into the editor field, the image may vanish a couple seconds later. This is due to a problem with TinyMCE (the rich text editor) not getting enough information during the drag operation to construct the path to the image or other file correctly. The solution is to NOT drag uploaded images into the editor. Instead, click and hold on the image and select <strong>Send to Editor.</strong></p>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-14: Added alt tags to all images.</li>\n<li>2022-09-14: cleared up a link refering to the <a href=\"https://make.wordpress.org/core/2015/04/02/the-utf8mb4-upgrade/\">utf8mb4 article</a></li>\n<li>2022-09-14: Original content from <a href=\"https://wordpress.org/documentation/article/how-to-install-wordpress/\">How to install WordPress</a></li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145818,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145820",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145820",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145820/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 157448,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145820/revisions/157448"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145818"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145820"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}