{
    "id": 145877,
    "date": "2023-03-28T04:02:43",
    "date_gmt": "2023-03-28T04:02:43",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/debug/test-driving/"
    },
    "modified": "2024-01-16T20:30:04",
    "modified_gmt": "2024-01-16T20:30:04",
    "slug": "test-driving",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/debug/test-driving/",
    "title": {
        "rendered": "Test Driving WordPress"
    },
    "content": {
        "rendered": "<p>There are times when you need to test changes to your WordPress powered site out of the public eye. Making changes to a live site could adversely affect your readers.</p>\n<p>You have several choices.</p>\n<h3>Creating a Sandbox</h3>\n<p>Do this for test driving your WordPress Theme and style sheet, allowing you to develop your <a href=\"https://wordpress.org/documentation/article/using-themes/\">WordPress Theme</a> on your computer. This limits you to only working on CSS and not using plugins and other power features of WordPress. This is best for just styling a page.</p>\n<h3>Hiding Your WordPress Test Area</h3>\n<p>You can also close off access to your WordPress test site on your website server. This involves some familiarity with .htaccess and Apache, but it allows you to continue working on the Internet while not exposing your test site to the public.</p>\n<h3>Install WordPress on Your Computer</h3>\n<p>If you are determined to put WordPress through its paces, you can install WordPress on your own computer with a few modifications. This allows you total control over the actions and capabilities of WordPress. You can still use plugins, template files, Themes, and redesign everything as if it were on the Internet without using bandwidth or suffering with slow Internet access times. We have two sets of explanation for this: Installing a New Installation on Your Computer and Installing an Existing WordPress Site. We also cover Moving WordPress Onto Your Website after you have finished developing your site on your computer.</p>\n<h2>Creating a Sandbox</h2>\n<p>A <strong>Sandbox</strong> is a term related to the sandbox you might have played in and built sand castles in as a child. It is a playground for working on concepts and exploring your imagination. A WordPress Sandbox is basically a copy of a generated page on a WordPress site that is saved to your hard drive for you to play with as you develop your final theme and look for your site.</p>\n<p>WordPress uses different <a href=\"https://codex.wordpress.org/Templates\">template files</a> to generate different views on your site. In general, there is the <strong>front page view</strong>, the <strong>single post view</strong>, and the <strong>multi-post view</strong>, used for categories, archives, and search. For more information on the structure of WordPress Themes, see <a href=\"https://developer.wordpress.org/advanced-administration/wordpress/site-architecture/\">Site Architecture 1.5</a>. As different page views use different CSS styles, at the least you need to put three page views in your sandbox following these instructions.</p>\n<ol>\n<li>Choose the WordPress Theme you want to work from in your Appearance screen of your Administration Screen.</li>\n<li>From your initial or test WordPress site, view one of the following page views:\n<ul>\n<li>Front Page</li>\n<li>Single Post</li>\n<li>Mult-Post Page</li>\n</ul>\n</li>\n<li>From your browser:\n<ul>\n<li>Choose File &gt; Save As.</li>\n<li>Name the saved page with one of the above “titles.”</li>\n<li>Save each page’s file to your sandbox folder.</li>\n</ul>\n</li>\n<li>From your Theme’s folder, copy the style.css style sheet file to your sandbox folder.</li>\n<li>Open each of the three files you have saved in a text editor and change the following:</li>\n</ol>\n<pre><code>&lt;style type=\"text/css\" media=\"screen\"&gt;\n@import url('/wp-content/themes/yourtheme/style.css');\n&lt;/style&gt;\n</code></pre>\n<pre><code>&lt;link rel=\"stylesheet\" type=\"text/css\" media=\"screen\" href=\"style.css\" /&gt;\n</code></pre>\n<p>Lastly, find all the image files and graphics associated with the style sheet, like background images, icons, bullets, or others, and copy them to your sandbox folder. Links to these items from within your style sheet should have no folders in their links, or link to a subfolder within your sandbox folder, such as:</p>\n<pre><code>header {\n  margin:5px;\n  padding:10px;\n  background:url(images/background.jpg)....\n}\n</code></pre>\n<p>To test this, double click on one of the pages in that folder to view it in your browser. If the the styles and graphics are visible, it worked. If not, check the link to your style sheet.</p>\n<p>Now, you have a sandbox to play in.</p>\n<p>To use your sandbox, have two programs open. One is your text editor with the style.css file and the other is your browser with the page you are working on in view. Make a change in your style sheet, save it, then do a <a href=\"https://wordpress.org/support/topic/i-make-changes-and-nothing-happens/\">total refresh</a> or your browser screen and look at what changes. Then repeat the process. When you are done with one page, go to the next page and check those changes and add more if necessary.</p>\n<h3>Sandbox Tips</h3>\n<p>Here are a few tips for playing in your sandbox.</p>\n<h3>Backup Frequently</h3>\n<p>As you work, copy the files in the folder before making major renovations to a backup folder. Or you can use a file compression utility like a zip program to save the entire folder. If the changes you make do not work, you have recent backups to work from.</p>\n<h3>Trace DIVS and CLASSES</h3>\n<p>Before you begin, go through the source code file of each of the three page views in your text editor and add a comment as to where each division begins and ends. These often cross lines between template files and can be difficult to trace. Make your life easier by documenting where these begin and end.</p>\n<h3>Make Notes</h3>\n<p>Before making a huge change, write down what you are changing. This way you have notes to refer to when things do not work later and you are trying to trace the history of the changes.</p>\n<h3>Make Notes Inside</h3>\n<p>When making significant changes to the style sheet or to the web page source code, add notes or comments to the code. This will also help you to keep track of the changes you’ve made.</p>\n<h3>Make Small Steps</h3>\n<p>Making a lot of changes at once makes it harder to find the small change that made things go out of whack. A good approach would be to take small steps and check, then make additional, small modifications and check again.</p>\n<h3>Avoid Changing the Template Files</h3>\n<p>Begin by staying with the site architecture and style references already in place. If you will be releasing your Theme to the public, modifications to the template files must be seriously reconsidered and done carefully. If you are rebuilding your site for your private use, then you can make those changes to your HTML saved pages source code, then move those changes into the template files later.</p>\n<h3>Moving Your Sandbox To Your Theme</h3>\n<p>When you have made all your changes and are satisfied with the results, it is time to move your sandbox back into your WordPress Theme.</p>\n<ol>\n<li>Upload the style.css style sheet file to your WordPress Theme folder on your site, replacing the old file.</li>\n<li>Upload all graphics and images to the Theme folder or subfolder.</li>\n<li>View your site in your browser. The changes should be immediate.</li>\n<li>If you made changes to the source code of any of the three pages, track those down to their specific template file and make the changes in those template files on your site.</li>\n</ol>\n<h3>Install another Blog</h3>\n<ol>\n<li>Install WordPress again, but in the wp-config.php file, use a different table-prefix.</li>\n<li>In Options &gt; Writing &gt; Update Services, clear the box.</li>\n<li>Tell no one where your blog is located.</li>\n</ol>\n<p>If you go to another site from your blog, then your site could be discovered because of the referer in the browser. To prevent this, go to your real blog, then to another site.</p>\n<p>This method is useful toward the end of testing as you can ask for people to test using other browsers / screen resolutions.</p>\n<h2>Hiding Your WordPress Test Area</h2>\n<p>To hide your WordPress test folder from others, you can use the <code>.htaccess</code> file on an Apache web server. The <code>.htaccess</code> file is a file that stores server directives, instructions which tell the server what to do in specific situations. You could also use the Apache config file (httpd.conf) or other methods, but the <code>.htaccess</code> file can apply only to the folder in which the .htaccess file resides, and all the folders under that one, allowing you to restrict access to a specific folder.</p>\n<p>Remember, this will only work on servers that support <code>.htaccess</code>. If you are unsure that your server supports <code>.htaccess</code>, contact your hosting provider. You may or may not be able to do this depending upon the access permissions you have with your host server. You may need their assistance. If you are running your own server, or if your hosting provider is clue-free, consult the <a href=\"https://httpd.apache.org/docs/2.0/mod/core.html#allowoverride\">AllowOverride documentation</a>.</p>\n<p>Using the <code>.htaccess</code> file, you need to provide instructions to tell the server to restrict or deny access to your WordPress test site. In the folder or directory in which WordPress is installed, do the following:</p>\n<ol>\n<li>Using a text editor create a blank text file called <code>.htaccess</code>.</li>\n<li>You need the following information:</li>\n<li>\n<ul>\n<li>The full path of a directory on your site server that is not accessible to the public (like https://example.com/public_html/ is accessible but https://example.com/private/ is not. Use the latter.</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>The name of the secured area such as “Enter Password” or “Secure Area” (this is not important, just simple).</li>\n</ul>\n</li>\n<li>In the file type the following, replacing /full/path/of/directory/ and Security Area with the above information: <code>AuthUserFile /full/path/of/directory/.htpasswd AuthName \"Security Area\" AuthType Basic require valid-user</code></li>\n<li>Save this .htaccess file and upload it to the directory on your server you want hidden and secured. This would be the installation directory for WordPress such as <code>/wordpress/</code> or <code>blog</code>.</li>\n<li>Using Telnet, cPanel, or another way to access your server’s command panel, go to the directory specified as <code>AuthUserFile</code>.</li>\n<li>Type the following command, where <code>user_name</code> is the user name for the <code>access:htpasswd -c .htpasswd user_name</code></li>\n<li>When prompted, enter the password, and confirm it.</li>\n<li>Write down your password and user name and keep it in a safe place.</li>\n</ol>\n<p>When you are ready to open your site to the public and remove the protection, delete the password and <code>.htaccess</code> files from their locations.</p>\n<p>It is highly recommended that you remove the default ping URL to <a href=\"https://pingomatic.com/\">Ping-o-Matic!</a>, otherwise your test posts will ping and your test blog will be made public though not accessible.</p>\n<h3>Htaccess Resources</h3>\n<ul>\n<li><a href=\"https://httpd.apache.org/docs/2.0/howto/htaccess.html\">.htaccess files howto</a></li>\n<li><a href=\"https://httpd.apache.org/docs/2.0/howto/auth.html\">Authentication, Authorization and Access Control</a></li>\n</ul>\n<h2>Installing WordPress on a Mac</h2>\n<p>Use these instruction for setting up a local server environment for testing and development on a Mac.</p>\n<ul>\n<li><a href=\"https://codex.wordpress.org/Installing_WordPress_Locally_on_Your_Mac_With_MAMP\">Installing_WordPress_Locally_on_Your_Mac_With_MAMP</a></li>\n</ul>\n<h2>Installing WordPress on Your Windows Desktop</h2>\n<p>In order for WordPress to work, it must have access to an Apache server, MySQL/MariaDB, and phpMyAdmin. Installing these separately can be painful. Luckily for us, <a href=\"https://www.apachefriends.org/download.html\">XAMPP</a> installs all of these with one program, allowing you to run WordPress on your computer. There are two versions of the program, Basic and Lite. The Lite version is usually adequate.</p>\n<ol>\n<li>Download and install <a href=\"https://www.apachefriends.org/download.html\">XAMPP</a>.</li>\n<li>This installs by default into <code>C:/xampplite</code> or <code>C:\\xampp</code>.</li>\n<li>Start XAMPP from <code>c:\\xampplite</code> or <code>c:\\xampp</code>.</li>\n<li>You may need to restart your computer to allow apache services to start.</li>\n<li>In your browser, go to http://localhost/xampp.</li>\n<li>In the left column under Tools, click <strong>phpMyAdmin</strong>.</li>\n<li>Login is admin.</li>\n<li>In <strong>Create new database</strong> enter <strong>wordpress</strong>.</li>\n<li>In the next box, select <strong>utf8 unicode ci</strong>.</li>\n<li>Click <strong>Create</strong> button.</li>\n<li>Unzip your WordPress download into the <code>htdocs</code> directory <code>– c:\\xampp\\htdocs\\</code>.</li>\n<li>From the folder, open <code>wp-config-sample.php</code> in a text editor.</li>\n<li>The connection details you need are as follows:</li>\n</ol>\n<pre><code>// ** MySQL settings ** //\ndefine('DB_NAME', 'wordpress'); // The name of the database\ndefine('DB_USER', 'root'); // Your MySQL username\ndefine('DB_PASSWORD', &apos;&apos;); // ...and password\ndefine('DB_HOST', 'localhost'); // 99% chance you won't need to change this\n</code></pre>\n<ol>\n<li>Save as <code>wp-config.php</code>.</li>\n<li>Install by going to http://localhost/wordpress/wp-admin/install.php</li>\n</ol>\n<p><strong>IMPORTANT:</strong> It is possible to use this to actually host your blog if you have a good enough connection. If you want to do this, you MUST increase the security level. This description is NOT SECURE if you allow web access to your blog.</p>\n<h2>Installing an Existing WordPress Site</h2>\n<p>With the help of XAMPP, you can install WordPress directly on your computer and play with it to your heart’s content. This way, it is totally isolated from public exposure and all your mistakes are hidden. When you are ready, you can then move it onto your website, ready for all to see.</p>\n<h3>Requirements</h3>\n<ol>\n<li>Access to your server database.</li>\n<li>Ability to download your entire WordPress installation to your computer.</li>\n<li><a href=\"https://www.apachefriends.org/download.html\">Basic XAMPP for Windows</a></li>\n<li>Enough room on your hard drive to accommodate your database, WordPress installation, and XAMPP.</li>\n</ol>\n<h3>Backup WordPress</h3>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/user-images.githubusercontent.com/6118303/189545243-6ac55696-9f98-41fe-ab06-061c505f5ab2.png?ssl=1\" alt=\"phpMyAdmin MySQL Databases\" /></p>\n<p>Begin by backing up your WordPress site completely, the files and the database. This will ensure that you have a good copy to fall back on, just in case.</p>\n<p>A second backup is then required of your database, but it requires you do a little housekeeping.</p>\n<p>As the WordPress database normally stands, there are statistics tables which contain a huge amount of data which add to the overall size of the database, and slow down the process of backing up and downloading this backup copy of your database. You do not have to clear these, but it is generally considered a good idea.</p>\n<ol>\n<li>Login to PHPMyAdmin on your website server.</li>\n<li>From the main login screen, select <strong>Databases</strong>.</li>\n<li>Choose the name of your WordPress database.</li>\n<li>From the tags at the top of the screen, choose <strong>Export</strong>.</li>\n<li>In the frame at the top of the <a href=\"https://wordpress.org/documentation/files/2018/11/phpmyadmin-export-tab.jpg\">Export section</a> you will see a list of tables in your database.</li>\n<li>You will need to choose only those tables that correspond to your WordPress install. They will be the ones with the <code>table_prefix</code> found in your <code>wp-config.php</code> file. If you only have WordPress installed, then choose <strong>Select All</strong> from the left column.</li>\n<li>Make sure the SQL button is selected.</li>\n<li>On the right side of the panel, make sure the following boxes are checked.</li>\n</ol>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/user-images.githubusercontent.com/6118303/189546285-35103e54-cba6-42ee-86ea-8ea480bf1630.png?ssl=1\" alt=\"phpMyAdmin export screen\" /></p>\n<ul>\n<li>Structure</li>\n<li>Add AUTO_INCREMENT value</li>\n<li>Enclose table and field names with backquotes</li>\n<li>Data Tick the Save as file option, and leave the template name alone. </li>\n<li>For Compression, select <strong>None</strong>. Click <strong>Go</strong>. </li>\n<li>You should be prompted for a file to download. Save the file to your computer. Depending on the database size, this may take a few moments.</li>\n</ul>\n<h3>Download WordPress</h3>\n<p>Now, download your entire WordPress site to your computer. This is usually done with an <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/ftp/\">FTP client program</a>. Make sure you include all core WordPress files within your root or WordPress directory, including the <code>index.php</code>.</p>\n<p>You should now have in your computer two items:</p>\n<ol>\n<li>One or more database backups.</li>\n<li>All your WordPress files, folders, and images directories.</li>\n</ol>\n<p>Copy the backup files again to somewhere safe on your machine so you work on a copy of the backup for the next stage.</p>\n<h3>Install Basic XAMPP</h3>\n<ol>\n<li>Install XAMPP. By default, it will install to <code>C:\\xampp</code>.</li>\n<li>Go to <code>C:\\xampp\\apache\\conf</code> and open the file called <code>httpd.conf</code> in a <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#Text%20editor\">text editor</a>.</li>\n<li>About line 166 you will find: <code>#LoadModule rewrite_module modules/mod_rewrite.so</code>.</li>\n<li>Remove the # and save the file (this switches <code>mod_rewrite</code> on).</li>\n<li>Create a folder inside <code>C:\\xampp\\htdocs</code>. This will be for WordPress.</li>\n<li>Copy all your downloaded WordPress files (not the sql backup) into that directory.</li>\n<li>With a text editor, open the file <code>wp-config.php</code> on your WordPress install.</li>\n<li>Change the details for your new MySQL connection:</li>\n</ol>\n<pre><code>// ** MySQL settings ** //\ndefine('DB_NAME', 'wordpress'); // The name of the new database you made\ndefine('DB_USER', 'root'); // keep this as is\ndefine('DB_PASSWORD', &apos;&apos;); // keep this empty\ndefine('DB_HOST', 'localhost'); // 99% chance you won't need to change this\n</code></pre>\n<ol>\n<li>Your main <code>index.php</code> should be in the <code>/htdocs</code> folder or in a subdirectory such as <code>/htdocs/wordpress/</code>. Write that down.</li>\n<li>Start XAMPP by clicking the orange <code>xampp_start.exe</code> or using the console program from <code>Program Files \\ApacheFriends\\XAMPP\\XAMPP Control Panel</code>.</li>\n<li>Once it is working, click on link in the left side bar for phpMyAdmin.</li>\n<li>Create a database. The name should match the one used in your <code>wp-config.php</code> file.</li>\n</ol>\n<h3>Importing Your SQL Backup File</h3>\n<p>Before you begin to import your SQL backup file, you need to change some information inside your <code>.SQL</code> file.</p>\n<ol>\n<li>Using your text editor, open the <code>.sql</code> backup database file you downloaded.</li>\n<li>Find and replace all the instances of your old URL with your new URL. For instance if your blog address is at https://example.com/wordpress/, and your files on your computer are at <code>/htdocs/wordpress/</code>, replace it with http://127.0.0.1/wordpress/.</li>\n<li>Click <strong>Save – Do not use Save as</strong>.</li>\n</ol>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/user-images.githubusercontent.com/6118303/189546617-26a843c4-e793-4c44-b2a6-13a32b366a8e.png?ssl=1\" alt=\"phpMyAdmin SQL tab\" /></p>\n<p>Now it is time to import your sql file. From within the phpMyAdmin on your computer, click on <strong>your database name</strong>, then choose the <strong>SQL</strong> tab. From this screen, click <strong>Browse</strong> and find your backup files on your computer. Click <strong>Go</strong>. This can take a few minutes to import.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/user-images.githubusercontent.com/6118303/189546659-7e3cefe1-1744-4458-ac49-98fbd04626c5.png?ssl=1\" alt=\"Success message\" /></p>\n<p>Once the procedure is complete, your database will be restored and will work just as it did before. If something goes wrong with this last part of the process, it could be that either your backup was corrupted in some way, or something went wrong with the database itself. <strong>Keep your backup files safe!</strong></p>\n<p>If everything so far has gone well, it is now time to visit your blog! In your browser, type in http://127.0.0.1/wordpress/index.php or the actual name of the folder you created for your WordPress files.</p>\n<p>If you get a 404, check you have the right place. You do not need to put htdocs or xampp or anything else after the http://127.0.0.1/ except use your directory name.</p>\n<p>WordPress should now function just as it did on the web. You do not need to use the built-in editor in WordPress to alter your files. Just open the files directly in a text editor and edit them as you would any other file. Refreshing your browser’s web page will then show the effects.</p>\n<h3>Moving Your Test WordPress Site to Your Website</h3>\n<p>Coming soon – how to move your test site from your computer back live onto your host server site.</p>\n<h3>Resources</h3>\n<ul>\n<li><a href=\"https://qsandbox.com/app/\">qSandbox.com – Create a free WordPress test site to try (new) plugins and themes</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/test-driving-wordpress/\">Test driving WordPress</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145873,
    "menu_order": 4,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145877",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145877",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145877/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151561,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145877/revisions/151561"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145873"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145877"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}