{
    "id": 145819,
    "date": "2023-03-28T04:02:40",
    "date_gmt": "2023-03-28T04:02:40",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/before-install/creating-database/"
    },
    "modified": "2024-01-16T20:30:10",
    "modified_gmt": "2024-01-16T20:30:10",
    "slug": "creating-database",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/before-install/creating-database/",
    "title": {
        "rendered": "Creating Database for WordPress"
    },
    "content": {
        "rendered": "<p>If you are installing WordPress on your own web server, follow the one of below instructions to create your WordPress database and user account.</p>\n<h2>Using phpMyAdmin</h2>\n<p>If your web server has <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#phpMyAdmin\">phpMyAdmin</a> installed, you may follow these instructions to create your WordPress username and database. If you work on your own computer, on most Linux distributions you can install PhpMyAdmin automatically.</p>\n<p><em><strong>Note:</strong> These instructions are written for phpMyAdmin 4.4; the phpMyAdmin user interface can vary slightly between versions.</em></p>\n<p>If a database relating to WordPress does not already exist in the <strong>Database</strong> dropdown on the left, create one:</p>\n<p>Choose a name for your WordPress database: &#8216;wordpress&#8217; or &#8216;blog&#8217; are good, but most hosting services (especially shared hosting) will require a name beginning with your username and an underscore, so, even if you work on your own computer, we advise that you check your hosting service requirements so that you can follow them on your own server and be able to transfer your database without modification. Enter the chosen database name in the <strong>Create database</strong> field and choose the best collation for your language and encoding. In most cases it&#8217;s better to choose in the “utf8_” series and, if you don&#8217;t find your language, to choose “utf8mb4_general_ci” (Reference: <a href=\"https://make.wordpress.org/core/2015/04/02/the-utf8mb4-upgrade/\">&#091;1&#093;</a>).</p>\n<p><a href=\"https://i1.wp.com/wordpress.org/support/files/2018/11/phpMyAdmin_create_database_4.4.jpg?fit=688%2C411&amp;ssl=1\"><img decoding=\"async\" src=\"https://i1.wp.com/wordpress.org/support/files/2018/11/phpMyAdmin_create_database_4.4.jpg?fit=688%2C411&amp;ssl=1\" alt=\"phpMyAdmin language encoding dropdown with utf8mb4_general_ci selected\" /></a></p>\n<p>phpMyAdmin language encoding drop down</p>\n<p>Click the <strong>phpMyAdmin</strong> icon in the upper left to return to the main page, then click the <strong>Users</strong> tab. If a user relating to WordPress does not already exist in the list of users, create one:</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2018/11/users-768x500.jpg?ssl=1\"><img data-recalc-dims=\"1\" height=\"500\" width=\"768\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/11/users-768x500.jpg?resize=768%2C500&#038;ssl=1\" alt=\"phpMyAdmin Users Tab selected\" /></a></p>\n<p>phpMyAdmin Users Tab</p>\n<ol>\n<li>Click <strong>Add user</strong>.</li>\n<li>Choose a username for WordPress (&#8216;wordpress&#8217; is good) and enter it in the <strong>User name</strong> field. (Be sure <strong>Use text field:</strong> is selected from the dropdown.)</li>\n<li>Choose a secure password (ideally containing a combination of upper- and lower-case letters, numbers, and symbols), and enter it in the <strong>Password</strong> field. (Be sure <strong>Use text field:</strong> is selected from the dropdown.) Re-enter the password in the <strong>Re-type</strong>field.</li>\n<li>Write down the username and password you chose.</li>\n<li>Leave all options under <strong>Global privileges</strong> at their defaults.</li>\n<li>Click <strong>Go</strong>.</li>\n<li>Return to the <strong>Users</strong> screen and click the <strong>Edit privileges</strong> icon on the user you&#8217;ve just created for WordPress.</li>\n<li>In the <strong>Database-specific privileges</strong> section, select the database you&#8217;ve just created for WordPress under the <strong>Add privileges to the following database</strong> dropdown, and click <strong>Go</strong>.</li>\n<li>The page will refresh with privileges for that database. Click <strong>Check All</strong> to select all privileges, and click <strong>Go</strong>.</li>\n<li>On the resulting page, make note of the host name listed after <strong>Server:</strong> at the top of the page. (This will usually be <strong>localhost</strong>.)</li>\n</ol>\n<p><a href=\"https://i1.wp.com/wordpress.org/support/files/2018/11/phpMyAdmin_server_info_4.4.jpg?fit=682%2C107&amp;ssl=1\"><img decoding=\"async\" src=\"https://i1.wp.com/wordpress.org/support/files/2018/11/phpMyAdmin_server_info_4.4.jpg?fit=682%2C107&amp;ssl=1\" alt=\"Databaser Server selected showing 'localhost'\" /></a></p>\n<h2>Using the MySQL Client</h2>\n<p>You can create MySQL users and databases quickly and easily by running mysql from the shell. The syntax is shown below and the dollar sign is the command prompt:</p>\n<pre><code>$ mysql -u adminusername -p  \nEnter password:  \nWelcome to the MySQL monitor. Commands end with ; or \\\\g.  \nYour MySQL connection id is 5340 to server version: 3.23.54  \n\nType 'help;' or '\\\\h' for help. Type '\\\\c' to clear the buffer.  \n\nmysql&gt; CREATE DATABASE databasename;  \nQuery OK, 1 row affected (0.00 sec)\n\nmysql&gt; CREATE USER \"wordpressusername\"@\"hostname\" IDENTIFIED BY \"password\";\nmysql&gt; GRANT ALL PRIVILEGES ON databasename.* TO \"wordpressusername\"@\"hostname\";\nQuery OK, 0 rows affected (0.00 sec)\n\nmysql&gt; FLUSH PRIVILEGES;  \nQuery OK, 0 rows affected (0.01 sec)   \n\nmysql&gt; EXIT  \nBye  \n</code></pre>\n<p>The example shows:</p>\n<ul>\n<li>That root is also the <em>adminusername</em>. It is a safer practice to choose a so-called “mortal” account as your mysql admin, so that you are not entering the command “mysql” as the root user on your system. (Any time you can avoid doing work as root you decrease your chance of being exploited.) The name you use depends on the name you assigned as the database administrator using mysqladmin.</li>\n<li>wordpress or blog are good values for <em>databasename</em>.</li>\n<li>wordpress is a good value for <em>wordpressusername</em> but you should realize that, since it is used here, the entire world will know it, too.</li>\n<li><em>hostname</em> will usually be localhost. If you don&#8217;t know what this value should be, check with your system administrator if you are not the admin for your WordPress host. If you are the system admin, consider using a non-root account to administer your database.</li>\n<li><em>password</em> should be a difficult-to-guess password, ideally containing a combination of upper- and lower-case letters, numbers, and symbols. One good way of avoiding the use of a word found in a dictionary is to use the first letter of each word in a phrase that you find easy to remember.</li>\n</ul>\n<p>If you need to write these values somewhere, avoid writing them in the system that contains the things protected by them. You need to remember the value used for <em>databasename</em>, <em>wordpressusername</em>, <em>hostname</em>, and <em>password</em>. Of course, since they are already (or will be shortly) in your wp-config.php file, there is no need to put them somewhere else, too.</p>\n<h2>Using Plesk</h2>\n<p>If your hosting provider supplies the <a href=\"https://www.plesk.com/\">Plesk</a> hosting control panel and you want to install WordPress manually, follow the instructions below to create a database:</p>\n<ol>\n<li>Log in to Plesk.</li>\n<li>Click <strong>Databases</strong> in the Custom Website area of your website on the Websites &amp; Domains page:  </li>\n</ol>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2018/11/plesk-db-768x558.png?ssl=1\"><img data-recalc-dims=\"1\" height=\"558\" width=\"768\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2018/11/plesk-db-768x558.png?resize=768%2C558&#038;ssl=1\" alt=\"Plesk panel highlighting the Custom Website box with the databases button highlighted\" /></a></p>\n<p>Plesk custom website databases</p>\n<ol>\n<li>Click <strong>Add New Database</strong>, change database name if you want, create database user by providing credentials and click <strong>OK</strong>. You&#8217;re done!</li>\n</ol>\n<h2>Using cPanel</h2>\n<p>If your hosting provider supplies the <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#cPanel\">cPanel</a> hosting control panel, you may follow these simple instructions to create your WordPress username and database. A more complete set of instructions for using cPanel to create the database and user can be found in <a href=\"https://wordpress.org/documentation/article/using-cpanel/\">Using cPanel</a>.</p>\n<ol>\n<li>Log in to your <a href=\"https://wordpress.org/documentation/article/wordpress-glossary/#cPanel\">cPanel</a>.</li>\n<li>Click <strong>MySQL Database Wizard</strong> icon under the Databases section.</li>\n<li>In <strong>Step 1. Create a Database</strong> enter the database name and click Next Step.</li>\n<li>In <strong>Step 2. Create Database Users</strong> enter the database user name and the password. Make sure to use a strong password. Click Create User.</li>\n<li>In <strong>Step 3. Add User to Database</strong> click the All Privileges checkbox and click Next Step.</li>\n<li>In <strong>Step 4. Complete the task</strong> note the database name and user. Write down the values of <em>hostname</em>, <em>username</em>, <em>databasename</em>, and the password you chose. (Note that <em>hostname</em> will usually be <strong>localhost</strong>.)</li>\n</ol>\n<h2>Using DirectAdmin</h2>\n<p>If you&#8217;re a regular User of a single-site webhosting account, you can log in normally. Then click <strong>MySQL Management</strong>. (If this is not readily visible, perhaps your host needs to modify your “package” to activate MySQL.) Then follow part “c” below.</p>\n<p>Reseller accounts Admin accounts may need to click <strong>User Level</strong>. They must first log in as Reseller if the relevant domain is a Reseller&#8217;s primary domain… or log in as a User if the domain is not a Reseller&#8217;s primary domain. If it&#8217;s the Reseller&#8217;s primary domain, then when logged in as Reseller, simply click <strong>User Level</strong>. However if the relevant domain is not the Reseller&#8217;s primary domain, then you must log in as a User. Then click <strong>MySQL Management</strong>. (If not readily visible, perhaps you need to return to the Reseller or Admin level, and modify the “Manage user package” or “Manage Reseller package” to enable MySQL.)</p>\n<p>In MySQL Management, click on the small words: <strong>Create new database</strong>. Here you are asked to submit two suffixes for the database and its username. For maximum security, use two different sets of 4-6 random characters. Then the password field has a Random button that generates an 8-character password. You may also add more characters to the password for maximum security. Click <strong>Create</strong>. The next screen will summarize the database, username, password and hostname. Be sure to copy and paste these into a text file for future reference.</p>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/creating-database-for-wordpress/\">Creating Database for WordPress</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145818,
    "menu_order": 1,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145819",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145819",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145819/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151590,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145819/revisions/151590"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145818"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145819"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}