{
    "id": 145843,
    "date": "2023-03-28T04:02:41",
    "date_gmt": "2023-03-28T04:02:41",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/wordpress/multilingual/"
    },
    "modified": "2024-11-25T13:34:07",
    "modified_gmt": "2024-11-25T13:34:07",
    "slug": "multilingual",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/wordpress/multilingual/",
    "title": {
        "rendered": "Multilingual WordPress"
    },
    "content": {
        "rendered": "<p>WordPress currently does not support a bilingual or multilingual blog out-of-the-box. However, plugins developed by the WordPress community make it easy to create a multilingual blog. The fourth and final phase of the WordPress Gutenberg project will add core implementation for multilingual sites as listed in the <a href=\"https://wordpress.org/about/roadmap/\">WordPress roadmap</a>.</p>\n<p>Creating a multilingual blog is basically installing WordPress in more than one language and letting the Plugin switch between them. This includes installing .mo languages files which most Plugins will require you to do manually. For more details, see <a href=\"https://developer.wordpress.org/advanced-administration/before-install/in-your-language/\">Installing WordPress in Your Language</a>.</p>\n<h2 id=\"different-types-of-multilingual-plugins\">Different types of multilingual plugins</h2>\n<p>There are a few basic types of multilingual Plugins:</p>\n<ol>\n<li>Manage multilingual posts in one post per language. Translations are then linked together, indicating that one post is the translation of another.</li>\n<li>Store all languages alternatives for each post in the same post.</li>\n<li>Manage translations on the generated page instead of using a post context.</li>\n<li>Link together separate WordPress sites in a network (multisite) installations for each language by pinging back and forth.</li>\n</ol>\n<h3 id=\"one-language-per-post\">One language per post</h3>\n<p>Multilingual plugins that assign a single language per post will let the user select the post’s language and add translations as new posts (same for pages, tag and categories).</p>\n<p>Then, different versions of the same content are linked together to form translation groups. This grouping allows users to switch the display language.</p>\n<p>Pros:</p>\n<ol>\n<li>The database contents for posts remain unmodified (easy install and uninstall).</li>\n<li>Everything gets translated by default. If a post includes custom fields, they’re attached to that post, so they are already associated with the language.</li>\n<li>Some plugins use – for theme’s displayed terms – the language files (.mo) delivered with localizable themes. In WordPress, localization is based in <a href=\"https://make.wordpress.org/polyglots/handbook/#Localization_Technology\">GNU gettext</a> technology. So when a single post is in french, plugin switch all the terms of the theme in the same language (here french). The files can be completed with the specific terms of the site (categories titles, widget, links…). No need to re-translate all, just add specific terms and translations in target languages.</li>\n<li>Other plugins that analyze contents (like related posts) keep working correctly.</li>\n</ol>\n<p>Cons:</p>\n<ol>\n<li>More complex architecture. The plugin needs to hook to many WordPress functions and filter them so that only contents that matches the language is returned.</li>\n<li>Additional tables are required by some plugins – normally, to hold the translation grouping. Newer plugins likely use a custom taxonomy or post meta fields instead.</li>\n<li>May cause excessive database grow and slow performance as a result. A WooCommerce-based site having a 100,000 products will have 500,000 records after translating to 5 languages. All product metas (could be tens of those per product, and also transients will be duplicated, too, so the database might become huge).</li>\n</ol>\n<h3 id=\"all-languages-in-a-single-post\">All languages in a single post</h3>\n<p>Multilingual plugins that hold all the language contents in the same post use language meta tags to distinguish between contents in different languages. When the post is displayed, it’s first processed and only the active language content remains.</p>\n<p>Pros:</p>\n<ol>\n<li>Side by side editing is easily implemented.</li>\n<li>Less things to break. There are no additional tables and much fewer things to modify in WordPress.</li>\n<li>The search will find the same post, regardless on which language you used for the keyword.</li>\n<li>Number of records in the database stays the same.</li>\n</ol>\n<p>Cons:</p>\n<ol>\n<li>Uninstall can be complicated, as the database needs to be cleaned from multilingual contents.</li>\n<li>Post permalinks may not be translatable.</li>\n</ol>\n<h3 id=\"manage-translations-on-the-generated-page\">Manage translations on the generated page</h3>\n<p>Multilingual plugins that use the content pages generated by WordPress and perform translation on those pages. When any page is displayed on WordPress the plugin (either offline or online) attempts to create a translated version of the page using machine translation. Later on that translation can be manually changed or modified.</p>\n<p>Pros:</p>\n<ol>\n<li>Installation is simple and translation for any content on the page is provided.</li>\n<li>Editing the translation can be done with ease.</li>\n</ol>\n<p>Cons:</p>\n<ol>\n<li>Automatic translation is not good enough and pages on the site might be badly translated.</li>\n<li>There’s a strong coupling between content and translation, and changes in the original content might break the translation.</li>\n</ol>\n<h3 id=\"plugins-that-direct-you-to-external-translation-services\">Plugins that direct you to external translation services</h3>\n<p>Those Multilingual plugins are normally used to create a widget that creates a shortcut for using online translation services (such as Google Translate). The content is auto translated on demand by the third party engine.</p>\n<p>Pros:</p>\n<ol>\n<li>Installation is simple and translation for any content on the page is provided.</li>\n<li>It is quite clear that the translation process is automated, so the users expectations are lowered.</li>\n</ol>\n<p>Cons:</p>\n<ol>\n<li>Automatic translation is not good enough and pages on the site might be badly translated.</li>\n<li>Without the ability to change the translation those plugins limit the ability of the content publisher to provide quality translated content.</li>\n</ol>\n<h3 id=\"each-language-in-its-own-wordpress-installation\">Each language in its own WordPress installation</h3>\n<p>A separate site is created for each language you want to translate into (e.g. in a <a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">WordPress Multisite</a> installation). All the sites need to run the same theme and plugin. When a translation is saved source posts get pinged by translation posts and the system keeps a separate table with the translation relationships.</p>\n<p>Pros:</p>\n<ol>\n<li>Each language site is a regular WordPress install with regular posts (postmeta and external db is used for translation data)</li>\n<li>If you turn off the plugin the content continues to work fine, albeit without knowledge of its sources/translations.</li>\n</ol>\n<p>Cons:</p>\n<ol>\n<li>Separate sites create more management needs which might be undesirable.</li>\n</ol>\n<h2 id=\"language-negotiation\">Language negotiation</h2>\n<p>Language negotiation means how to determine the language in which users see the site.</p>\n<p>Regardless of the solution for storing multilingual contents, multilingual plugins also need to be able to choose which language to display in.</p>\n<p>Normally, the URL indicates the display language. Different URL strategies for encoding language information are:</p>\n<ul>\n<li>Add the language name as a parameter: example.com/?lang=en or example.com/?lang=es</li>\n<li>Add virtual ‘directories’ as language names: example.com/en/ or example.com/es/</li>\n<li>Use different domains for different languages: www.example.com or es.example.com</li>\n</ul>\n<h2 id=\"how-to-choose-the-right-multilingual-solution\">How to choose the right multilingual solution</h2>\n<p>Choosing the most suitable multilingual Plugin for your needs will take some time. See the <a href=\"https://wordpress.org/plugins/search/multilingual\">WordPress Plugin Directory</a> for a list of multilingual Plugins.</p>\n<p>There is not only one way but a way adapted to the content strategy, the data-model, the number of posts and pages, and the behavior/experience expected by visitors. And for WordPress Network (multisite), a good knowledge of server administration is required.</p>\n<p>In any case, installing a multilingual plugin is a big change for any site. It would be a good idea to first create a test site and verify that everything works correctly between all the required plugins and the theme and only then install.</p>\n<p>Since many multilingual plugins change the database significantly, doing a <a href=\"https://developer.wordpress.org/advanced-administration/security/backup/database/\">database backup</a> is required before experimenting.</p>\n<h2 id=\"related\">Related</h2>\n<ul>\n<li><a href=\"https://developer.wordpress.org/advanced-administration/before-install/in-your-language/\">WordPress in Your Language</a></li>\n</ul>\n<h2>Changelog</h2>\n<ul>\n<li>2023-09-14: Removed links to individual plugins</li>\n<li>2022-10-25: Original content from <a href=\"https://wordpress.org/documentation/article/multilingual-wordpress/\">Multilingual WordPress</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145835,
    "menu_order": 9,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145843",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145843",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145843/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155838,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145843/revisions/155838"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145835"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145843"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}