{
    "id": 145827,
    "date": "2023-03-28T04:02:41",
    "date_gmt": "2023-03-28T04:02:41",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/server/file-permissions/"
    },
    "modified": "2024-01-16T20:30:09",
    "modified_gmt": "2024-01-16T20:30:09",
    "slug": "file-permissions",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/server/file-permissions/",
    "title": {
        "rendered": "Changing File Permissions"
    },
    "content": {
        "rendered": "<p>On computer file systems, different files and directories have <strong>permissions</strong> that specify who and what can read, write, modify and access them. This is important because WordPress may need access to write to files in your <code>wp-content</code> directory to enable certain functions.</p>\n<h2>Short explanation</h2>\n<p>Linux <a href=\"https://en.wikipedia.org/wiki/File_system_permissions\">file permissions</a> consist primarily of three components &#8212; the permissions the owner of the file or folder has, the permissions members of the group that owns the file or folder have, and the permissions that anyone else has for accessing or modifying the file and folder. The three permission components are usually represented using three numbers in order of the owner&#8217;s permission level, the group&#8217;s permission level, and everyone&#8217;s permission level. <em>There is technically a fourth component, but that is beyond what we need to know to secure WordPress. It will not be discussed here.</em></p>\n<p>There are three kinds of access each for the user, the group, and everyone else. They are read access, write access, and execute access. Read access lets you read the contents of the file or the directory. Write access lets you modify the file or the directory. And execute access lets you run the file like a program or a script.</p>\n<h2>Permission Modes</h2>\n<pre><code> 7      5      5\nuser   group  world\nr+w+x  r+x    r+x\n4+2+1  4+0+1  4+0+1  = 755\n</code></pre>\n<p>The permission mode is computed by adding up the following values for the user, the file group, and for everyone else. The diagram shows how.</p>\n<ul>\n<li><strong>R</strong>ead 4 – Allowed to read files</li>\n<li><strong>W</strong>rite 2 – Allowed to write/modify files</li>\n<li>e<strong>X</strong>ecute1 – Read/write/delete/modify/directory</li>\n</ul>\n<pre><code> 7      4      4\nuser   group  world\nr+w+x  r      r\n4+2+1  4+0+0  4+0+0  = 744\n</code></pre>\n<h3>Example Permission Modes</h3>\n<table>\n<thead>\n<tr>\n<th>Mode</th>\n<th>Str Perms</th>\n<th>Explanation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>0677</strong></td>\n<td>-rw-rwxrwx</td>\n<td>owner has rw only(6), other and group has rwx (7)</td>\n</tr>\n<tr>\n<td><strong>0670</strong></td>\n<td>-rw-rwx—</td>\n<td>owner has rw only, group has rwx, others have no permission</td>\n</tr>\n<tr>\n<td><strong>0666</strong></td>\n<td>-rw-rw-rw-</td>\n<td>all have rw only (6)</td>\n</tr>\n<tr>\n<td><strong>0607</strong></td>\n<td>-rw—-rwx</td>\n<td>owner has rw only, group has no permission and others have rwx</td>\n</tr>\n<tr>\n<td><strong>0600</strong></td>\n<td>-rw——-</td>\n<td>owner has rw only, group and others have no permission</td>\n</tr>\n<tr>\n<td><strong>0477</strong></td>\n<td>-r–rwxrwx</td>\n<td>owner has read only (4), other and group has rwx (7)</td>\n</tr>\n<tr>\n<td><strong>0470</strong></td>\n<td>-r–rwx—</td>\n<td>owner has read only, group has rwx, others have no permission</td>\n</tr>\n<tr>\n<td><strong>0407</strong></td>\n<td>-r—–rwx</td>\n<td>owner has read only, other has rwx, group has no permission</td>\n</tr>\n<tr>\n<td><strong>0444</strong></td>\n<td>-r–r–r–</td>\n<td>all have read only (4)</td>\n</tr>\n<tr>\n<td><strong>0400</strong></td>\n<td>-r——–</td>\n<td>owner has read only(4), group and others have no permission(0)</td>\n</tr>\n</tbody>\n</table>\n<h2>Permission Scheme for WordPress</h2>\n<p>Permissions will be different from host to host, so this guide only details general principles. It cannot cover all cases. This guide applies to servers running a standard setup (note, for shared hosting using &#8220;suexec&#8221; methods, see below).</p>\n<p>Typically, all files should be owned by your user (ftp) account on your web server, and should be writable by that account. On shared hosts, files should never be owned by the webserver process itself (sometimes this is <strong>www</strong>, or <strong>apache</strong>, or <strong>nobody</strong> user).</p>\n<p>Any file that needs write access from WordPress should be owned or group-owned by the user account used by WordPress (which may be different than the server account). For example, you may have a user account that lets you FTP files back and forth to your server, but your server itself may run using a separate user, in a separate usergroup, such as <strong>dhapache</strong> or <strong>nobody</strong>. If WordPress is running as the FTP account, that account needs to have write access, i.e., be the owner of the files, or belong to a group that has write access. In the latter case, that would mean permissions are set more permissively than default (for example, 775 rather than 755 for folders, and 664 instead of 644).</p>\n<p>The file and folder permissions of WordPress should be the same for most users, depending on the type of installation you performed and the umask settings of your system environment at the time of install.</p>\n<p><strong>NOTE:</strong> If an experienced user installed WordPress for you, you likely do not need to modify file permissions. Unless you are experiencing problems with permission errors, or you <em>want to</em>, you probably should not mess with this.</p>\n<p><strong>NOTE:</strong> If you installed WordPress yourself, you likely DO need to modify file permissions. Some files and directories should be &#8220;hardened&#8221; with stricter permissions, specifically, the wp-config.php file. This file is initially created with 644 permissions, and it&#8217;s a hazard to leave it like that. See Security and Hardening.</p>\n<p>Typically, all core WordPress files should be writable only by your user account (or the httpd account, if different). (Sometimes though, multiple ftp accounts are used to manage an install, and if all ftp users are known and trusted, i.e., not a shared host, then assigning group writable may be appropriate. Ask your server admin for more info.) However, if you utilize mod_rewrite Permalinks or other <code>.htaccess</code> features you should make sure that WordPress can also write to your <code>/.htaccess</code> file.</p>\n<p>If you want to use the built-in theme editor, all files need to be group writable. Try using it before modifying file permissions, it should work. (This may be true if different users uploaded the WordPress package and the Plugin or Theme. This wouldn&#8217;t be a problem for Plugin and Themes installed via the admin. When uploading files with different ftp users group writable is needed. On shared hosting, make sure the group is exclusive to users you trust&#8230; the apache user shouldn&#8217;t be in the group and shouldn&#8217;t own files.)</p>\n<p>Some plugins require the <code>/wp-content/</code> folder be made writeable, but in such cases they will let you know during installation. In some cases, this may require assigning 755 permissions. The same is true for <code>/wp-content/cache/</code> and maybe <code>/wp-content/uploads/</code> (if you&#8217;re using <a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">MultiSite</a> you may also need to do this for <code>/wp-content/blogs.dir/</code>)</p>\n<p>Additional directories under /wp-content/ should be documented by whatever plugin / theme requires them. Permissions will vary.</p>\n<pre><code>|\n|- index.php\n|- wp-admin\n|   |- wp-admin.css\n|- wp-blog-header.php\n|- wp-comments-post.php\n|- wp-commentsrss2.php\n|- wp-config.php\n|- wp-content\n|   |- cache\n|   |- plugins\n|   |- themes\n|   |- uploads\n|- wp-cron.php\n|- wp-includes\n|- xmlrpc.php\n</code></pre>\n<h3>Shared Hosting with suexec</h3>\n<p>The above may not apply to shared hosting systems that use the &#8220;suexec&#8221; approach for running PHP binaries. This is a popular approach used by many web hosts. For these systems, the php process runs as the owner of the php files themselves, allowing for a simpler configuration and a more secure environment for the specific case of shared hosting.</p>\n<p>Note: suexec methods should NEVER be used on a single-site server configuration, they are more secure <strong>only</strong> for the specific case of shared hosting.</p>\n<p>In such an suexec configuration, the correct permissions scheme is simple to understand.</p>\n<ul>\n<li>All files should be owned by the actual user&#8217;s account, not the user account used for the httpd process.</li>\n<li>Group ownership is irrelevant, unless there&#8217;s specific group requirements for the web-server process permissions checking. This is not usually the case.</li>\n<li>All directories should be 755 or 750.</li>\n<li>All files should be 644 or 640. Exception: wp-config.php should be 440 or 400 to prevent other users on the server from reading it.</li>\n<li>No directories should ever be given 777, even upload directories. Since the php process is running as the owner of the files, it gets the owners permissions and can write to even a 755 directory.</li>\n</ul>\n<p>In this specific type setup, WordPress will detect that it can directly create files with the proper ownership, and so it will not ask for FTP credentials when upgrading or installing plugins.</p>\n<p>Popular methods used by sysadmins for this setup are:</p>\n<ul>\n<li><a href=\"https://smarsching.github.io/suphp/Home.html\">suPHP</a>, runs through php-cgi, currently unmaintained since 2013.</li>\n<li><a href=\"https://github.com/mind04/mod-ruid2\">mod_ruid2</a>, apache module, currently unmaintained since 2013.</li>\n<li><a href=\"http://mpm-itk.sesse.net/\">mpm-itk</a>, apache module.</li>\n<li><a href=\"https://httpd.apache.org/mod_fcgid/\">mod_fcgid</a>, an Apache module and FastCGI server with more extensive configuration.</li>\n<li><a href=\"https://php-fpm.org/\">PHP-FPM</a>, an alternative FastCGI server with shared OPCode, for use with Apache and Nginx.</li>\n</ul>\n<h2>Using an FTP Client</h2>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/upgrade/ftp/\">FTP programs</a> (&#8220;clients&#8221;) allow you to set permissions for files and directories on your remote host. This function is often called <code>chmod</code> or <code>set permissions</code> in the program menu.</p>\n<p>In <a href=\"https://developer.wordpress.org/advanced-administration/before-install/howto-install/\">WordPress install</a>, two files that you will probably want to alter are the index page, and the css which controls the layout. Here&#8217;s how you change index.php – <em>the process is the same for any file</em>.</p>\n<p>In the screenshot below, look at the last column – that shows the permissions. It looks a bit confusing, but for now just note the sequence of letters.</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_12.gif?ssl=1\"><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_12.gif?ssl=1\" alt=\"\" /></a><br />\nInitial permissions</p>\n<p>Right-click &#8216;index.php&#8217; and select &#8216;File Permissions&#8217;<br />\nA popup screen will appear.</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_13.gif?ssl=1\"><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_13.gif?ssl=1\" alt=\"\" /></a><br />\nAltering file permissions</p>\n<p>Don&#8217;t worry about the check boxes. Just delete the &#8216;Numeric value:&#8217; and enter the number you need – in this case it&#8217;s 666. Then click OK.</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_14.gif?ssl=1\"><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/documentation/files/2019/02/podz_filezilla_14.gif?ssl=1\" alt=\"\" /></a><br />\nPermissions have been altered.</p>\n<p>You can now see that the file permissions have been changed.</p>\n<h3>Unhide the hidden files</h3>\n<p>By default, most <a href=\"https://developer.wordpress.org/advanced-administration/upgrade/ftp/\">FTP Clients</a>, including <a href=\"https://sourceforge.net/projects/filezilla/\">FileZilla</a>, keep hidden files, those files beginning with a period (.), from being displayed. But, at some point, you may need to see your hidden files so that you can change the permissions on that file. For example, you may need to make your <a href=\"https://wordpress.org/documentation/article/glossary#htaccess\">.htaccess</a> file, the file that controls <a href=\"https://wordpress.org/documentation/article/using-permalinks/\">permalinks</a>, writeable.</p>\n<p>To display hidden files in FileZilla, in it is necessary to select &#8216;View&#8217; from the top menu, then select &#8216;Show hidden files&#8217;. The screen display of files will refresh and any previously hidden file should come into view.</p>\n<p>To get FileZilla to always show hidden files – under Edit, Settings, Remote File List, check the Always show hidden files box.</p>\n<p>In the latest version of Filezilla, the &#8216;Show hidden files&#8217; option was moved to the &#8216;Server&#8217; tab. Select &#8216;Force show hidden files.&#8217;</p>\n<h2>Using the Command Line</h2>\n<p>If you have shell/SSH access to your hosting account, you can use <code>chmod</code> to change file permissions, which is the preferred method for experienced users. Before you start using <code>chmod</code> it would be recommended to read some tutorials to make sure you understand what you can achieve with it. Setting incorrect permissions can take your site offline, so please take your time.</p>\n<ul>\n<li><a href=\"https://web.archive.org/web/20190715230319/http://www.washington.edu/computing/unix/permissions.html\">Unix Permissions</a></li>\n</ul>\n<p>You can make <strong>all</strong> the files in your <code>wp-content</code> directory writable in two steps, but before making every single file and folder writable you should first try safer alternatives like modifying just the directory. Try each of these commands first and if they don&#8217;t work then go recursive, which will make even your themes image files writable. Replace <strong>DIR</strong> with the folder you want to write in</p>\n<pre><code>chmod -v 746 DIR\nchmod -v 747 DIR\nchmod -v 756 DIR\nchmod -v 757 DIR\nchmod -v 764 DIR\nchmod -v 765 DIR\nchmod -v 766 DIR\nchmod -v 767 DIR\n</code></pre>\n<p>If those fail to allow you to write, try them all again in order, except this time replace -v with -R, which will recursively change each file located in the folder. If after that you still can&#8217;t write, you may now try 777.</p>\n<h3><a href=\"#about-chmod\">About Chmod</a></h3>\n<p><code>chmod</code> is a unix command that means &#8220;<strong>ch</strong>ange <strong>mod</strong>e&#8221; on a file. The <code>-R</code> flag means to apply the change to every file and directory inside of <code>wp-content</code>. 766 is the mode we are changing the directory to, it means that the directory is readable and writable by WordPress and any and all other users on your system. Finally, we have the name of the directory we are going to modify, <code>wp-content</code>. If 766 doesn&#8217;t work, you can try 777, which makes all files and folders readable, writable, and executable by all users, groups, and processes.</p>\n<p>If you use <a href=\"https://wordpress.org/documentation/article/using-permalinks/\">Permalinks</a> you should also change permissions of .htaccess to make sure that WordPress can update it when you change settings such as adding a new page, redirect, category, etc.. which requires updating the .htaccess file when mod_rewrite Permalinks are being used.</p>\n<ol>\n<li>Go to the main directory of WordPress</li>\n<li>Enter <code>chmod -v 666 .htaccess</code></li>\n</ol>\n<p><strong>NOTE:</strong> From a security standpoint, even a small amount of protection is preferable to a world-writeable directory. Start with low permissive settings like 744, working your way up until it works. Only use 777 if necessary, and hopefully only for a temporary amount of time.</p>\n<h2>The dangers of 777</h2>\n<p>The crux of this permission issue is how your server is configured. The username you use to FTP or SSH into your server is most likely not the username used by the server application itself to serve pages.</p>\n<pre><code> 7      7      7\nuser   group  world\nr+w+x  r+w+x  r+w+x\n4+2+1  4+2+1  4+2+1  = 777\n</code></pre>\n<p>Often the Apache server is &#8216;owned&#8217; by the <strong>www-data</strong>, <strong>dhapache</strong> or <strong>nobody</strong> user accounts. These accounts have a limited amount of access to files on the server, for a very good reason. By setting your personal files and folders owned by your user account to be World-Writable, you are literally making them World Writable. Now the www-data, dhapache and nobody users that run your server, serving pages, executing php interpreters, etc. will have full access to your user account files.</p>\n<p>This provides an avenue for someone to gain access to your files by hijacking basically any process on your server, this also includes any other users on your machine. So you should think carefully about modifying permissions on your machine. I&#8217;ve never come across anything that needed more than 767, so when you see 777 ask why it&#8217;s necessary.</p>\n<h3>The Worst Outcome</h3>\n<p>The worst that can happen as a result of using 777 permissions on a folder or even a file, is that if a malicious cracker or entity is able to upload a devious file or modify a current file to execute code, they will have complete control over your blog, including having your database information and password.</p>\n<h3>Find a Workaround</h3>\n<p>It is usually pretty easy to have the enhanced features provided by the impressive WordPress plugins available, without having to put yourself at risk. Contact the Plugin author or your server support and request a workaround.</p>\n<h2>Finding Secure File Permissions</h2>\n<p>The .htaccess file is one of the files that is accessed by the owner of the process running the server. So if you set the permissions too low, then your server won&#8217;t be able to access the file and will cause an error. Therein lies the method to find the most secure settings. Start too restrictive and increase the permissions until it works.</p>\n<h3>Example Permission Settings</h3>\n<p>The following example has a <em>custom compiled php-cgi binary</em> and a <em>custom php.ini</em> file located in the cgi-bin directory for executing php scripts. To prevent the interpreter and <code>php.ini</code> file from being accessed directly in a web browser they are protected with a .htaccess file.</p>\n<p>Default Permissions (umask 022)</p>\n<pre><code>644 -rw-r--r--  /home/user/wp-config.php\n644 -rw-r--r--  /home/user/cgi-bin/.htaccess\n644 -rw-r--r--  /home/user/cgi-bin/php.ini\n755 -rwxr-xr-x  /home/user/cgi-bin/php.cgi\n755 -rwxr-xr-x  /home/user/cgi-bin/php5.cgi\n</code></pre>\n<p>Secured Permissions</p>\n<pre><code>600 -rw-------  /home/user/wp-config.php\n6**0**4 -rw----r--  /home/user/cgi-bin/.htaccess\n6**00** -rw-------  /home/user/cgi-bin/php.ini\n7**11** -rwx--x--x  /home/user/cgi-bin/php.cgi\n**100** ---x------  /home/user/cgi-bin/php5.cgi\n</code></pre>\n<h4>.htaccess permissions</h4>\n<p><strong>644 &gt; 604</strong> – The bit allowing the group owner of the .htaccess file read permission was removed. 644 is normally required and recommended for .htaccess files.</p>\n<h4>php.ini permissions</h4>\n<p><strong>644 &gt; 600</strong> – Previously all groups and all users with access to the server could access the php.ini, even by just requesting it from the site. The tricky thing is that because the php.ini file is only used by the php.cgi, we only needed to make sure the php.cgi process had access. The php.cgi runs as the same user that owns both files, so that single user is now the only user able to access this file.</p>\n<h4>php.cgi permissions</h4>\n<p><strong>755 &gt; 711</strong> This file is a compiled php-cgi binary used instead of mod_php or the default vanilla php provided by the hosting company. The default permissions for this file are 755.</p>\n<h4>php5.cgi permissions</h4>\n<p><strong>755 &gt; 100</strong> – Because of the setup where the user account is the owner of the process running the php cgi, no other user or group needs access, so we disable all access except execution access. This is interesting because it really works. You can try reading the file, writing to the file, etc. but the only access you have to this file is to run php scripts. And as the owner of the file you can always change the permission modes back again.</p>\n<pre><code>$ cat: php5.cgi: Permission denied\n./php5.cgi:  Welcome\n</code></pre>\n<h2>SELinux</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/Security-Enhanced_Linux\">Security Enhanced linux</a> is a kernel security module that provides mechanisms by which processes can be sandboxed into particular contexts. This is of particular use to limit the actions that web pages can perform on other parts of the operating system. Actions that are denied by the security policy are often hard to distinguish from regular file permission errors.</p>\n<p>selinux is typically installed on Redhat family distributions (e.g., CentOS, Fedora, Scientific, Amazon and others).</p>\n<h3>How to determine if selinux is the problem?</h3>\n<p>If you are on a debian based distribution, you are probably fine.</p>\n<p>Run the following command (on rpm based systems);</p>\n<pre><code>$ rpm -qa | grep selinux\nselinux-policy-targeted-3.13.1-166.el7_4.7.noarch\nselinux-policy-3.13.1-166.el7_4.7.noarch\nlibselinux-2.5-11.el7.x86_64\nlibselinux-python-2.5-11.el7.x86_64\nlibselinux-utils-2.5-11.el7.x86_64\n</code></pre>\n<p>and to check whether it is the cause of denials of permissions:</p>\n<pre><code>$ getenforce\nEnforcing\n</code></pre>\n<p>One issue that selinux causes is blocking the wp-admin tools from writing out the &#096;.htaccess&#096; file that is required for url rewriting. There are several commands for inspecting this behaviour</p>\n<pre><code>$ audit2allow -w -a\ntype=AVC msg=audit(1517275570.388:55362): avc:  denied  { write } for  pid=11831 comm=\"httpd\" path=\"/var/www/example.org/.htaccess\" dev=\"vda1\" ino=67137959 scontext=system_u:system_r:httpd_t:s0 tcontext=system_u:object_r:httpd_sys_content_t:s0 tclass=file\n        Was caused by:\n        The boolean httpd_unified was set incorrectly.\n        Description:\n        Allow httpd to unified\n\n        Allow access by executing:\n        # setsebool -P httpd_unified 1\n</code></pre>\n<p>and</p>\n<pre><code>$ ausearch -m avc -c httpd\n----\ntime-&gt;Tue Jan 30 01:30:31 2018\ntype=PROCTITLE msg=audit(1517275831.762:55364): proctitle=2F7573722F7362696E2F6874747064002D44464F524547524F554E44\ntype=SYSCALL msg=audit(1517275831.762:55364): arch=c000003e syscall=21 success=no exit=-13 a0=55b9c795d268 a1=2 a2=0 a3=1 items=0 ppid=11826 pid=11829 auid=4294967295 uid=48 gid=48 euid=48 suid=48 fsuid=48 egid=48 sgid=48 fsgid=48 tty=(none) ses=4294967295 comm=\"httpd\" exe=\"/usr/sbin/httpd\" subj=system_u:system_r:httpd_t:s0 key=(null)\ntype=AVC msg=audit(1517275831.762:55364): avc:  denied  { write } for  pid=11829 comm=\"httpd\" name=\"bioactivator.org\" dev=\"vda1\" ino=67137958 scontext=system_u:system_r:httpd_t:s0 tcontext=unconfined_u:object_r:httpd_sys_content_t:s0 tclass=dir\n----\n</code></pre>\n<p>You can temporarily disable selinux to determine if it is the cause of the problems;</p>\n<pre><code>$ setenforce\nusage:  setenforce \\[ Enforcing | Permissive | 1 | 0 \\]\n</code></pre>\n<h2>Changelog</h2>\n<ul>\n<li>2022-09-11: Original content from <a href=\"https://wordpress.org/documentation/article/changing-file-permissions/\">Changing File Permissions</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145826,
    "menu_order": 1,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145827",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145827",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 6,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145827/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151958,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145827/revisions/151958"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145826"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145827"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}