{
    "id": 145854,
    "date": "2023-03-28T04:02:42",
    "date_gmt": "2023-03-28T04:02:42",
    "guid": {
        "rendered": "https://developer.wordpress.org/advanced-administration/multisite/prepare-network/"
    },
    "modified": "2024-09-18T14:09:44",
    "modified_gmt": "2024-09-18T14:09:44",
    "slug": "prepare-network",
    "status": "publish",
    "type": "adv-admin-handbook",
    "link": "https://developer.wordpress.org/advanced-administration/multisite/prepare-network/",
    "title": {
        "rendered": "Before You Create A Network"
    },
    "content": {
        "rendered": "<p>This section outlines some requirements to consider before you begin <a href=\"https://developer.wordpress.org/advanced-administration/multisite/create-network/\">creating a multisite network</a>.</p>\n<h2 id=\"do-you-really-need-a-network\">Do you really need a network?</h2>\n<p>The sites in a multisite network are separate, very much like the separate blogs at WordPress.com. They are not <em>interconnected</em> like things in other kinds of networks (even though plugins can create various kinds of interconnections between the sites). If you plan on creating sites that are strongly interconnected, that share data, or share users, then a multisite network might not be the best solution.</p>\n<p>For example, if all you want is for different collections of web pages to look very different, then you can probably achieve what you want in a single site by using a plugin to switch themes, templates, or stylesheets.</p>\n<p>For another example, if all you want is for different groups of users to have access to different information, then you can probably achieve what you want in a single site by using a plugin to switch capabilities, menus, and link URLs.</p>\n<p>This guide describes how to install manually WordPress Multisite in your current WordPress installation.</p>\n<h2 id=\"types-of-multisite-network\">Types of multisite network</h2>\n<p>You can choose between several different types of multisite network depending on how you want your network to handle URLs, and on whether it will allow end users to create new sites on demand.</p>\n<p>Different types of network have different server requirements, which are described in a section below. If you do not have full control over your server then certain types of multisite network might not be available to you. For example, you might not have full control over your server because you use a shared hosting environment. In that case you will have to negotiate the requirements with whoever operates the hosting environment.</p>\n<p>The sites in a network have different URLs. You can choose one of two ways for the URL to specify the site:</p>\n<ul>\n<li>Each site has a different <em>subdomain</em>. For example: <code>site1.example.com</code>, <code>site2.example.com</code>.</li>\n<li>Each site has a different <em>path</em>. For example: <code>example.com/site1</code>, <code>example.com/site2</code></li>\n</ul>\n<p>Additionally, you can map domains like <code>example1.com</code>, <code>example2.com</code>, etc, however a plugin is suggested. You can make the changes directly in the network settings, but it&#8217;s considered advanced administration.</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/support/files/2018/11/sites-edit-site_4.7.png?fit=612%2C235&amp;ssl=1\"><img decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/support/files/2018/11/sites-edit-site_4.7.png?fit=612%2C235&amp;ssl=1\" alt=\"Administration managing sites screen\" /></a></p>\n<p>Administration managing sites</p>\n<p>You can also choose whether or not to allow end users to create new sites on demand. Domain-based on-demand sites are normally only possible using subdomains like <code>site1.example.com</code> and <code>site2.example.com</code>. Path-based on-demand sites are also possible.</p>\n<p>The multisite installation process uses different terminology. A <em>sub-domain install</em> creates a domain-based network, even though you might use separate mapped domains, and not subdomains, for your sites. A <em>sub-directory install</em> creates a path-based network, even though it does not use file system directories. If you want to use a <em>sub-domain</em> install, you must install WordPress in the root of your webpath (i.e. domain.com) however it does <em>not</em> need to be installed in the root (i.e. /public_html/) if you choose to run WordPress from its own directory.</p>\n<p>After the multisite network installation is complete, WordPress uses the terminology <em>domain</em> and <em>path</em> for each site&#8217;s domain and path in the Network Admin user interface. A super admin (that is, a multisite network administrator) can edit sites&#8217; domain and path settings, although it is unusual to do this to established sites because it changes their URLs.</p>\n<p>Plugins can extend the options available and help with administration. Search <a href=\"https://wordpress.org/plugins/\">Plugin Directory</a> by &#8216;multisite&#8217; or click <a href=\"https://wordpress.org/plugins/search/multisite/\">this link</a>.</p>\n<h2 id=\"admin-requirements\">Admin Requirements</h2>\n<p>To create a multisite network you must be the administrator of a WordPress installation, and you normally need access to the server&#8217;s file system so that you can edit files and create a directory. For example, you could access the server&#8217;s file system using <a href=\"https://wordpress.org/documentation/article/glossary#ftp\">FTP</a>, or using the File Manager in <a href=\"https://wordpress.org/documentation/article/glossary#cpanel\">cPanel</a>, or in some other way.</p>\n<p>You do not necessarily need any knowledge of WordPress <a href=\"https://wordpress.org/documentation/article/glossary#developer\">development</a>, <a href=\"https://wordpress.org/documentation/article/glossary#php\">PHP</a>, <a href=\"https://wordpress.org/documentation/article/glossary#html\">HTML</a>, <a href=\"https://wordpress.org/documentation/article/glossary#css\">CSS</a>, server administration or system administration, although knowledge of these things might be useful for troubleshooting or for customizing your multisite network after installation.</p>\n<h2 id=\"server-requirements\">Server Requirements</h2>\n<p>When you are planning a network, it can sometimes be helpful to use a development server for initial testing. However, setting up a development server that exactly matches your production server is not always possible, and transferring an entire network to a production server may not be easy. A test site on your production server is sometimes a more useful way to test your planned network.</p>\n<p>In all cases, you will need to make sure your server can use the more complex .htaccess (or nginx.conf or web.config) rules that Multisite requires.</p>\n<p>Multisite requires <a href=\"https://wordpress.org/documentation/article/glossary#mod-rewrite\">mod_rewrite</a> to be loaded on the Apache server, support for it in <a href=\"https://wordpress.org/documentation/article/glossary#htaccess\">.htaccess</a> files, and Options FollowSymLinks either already enabled or at least not permanently disabled. If you have access to the server configuration, then you could use a Directory section instead of a .htaccess file. Also make sure that your httpd.conf file is set for &#8220;AllowOverride&#8221; to be &#8220;All&#8221; or &#8220;Options All&#8221; for the vhost of the domain. You can ask your webhost for more information on any of this.</p>\n<p>Some server requirements depend on the type of multisite network you want to create, as follows.</p>\n<h3 id=\"domain-based\">Domain-based</h3>\n<p>Also known as &#8216;Subdomain&#8217; installs, a Domain-based network uses URLs like https://subsite.example.com</p>\n<p>A domain-based network maps different domain names to the same directory in the server&#8217;s file system where WordPress is installed. You can do this in various ways, for example:</p>\n<ul>\n<li>by configuring wildcard subdomains</li>\n<li>by configuring virtual hosts, specifying the same document root for each</li>\n<li>by creating addon domains or subdomains in <a href=\"https://wordpress.org/documentation/article/glossary#cpanel\">cPanel</a> or in a similar web hosting control panel</li>\n</ul>\n<p>On-demand domain-based sites require the wildcard subdomains method. You can create additional sites manually in the same network using other methods.</p>\n<p>Whichever methods you use, you will need to configure your DNS (to map the domain name to the server&#8217;s IP address) and server (to map the domain name to the WordPress installation directory). WordPress will then map the domain name to the site.</p>\n<p>WordPress <em>should</em> be run from the root of your webfolder (i.e. <code>public_html</code>) for subdomains to work correctly. Making subdomains work from a non-root directory requires experience with Virtual Hosts and redirects.</p>\n<p>External links:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Wildcard_DNS_record\">Wildcard DNS record</a> (Wikipedia)</li>\n<li><a href=\"https://httpd.apache.org/docs/2.0/en/vhosts/\">Apache Virtual Host</a> (Apache HTTP Server documentation)</li>\n<li><a href=\"https://documentation.cpanel.net/display/74Docs/cPanel+Features+List#DomainsTab\">cPanel Domains</a> (cPanel documentation)</li>\n</ul>\n<p>For some examples of how to configure wildcard subdomains on various systems, see: <a href=\"https://wordpress.org/documentation/article/configuring-wildcard-subdomains/\">Configuring Wildcard Subdomains</a></p>\n<h3 id=\"path-based\">Path-based</h3>\n<p>Also known as &#8216;Subfolder&#8217; or &#8216;Subdirectory&#8217; installs, a path-based network uses URLs like https://example.com/subsite</p>\n<p>If you are using pretty permalinks in your site already, then a path-based network will work as well, and you do not need any of the other information in this section. That said, be aware that your main site will use the following URL pattern for posts: https://example.com/blog/[postformat]/</p>\n<p>At this time, you <strong>cannot</strong> remove the blog slug without manual configuration to the network options in a non-obvious place. It&#8217;s not recommended.</p>\n<h2 id=\"wordpress-settings-requirements\">WordPress Settings Requirements</h2>\n<p>When you install a multisite network you start from an existing WordPress installation. If it is a fresh install with its own domain name, then you do not need to read this section. If it is an established site, or not reachable using just a domain name, then the following requirements apply to allow it to be converted to a multisite network.</p>\n<h3 id=\"be-aware\">Be Aware</h3>\n<p><a href=\"https://developer.wordpress.org/advanced-administration/server/wordpress-in-directory/\">Giving WordPress its own directory</a> works with Multisite as of 3.5, however you must make the &#8216;own directory&#8217; changes before you activate Multisite.</p>\n<p>While it&#8217;s not recommended to use www in your domain URL, if you chose to do so and plan to use <em>subdomains</em> for multisite, make sure that <strong>both</strong> the site address and the WordPress address are the same. Also keep in mind some hosts will default to showing this sort of URL:</p>\n<p><a href=\"https://i0.wp.com/wordpress.org/documentation/files/2018/11/no-www.png?ssl=1\"><img decoding=\"async\" src=\"https://i0.wp.com/wordpress.org/support/files/2018/11/no-www.png?fit=474%2C215&amp;ssl=1\" alt=\"\" /></a></p>\n<p>For this, and many other reasons, we do not suggest you use www in your domain name whenever possible. If you plan on changing them to <code>domain.com</code> or <code>www.domain.com</code>, do so <em>before</em> you begin the rest of the setup for multisite, as changing the domain name after the fact is more complicated.</p>\n<h3 id=\"restrictions\">Restrictions</h3>\n<p>You <strong>cannot create a network</strong> in the following cases:</p>\n<ul>\n<li>&#8220;WordPress address (URL)&#8221; uses a port number other than &#8216;:80&#8217;, &#8216;:443&#8217;.</li>\n</ul>\n<p>You <em>cannot choose <strong>Sub-domain</strong> Install</em> (for a domain-based network) in the following cases:</p>\n<ul>\n<li>The WordPress URL contains a path, not just a domain. (That is, WordPress is not installed in a document root, or you are not using the URL of that document root.)</li>\n<li>&#8220;WordPress address (URL)&#8221; is <code>localhost</code>.</li>\n<li>&#8220;WordPress address (URL)&#8221; is IP address such as 127.0.0.1.</li>\n</ul>\n<p>(Note that you can create a domain-based network on your local machine for testing purposes by using your hosts file to map some other hostnames to the IP address 127.0.0.1, so that you never have to use the hostname <code>localhost</code>.)</p>\n<p>You <em>cannot choose <strong>Sub-directory</strong> Install</em> (for a path-based network) if your existing WordPress installation has been set up for more than a month, due to issues with existing permalinks. (This problem will be fixed in a future version. See <a href=\"https://developer.wordpress.org/advanced-administration/multisite/administration/#switching-network-types\">Switching network types</a> for more information.)</p>\n<p><em>See <code>wp-admin/network.php</code> for more detail)</em></p>\n<h2>Changelog</h2>\n<ul>\n<li>2022-10-21: Original content from <a href=\"https://wordpress.org/documentation/article/before-you-create-a-network/\">Before You Create A Network</a>.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 145853,
    "menu_order": 1,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-145854",
        "adv-admin-handbook",
        "type-adv-admin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145854",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/adv-admin-handbook"
            }
        ],
        "version-history": [
            {
                "count": 6,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145854/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155240,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145854/revisions/155240"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/adv-admin-handbook/145853"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=145854"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}