{
    "id": 139822,
    "date": "2022-02-03T09:39:48",
    "date_gmt": "2022-02-03T09:39:48",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/explanations/architecture/styles/"
    },
    "modified": "2025-01-07T18:34:08",
    "modified_gmt": "2025-01-07T18:34:08",
    "slug": "styles",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/explanations/architecture/styles/",
    "title": {
        "rendered": "Styles in the Editor"
    },
    "content": {
        "rendered": "<p>This document introduces the main concepts related to styles that affect the user content in the block editor. It points to the relevant reference guides and tutorials for readers to dig deeper into each one of the ideas presented. It&#8217;s aimed to block authors and people working in the block editor project.</p>\n<h2>HTML and CSS</h2>\n<p>By creating a post in the block editor the user is creating a number of artifacts: a HTML document plus a number of CSS stylesheets, either embedded in the document or external.</p>\n<p>The final HTML document is the result of a few things:</p>\n<ul>\n<li>the <a href=\"https://developer.wordpress.org/themes/basics/template-files/\">WordPress templates</a> provided by the theme, either via PHP (classic theme) or via HTML templates (block theme) (<a href=\"https://developer.wordpress.org/themes/block-themes/#differences-and-similarities-between-classic-themes-and-block-themes\">learn more</a> about the differences)</li>\n<li>the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/core-blocks/\">blocks</a> and patterns in use that come with a predefined structure (HTML markup)</li>\n<li>the user modifications to the content: adding content, transforming existing content (convert a given paragraph into a heading), or modifying it (attaching a class or inline styles to a block)</li>\n</ul>\n<p>The stylesheets loaded in the front end include:</p>\n<ul>\n<li><strong>Blocks</strong>. The stylesheets that come with the block. In the front end, you can find a single stylesheet with all block styles defined by WordPress (<code>wp-block-library-*</code> ) or separate stylesheets per block in use (as in <code>wp-block-group-*</code>, <code>wp-block-columns-*</code>, etc). See <a href=\"https://make.wordpress.org/core/2021/07/01/block-styles-loading-enhancements-in-wordpress-5-8/\">this note</a> for the full details.</li>\n<li><strong>Global styles</strong>. These styles are generated on the fly by using data coming from a theme.json file: see <a href=\"https://make.wordpress.org/core/2021/06/25/introducing-theme-json-in-wordpress-5-8/\">note</a>, <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/\">reference</a>, and <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/themes/global-settings-and-styles/\">how to guide</a>. Specifically, it merges the contents of the theme.json from WordPress, the theme.json from the theme (if it has one), and the user data provided via the global styles sidebar in the site editor. The result of processing this data is an embedded stylesheet whose id is <code>global-styles-inline-css</code>.</li>\n<li><strong>Theme</strong>. Historically, themes have enqueued their own stylesheets, where the id is based on the theme name, as in <code>twentytwentytwo-style-css</code>. In addition to having their own stylesheets they can now declare a theme.json file containing styles that will be part of the stylesheet generated by global styles.</li>\n<li><strong>User</strong>. Some of the user actions in the editor will generate style content. This is the case for features such as duotone, layout, or link color.</li>\n<li><strong>Other</strong>. WordPress and plugins can also enqueue stylesheets.</li>\n</ul>\n<h2>Block styles</h2>\n<p>Since the introduction of the block editor in WordPress 5.0, there were tools for the users to &#8220;add styles&#8221; to specific blocks. By using these tools, the user would attach new classes or inline styles to the blocks, modifying their visual aspect.</p>\n<p>By default, blocks come with a given HTML markup. Think of the paragraph block, for example:</p>\n<pre><code class=\"language-html\">&lt;p&gt;&lt;/p&gt;\n</code></pre>\n<p>In its simplest form, any style rule that targets the <code>p</code> selector will apply styles to this block, whether it comes from a block, a theme, etc.</p>\n<p>The user may change the state of this block by applying different styles: a text alignment, a color, a font size, a line height, etc. These states are reflected in the HTML markup of the block in the form of HTML attributes, mainly through the <code>class</code> or <code>style</code> attributes, though it can be any other the block author sees fit.</p>\n<p>After some user modifications to the block, the initial markup may become something like this:</p>\n<pre><code class=\"language-html\">&lt;p class=\"has-color has-green-color has-font-size has-small-font-size my-custom-class\"\n    style=\"line-height: 1em\"&gt;&lt;/p&gt;\n</code></pre>\n<p>This is what we refer to as &#8220;user-provided block styles&#8221;, also know as &#8220;local styles&#8221; or &#8220;serialized styles&#8221;. Essentially, each tool (font size, color, etc) ends up adding some classes and/or inline styles to the block markup. The CSS styling for these classes is part of the block, global, or theme stylesheets.</p>\n<p>The ability to modify a block state coupled with the fact that a block can live within any other block (think of a paragraph within a group), creates a vast amount of potential states and style possibilities.</p>\n<h3>From UI controls to HTML markup</h3>\n<p>If you follow the <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/block-tutorial/\">block tutorial</a> you can learn up about the different parts of the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/\">block API</a> presented here in more detail and also build your own block. This is an introduction to the general concepts of how a block can let users edit its state.</p>\n<p>To build an experience like the one described above a block author needs a few pieces:</p>\n<ol>\n<li><strong>A UI control</strong>. It presents the user some choices, for example, to be able to change the font size of the block. The control takes care of reading the data from the block (does this block already have a font size assigned?) and other data it needs (what are the font sizes a user can use in this block?). See available <a href=\"https://developer.wordpress.org/block-editor/reference-guides/components/\">component library</a>.</li>\n<li><strong>A block attribute</strong>. The block needs to hold data to know which modifications were applied to it: whether it has been given a font size already for example. See how blocks can define <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-attributes/\">attributes</a>.</li>\n<li><strong>Access to style data</strong>. A control may need external information about the styles available for a given block: the list of colors, or the list of font sizes, for example. These are called &#8220;style presets&#8221;, as they are a preselection of styles usually defined by the theme, although WordPress provides some defaults. Check the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/theme-json-living/#settings\">list of data</a> a theme can provide to the editor and how a block author can get access to it via <a href=\"https://developer.wordpress.org/block-editor/reference-guides/packages/packages-block-editor/#usesetting\">useSetting</a>.</li>\n<li><strong>Serialize the user style into HTML markup</strong>. Upon a user action, the block HTML markup needs to be updated accordingly (apply the proper class or inline style). This process is called serialization and it is the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-edit-save/\">edit, save</a>, and <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/block-tutorial/creating-dynamic-blocks/\">render_callback</a> functions&#8217; responsibility: these functions take block data and convert it into HTML.</li>\n</ol>\n<p>In essence, these are the essential mechanics a block author needs to care about for their block to be able to be styled by the user. While this can be done completely manually, there&#8217;s an API that automates this process for common style needs: block supports.</p>\n<h3>Block Supports API</h3>\n<p><a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-supports/\">Block Supports</a> is an API that allows a block to declare what features it supports. By adding some info to their <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-metadata/\">block.json file</a>, the block tells the system what kind of actions a user can do to it.</p>\n<p>For example:</p>\n<pre><code class=\"language-json\">{\n    \"name\": \"core/paragraph\",\n    \"...\": \"...\",\n    \"supports\": {\n        \"typography\": {\n            \"fontSize\": true\n        }\n    }\n}\n</code></pre>\n<p>The paragraph declares support for font size in its <code>block.json</code>. This means the block will show a UI control for users to tweak its font size, unless it&#8217;s disabled by the theme (learn more about how themes can disable UI controls in <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/\">the <code>theme.json</code> reference</a>). The system will also take care of setting up the UI control data (the font size of the block if it has one already assigned, the list of available font sizes to show), and will serialize the block data into HTML markup upon user changes (attach classes and inline styles appropriately).</p>\n<p>By using the block supports mechanism via <code>block.json</code>, the block author is able to create the same experience as before just by writing a couple of lines. Check the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-supports/\">block supports api</a> for adding block supports to static or dynamic blocks.</p>\n<p>Besides the benefit of having to do less work to achieve the same results, there&#8217;s a few other advantages:</p>\n<ul>\n<li>the style information of the block becomes available for the native mobile apps and in the server</li>\n<li>the block will use the UI controls other blocks use for the same styles, creating a more coherent user experience</li>\n<li>the UI controls in use by the block will be automatically updated as they are improved, without the block author having to do anything</li>\n</ul>\n<h3>Current limitations of the Block Supports API</h3>\n<p>While the Block Supports API provides value, it also comes with some limitations a block author needs to be aware of. To better visualize what they are, let&#8217;s run with the following example of a table block:</p>\n<pre><code class=\"language-html\">&lt;table&gt;\n    &lt;thead&gt;\n        &lt;tr&gt;\n            &lt;th&gt;Header&lt;/th&gt;\n        &lt;/tr&gt;\n    &lt;/thead&gt;\n    &lt;tbody&gt;\n        &lt;tr&gt;\n            &lt;th&gt;First&lt;/th&gt;\n        &lt;/tr&gt;\n        &lt;tr&gt;\n            &lt;th&gt;Second&lt;/th&gt;\n        &lt;/tr&gt;\n    &lt;/tbody&gt;\n    &lt;tfoot&gt;\n        &lt;tr&gt;\n            &lt;th&gt;Footer&lt;/th&gt;\n        &lt;/tr&gt;\n    &lt;/tfoot&gt;\n&lt;/table&gt;\n</code></pre>\n<ol>\n<li><strong>Only one style type per block.</strong></li>\n</ol>\n<p>One of the limitations is that, from all the <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-supports/\">styles available</a>, there can be only one instance of any them in use by the block. Following the example, the table block can only have a single font size. If the block author wanted to have three different font sizes (head, body, and footer) it can&#8217;t do it using the current block supports API. See <a href=\"https://github.com/WordPress/gutenberg/issues/33255\">this issue</a> for more detailed info and ways forward.</p>\n<ol>\n<li><strong>Styles are serialized to the outermost HTML node of the block, the wrapper.</strong></li>\n</ol>\n<p>The block supports API only serializes the font size value to the wrapper, resulting in the following HTML <code>&lt;table class=\"has-small-font-size\"&gt;</code> . The current block supports API doesn&#8217;t serialize this value to a different node, for example, the <code>&lt;tbody&gt;</code>.</p>\n<p>This is an active area of work you can follow <a href=\"https://github.com/WordPress/gutenberg/issues/38167\">in the tracking issue</a>. The linked proposal is exploring a different way to serialize the user changes: instead of each block support serializing its own data (for example, classes such as <code>has-small-font-size</code>, <code>has-green-color</code>) the idea is the block would get a single class instead (for example, <code>wp-style-UUID</code>) and the CSS styling for that class will be generated in the server by WordPress.</p>\n<p>While work continues in that proposal, there&#8217;s an escape hatch, an experimental option block authors can use. Any block support can skip the serialization to HTML markup by using <code>__experimentalSkipSerialization</code>. For example:</p>\n<pre><code class=\"language-json\">{\n    \"name\": \"core/paragraph\",\n    \"...\": \"...\",\n    \"supports\": {\n        \"typography\": {\n            \"fontSize\": true,\n            \"__experimentalSkipSerialization\": true\n        }\n    }\n}\n</code></pre>\n<p>This means that the typography block support will do all of the things (create a UI control, bind the block attribute to the control, etc) except serializing the user values into the HTML markup. The classes and inline styles will not be automatically applied to the wrapper and it is the block author&#8217;s responsibility to implement this in the <code>edit</code>, <code>save</code>, and <code>render_callback</code> functions. See <a href=\"https://github.com/WordPress/gutenberg/issues/28913\">this issue</a> for examples of how it was done for some blocks provided by WordPress.</p>\n<p>Note that, if <code>__experimentalSkipSerialization</code> is enabled for a group (typography, color, spacing) it affects <em>all</em> block supports within this group. In the example above <em>all</em> the properties within the <code>typography</code> group will be affected (e.g. <code>fontSize</code>, <code>lineHeight</code>, <code>fontFamily</code> .etc).</p>\n<p>To enable for a <em>single</em> property only, you may use an array to declare which properties are to be skipped. In the example below, only <code>fontSize</code> will skip serialization, leaving other items within the <code>typography</code> group (e.g. <code>lineHeight</code>, <code>fontFamily</code> .etc) unaffected.</p>\n<pre><code class=\"language-json\">{\n    \"name\": \"core/paragraph\",\n    \"...\": \"...\",\n    \"supports\": {\n        \"typography\": {\n            \"fontSize\": true,\n            \"lineHeight\": true,\n            \"__experimentalSkipSerialization\": [ \"fontSize\" ]\n        }\n    }\n}\n</code></pre>\n<p>Support for this feature was <a href=\"https://github.com/WordPress/gutenberg/pull/36293\">added in this PR</a>.</p>\n<h2>Global styles</h2>\n<p>Global Styles refers to a mechanism that generates site-wide styles. Unlike the block styles described in the previous section, these are not serialized into the post content and are not attached to the block HTML. Instead, the output of this system is a new stylesheet with id <code>global-styles-inline-css</code>.</p>\n<p>This mechanism was <a href=\"https://make.wordpress.org/core/2021/06/25/introducing-theme-json-in-wordpress-5-8/\">introduced in WordPress 5.8</a>. At the time, it only took data from WordPress and the active theme. WordPress 5.9 expanded the system to also take style data from users.</p>\n<p>This is the general data flow:</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/raw.githubusercontent.com/WordPress/gutenberg/HEAD/docs/explanations/architecture/assets/global-styles-input-output.png?ssl=1\" alt=\"Data flow of Global Styles\" /></p>\n<p>The process of generating the stylesheet has, in essence, three steps:</p>\n<ol>\n<li>Gather data: the <code>theme.json</code> file <a href=\"https://github.com/WordPress/wordpress-develop/blob/trunk/src/wp-includes/theme.json\">bundled with WordPress</a>, the <code>theme.json</code> file of the active theme if it exists, and the user&#8217;s styles provided via the global styles UI in the site editor.</li>\n<li>Consolidate data: the structured information from different origins -WordPress defaults, theme, and user- is normalized and merged into a single structure.</li>\n<li>Convert data into a stylesheet: convert the internal representation into CSS style rules and enqueue them as a stylesheet.</li>\n</ol>\n<h3>Gather data</h3>\n<p>The data can come from three different origins: WordPress defaults, the active theme, or the user. All three of them use the same <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/\"><code>theme.json</code> format</a>.</p>\n<p>Data from WordPress and the active theme is retrieved from the corresponding <code>theme.json</code> file. Data from the user is pulled from the database, where it&#8217;s stored after the user saves the changes they did via the global styles sidebar in the site editor.</p>\n<h3>Consolidate data</h3>\n<p>The goal of this phase is to build a consolidated structure.</p>\n<p>There are two important processes going on in this phase. First, the system needs to normalize all the incoming data, as different origins may be using different versions of the <code>theme.json</code> format. For example, a theme may be using <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/theme-json-v1/\">v1</a> while the WordPress base is using <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/theme-json-living/\">the latest version</a>. Second, the system needs to decide how to merge the input into a single structure. This will be the focus of the following sections.</p>\n<h4>Styles</h4>\n<p>Different parts of the incoming <code>theme.json</code> structure are treated differently. The data present in the <code>styles</code> section is blended together following this logic: user data overrides theme data, and theme data overrides WordPress data.</p>\n<p>For example, if we had the following three <code>theme.json</code> structures coming from WordPress, the theme, and the user respectively:</p>\n<pre><code class=\"language-json\">{\n    \"styles\": {\n        \"color\": {\n            \"background\": \"&lt;WordPress value&gt;\"\n        },\n        \"typography\": {\n            \"fontSize\": \"&lt;WordPress value&gt;\"\n        }\n    }\n}\n</code></pre>\n<pre><code class=\"language-json\">{\n    \"styles\": {\n        \"typography\": {\n            \"fontSize\": \"&lt;theme value&gt;\",\n            \"lineHeight\": \"&lt;theme value&gt;\"\n        }\n    }\n}\n</code></pre>\n<pre><code class=\"language-json\">{\n    \"styles\": {\n        \"typography\": {\n            \"lineHeight\": \"&lt;user value&gt;\"\n        }\n    }\n}\n</code></pre>\n<p>The result after the consolidation would be:</p>\n<pre><code class=\"language-json\">{\n    \"styles\": {\n        \"color\": {\n            \"background\": \"&lt;WordPress value&gt;\"\n        },\n        \"typography\": {\n            \"fontSize\": \"&lt;theme value&gt;\",\n            \"lineHeight\": \"&lt;user value&gt;\"\n        }\n    }\n}\n</code></pre>\n<h4>Settings</h4>\n<p>The <code>settings</code> section works differently than styles. Most of the settings are only used to configure the editor and have no effect on the global styles. Only a few of them are part of the resulting stylesheet: the presets.</p>\n<p>Presets are the predefined styles that are shown to the user in different parts of the UI: the color palette or the font sizes, for example. They comprise the following settings: <code>color.duotone</code>, <code>color.gradients</code>, <code>color.palette</code>, <code>typography.fontFamilies</code>, <code>typography.fontSizes</code>. Unlike <code>styles</code>, presets from an origin don&#8217;t override values from other origins. Instead, all of them are stored in the consolidated structure.</p>\n<p>For example, if we have the following <code>theme.json</code> structures coming from WordPress, the theme, and the user respectively:</p>\n<pre><code class=\"language-json\">{\n    \"settings\": {\n        \"color\": {\n            \"palette\": [ \"&lt;WordPress values&gt;\" ],\n            \"gradients\": [ \"&lt;WordPress values&gt;\" ]\n        }\n    }\n}\n</code></pre>\n<pre><code class=\"language-json\">{\n    \"settings\": {\n        \"color\": {\n            \"palette\": [ \"&lt;theme values&gt;\" ]\n        },\n        \"typography\": {\n            \"fontFamilies\": [ \"&lt;theme values&gt;\" ]\n        }\n    }\n}\n</code></pre>\n<pre><code class=\"language-json\">{\n    \"settings\": {\n        \"color\": {\n            \"palette\": [ \"&lt;user values&gt;\" ]\n        }\n    }\n}\n</code></pre>\n<p>The result after the consolidation would be:</p>\n<pre><code class=\"language-json\">{\n    \"settings\": {\n        \"color\": {\n            \"palette\": {\n                \"default\": [ \"&lt;WordPress values&gt;\" ],\n                \"theme\": [ \"&lt;theme values&gt;\" ],\n                \"user\": [ \"&lt;user values&gt;\" ]\n            },\n            \"gradients\": {\n                \"default\": [ \"&lt;WordPress values&gt;\" ]\n            }\n        },\n        \"typography\": {\n            \"fontFamilies\": {\n                \"theme\": [ \"&lt;theme values&gt;\" ]\n            }\n        }\n    }\n}\n</code></pre>\n<h3>From data to styles</h3>\n<p>The last phase of generating the stylesheet is converting the consolidated data into CSS style rules.</p>\n<h4>Styles to CSS rules</h4>\n<p>The <code>styles</code> section can be thought of as a structured representation of CSS rules, each chunk representing a CSS rule:</p>\n<ul>\n<li>A key/value in theme.json maps to a CSS declaration (<code>property: value</code>).</li>\n<li>The CSS selector for a given chunk is generated based on its semantics:\n<ul>\n<li>The top-level section uses the <code>body</code> selector.</li>\n<li>The top-level elements use an ID selector matching the HTML element they represent (for example, <code>h1</code> or <code>a</code>).</li>\n<li>Blocks use the default class name they generate (<code>core/group</code> becomes <code>.wp-block-group</code>) unless they explicitly set a different one using their <code>block.json</code> (<code>core/paragraph</code> becomes <code>p</code>). See the &#8220;Current limits&#8221; section for more about this.</li>\n<li>Elements within a block use the concatenation of the block and element selector.</li>\n</ul>\n</li>\n</ul>\n<p>For example, the following <code>theme.json</code> structure:</p>\n<pre><code class=\"language-json\">{\n    \"styles\": {\n        \"typography\": {\n            \"fontSize\": \"&lt;top-level value&gt;\"\n        },\n        \"elements\": {\n            \"h1\": {\n                \"typography\": {\n                    \"fontSize\": \"&lt;h1 value&gt;\"\n                }\n            }\n        },\n        \"blocks\": {\n            \"core/paragraph\": {\n                \"color\": {\n                    \"text\": \"&lt;paragraph value&gt;\"\n                }\n            },\n            \"core/group\": {\n                \"color\": {\n                    \"text\": \"&lt;group value&gt;\"\n                },\n                \"elements\": {\n                    \"h1\": {\n                        \"color\": {\n                            \"text\": \"&lt;h1 within group value&gt;\"\n                        }\n                    }\n                }\n            }\n        }\n    }\n}\n</code></pre>\n<p>is converted to the following CSS:</p>\n<pre><code class=\"language-css\">body {\n    font-size: &lt;top-level value&gt;;\n}\nh1 {\n    font-size: &lt;h1 value&gt;;\n}\np {\n    color: &lt;paragraph value&gt;;\n}\n.wp-block-group {\n    color: &lt;group value&gt;;\n}\n.wp-block-group h1 {\n    color: &lt;h1 within group value&gt;;\n}\n</code></pre>\n<h4>Settings to CSS rules</h4>\n<p>From the <code>settings</code> section, all the values of any given presets will be converted to a CSS Custom Property that follows this naming structure: <code>--wp--preset--&lt;category&gt;-&lt;slug&gt;</code>. The selectors follow the same rules described in the styles section above.</p>\n<p>For example, the following theme.json</p>\n<pre><code class=\"language-json\">{\n    \"settings\": {\n        \"color\": {\n            \"palette\": {\n                \"default\": [\n                    {\n                        \"slug\": \"vivid-red\",\n                        \"value\": \"#cf2e2e\",\n                        \"name\": \"Vivid Red\"\n                    }\n                ],\n                \"theme\": [\n                    {\n                        \"slug\": \"foreground\",\n                        \"value\": \"#000\",\n                        \"name\": \"Foreground\"\n                    }\n                ]\n            }\n        },\n        \"blocks\": {\n            \"core/site-title\": {\n                \"color\": {\n                    \"palette\": {\n                        \"theme\": [\n                            {\n                                \"slug\": \"foreground\",\n                                \"value\": \"#1a4548\",\n                                \"name\": \"Foreground\"\n                            }\n                        ]\n                    }\n                }\n            }\n        }\n    }\n}\n</code></pre>\n<p>Will be converted to the following CSS style rule:</p>\n<pre><code class=\"language-CSS\">body {\n  --wp--preset--color--vivid-red: #cf2e2e;\n  --wp--preset--color--foreground: #000;\n}\n\n.wp-block-site-title {\n  --wp--preset--color--foreground: #1a4548;\n}\n</code></pre>\n<p>In addition to the CSS Custom Properties, all presets but duotone generate CSS classes for each value. The example above will generate the following CSS classes as well:</p>\n<pre><code class=\"language-CSS\">/* vivid-red */\n.has-vivid-red-color { color: var(--wp--preset--color--vivid-red) !important; }\n.has-vivid-red-background-color { background-color: var(--wp--preset--color--vivid-red) !important; }\n.has-vivid-red-border-color { border-color: var(--wp--preset--color--vivid-red) !important; }\n\n/* foreground */\n.has-foreground-color { color: var(--wp--preset--color--foreground) !important; }\n.has-foreground-background-color { background-color: var(--wp--preset--color--foreground) !important; }\n.has-foreground-border-color { border-color: var(--wp--preset--color--foreground) !important; }\n\n/* foreground within site title*/\n.wp-block-site-title .has-foreground-color { color: var(--wp--preset--color--foreground) !important; }\n.wp-block-site-title .has-foreground-background-color { background-color: var(--wp--preset--color--foreground) !important; }\n.wp-block-site-title .has-foreground-border-color { border-color: var(--wp--preset--color--foreground) !important; }\n</code></pre>\n<h3>Current limitations of the Global Styles API</h3>\n<h4>1. <strong>Setting a different CSS selector for blocks requires server-registration</strong></h4>\n<p>By default, the selector assigned to a block is <code>.wp-block-&lt;block-name&gt;</code>. However, blocks can change this should they need. They can provide a CSS selector via the <code>__experimentalSelector</code> property in its <code>block.json</code>.</p>\n<p>If blocks do this, they need to be registered in the server using the <code>block.json</code>, otherwise, the global styles code doesn&#8217;t have access to that information and will use the default CSS selector for the block.</p>\n<h4>2. <strong>Can&#8217;t target different HTML nodes for different styles</strong></h4>\n<p>Every chunk of styles can only use a single selector.</p>\n<p>This is particularly relevant if the block is using <code>__experimentalSkipSerialization</code> to serialize the different style properties to different nodes other than the wrapper. See &#8220;Current limitations of blocks supports&#8221; for more.</p>\n<h4>3. <strong>Only a single property per block</strong></h4>\n<p>Similarly to block supports, there can be only one instance of any style in use by the block. For example, the block can only have a single font size. See related &#8220;Current limitations of block supports&#8221;.</p>\n<h4>4. <strong>Only blocks using block supports are shown in the Global Styles UI</strong></h4>\n<p>The global styles UI in the site editor has a screen for per-block styles. The list of blocks is generated dynamically using the block supports from the <code>block.json</code> of blocks. If a block wants to be listed there, it needs to use the block supports mechanism.</p>\n<h2>Layout styles</h2>\n<p>In addition to styles at the individual block level and in global styles, there is the concept of layout styles that are output for both blocks-based and classic themes.</p>\n<p>The layout block support outputs common layout styles that are shared between blocks used for creating layouts. Layout styles are useful for providing common styling for any block that is a container for other blocks. Examples of blocks that depend on these layout styles include Group, Row, Columns, Buttons, and Social Icons. The feature is enabled in core blocks via the <code>layout</code> setting under <code>supports</code> in a block&#8217;s <code>block.json</code> file.</p>\n<p>There are two primary places where Layout styles are output:</p>\n<h3>Base layout styles</h3>\n<p>Base layout styles are those styles that are common to all blocks that opt in to a particular layout type. Examples of common base layout styling include setting <code>display: flex</code> for blocks that use the Flex layout type (such as Buttons and Social Icons), and providing default max-width for constrained layouts.</p>\n<p>Base layout styles are output from within <a href=\"https://github.com/WordPress/wordpress-develop/blob/trunk/src/wp-includes/class-wp-theme-json.php\">the main PHP class</a> that handles global styles, and form part of the global styles stylesheet. In order to provide support for core blocks in classic themes, these styles are always output, irrespective of whether the theme provides its own <code>theme.json</code> file.</p>\n<p>Common layout definitions are stored in <a href=\"https://github.com/WordPress/wordpress-develop/blob/trunk/src/wp-includes/block-supports/layout.php\">the core layout block support file</a>.</p>\n<h3>Individual layout styles</h3>\n<p>When a block that opts in to layout support is rendered, two things are processed and added to the output via <a href=\"https://github.com/WordPress/wordpress-develop/blob/trunk/src/wp-includes/block-supports/layout.php\"><code>layout.php</code></a>:</p>\n<ul>\n<li>Semantic class names are added to the block markup to indicate which layout settings are in use. For example, <code>is-layout-flow</code> is for blocks (such as Group) that use the default/flow layout, and <code>is-content-justification-right</code> is added when a user sets a block to use right justification.</li>\n<li>Individual styles are generated for non-default layout values that are set on the individual block being rendered. These styles are attached to the block via a container class name using the form <code>wp-container-$id</code> where the <code>$id</code> is a <a href=\"https://developer.wordpress.org/reference/functions/wp_unique_id/\">unique number</a>.</li>\n</ul>\n<h3>Available layout types</h3>\n<p>There are currently four layout types in use:</p>\n<ul>\n<li>Default/Flow: Items are stacked vertically. The parent container block&#8217;s display value isn&#8217;t specified, so that it may use the default value for that HTML element. For most elements that will usually be <code>block</code>. The spacing between children is handled via vertical margins.</li>\n<li>Constrained: Items are stacked vertically, using the same spacing logic as the Flow layout. Features constrained widths for child content, outputting widths for standard content size and wide size. Defaults to using global <code>contentSize</code> and <code>wideSize</code> values set in <code>settings.layout</code> in the <code>theme.json</code>.</li>\n<li>Flex: Items are displayed using a Flexbox layout. Defaults to a horizontal orientation. Spacing between children is handled via the <code>gap</code> CSS property.</li>\n<li>Grid: Items are displayed using a Grid layout. Defaults to an <code>auto-fill</code> approach to column generation but can also be set to a fixed number of columns. Spacing between children is handled via the <code>gap</code> CSS property.</li>\n</ul>\n<p>For controlling spacing between blocks, and enabling block spacing controls see: <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/themes/global-settings-and-styles/#what-is-blockgap-and-how-can-i-use-it\">What is blockGap and how can I use it?</a>.</p>\n<h3>Targeting layout or container blocks from themes</h3>\n<p>The layout block support is designed to enable control over layout features from within the block and site editors. Where possible, try to use the features of the blocks to determine particular layout requirements rather than relying upon additional stylesheets.</p>\n<p>For themes that wish to target container blocks in order to add or adjust particular styles, the block&#8217;s class name is often the best class name to use. Class names such as <code>wp-block-group</code> or <code>wp-block-columns</code> are usually reliable class names for targeting a particular block. In addition to block and layout classnames, there is also a classname composed of block and layout together: for example, for a Group block with a constrained layout it will be <code>wp-block-group-is-layout-constrained</code>.</p>\n<p>For targeting a block that uses a particular layout type, avoid targeting <code>wp-container-</code> as container classes may not always be present in the rendered markup.</p>\n<h4>Semantic class names</h4>\n<p>Work is currently underway to expand stable semantic classnames in Layout block support output. The task is being discussed in <a href=\"https://github.com/WordPress/gutenberg/issues/38719\">this issue</a>.</p>\n<p>The current semantic class names that can be output by the Layout block support are:</p>\n<ul>\n<li><code>is-layout-flow</code>: Blocks that use the Default/Flow layout type.</li>\n<li><code>is-layout-constrained</code>: Blocks that use the Constrained layout type.</li>\n<li><code>is-layout-flex</code>: Blocks that use the Flex layout type.</li>\n<li><code>is-layout-grid</code>: Blocks that used the Grid layout type.</li>\n<li><code>wp-container-$id</code>: Where <code>$id</code> is a semi-random number. A container class that only exists when the block contains non-default Layout values. This class should not be used directly for any CSS targeting as it may or may not be present.</li>\n<li><code>is-horizontal</code>: When a block explicitly sets <code>orientation</code> to <code>horizontal</code>.</li>\n<li><code>is-vertical</code>: When a block explicitly sets <code>orientation</code> to <code>vertical</code>.</li>\n<li><code>is-content-justification-left</code>: When a block explicitly sets <code>justifyContent</code> to <code>left</code>.</li>\n<li><code>is-content-justification-center</code>: When a block explicitly sets <code>justifyContent</code> to <code>center</code>.</li>\n<li><code>is-content-justification-right</code>: When a block explicitly sets <code>justifyContent</code> to <code>right</code>.</li>\n<li><code>is-content-justification-space-between</code>: When a block explicitly sets <code>justifyContent</code> to <code>space-between</code>.</li>\n<li><code>is-nowrap</code>: When a block explicitly sets <code>flexWrap</code> to <code>nowrap</code>.</li>\n</ul>\n<h3>Opting out of generated layout styles</h3>\n<p>Layout styles output is switched on by default because the styles are required by core structural blocks. However, themes can opt out of generated block layout styles while retaining semantic class name output by using the <code>disable-layout-styles</code> block support. Such themes will be responsible for providing all their own layout styles. See <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/themes/theme-support/#disabling-base-layout-styles\">the entry under Theme Support</a>.</p>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 134617,
    "menu_order": 362,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-139822",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/139822",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 16,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/139822/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 156141,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/139822/revisions/156141"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/134617"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=139822"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}