{
    "id": 154871,
    "date": "2024-08-19T10:55:01",
    "date_gmt": "2024-08-19T10:55:01",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/reference-guides/interactivity-api/core-concepts/server-side-rendering/"
    },
    "modified": "2024-10-30T17:09:36",
    "modified_gmt": "2024-10-30T17:09:36",
    "slug": "server-side-rendering",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/reference-guides/interactivity-api/core-concepts/server-side-rendering/",
    "title": {
        "rendered": "Server-side rendering: Processing directives on the server"
    },
    "content": {
        "rendered": "<p>WordPress has always been built on the foundation of server-side rendering. Traditionally, when a user requests a WordPress page, the server processes the PHP code, queries the database, and generates the HTML markup that is sent to the browser.</p>\n<p>In recent years, modern JavaScript frameworks like Vue, React, or Svelte have revolutionized the way we build web applications. These frameworks provide reactive and declarative programming models that enable developers to create dynamic, interactive user interfaces with ease.</p>\n<p>However, when it comes to server-side rendering, these frameworks require a JavaScript-based server, such as NodeJS, to execute their code and generate the initial HTML. This means that PHP-based servers, like WordPress, cannot directly utilize these frameworks without sacrificing their native PHP rendering capabilities. This limitation poses a challenge for WordPress developers who want to leverage the power of reactive and declarative programming while still benefiting from WordPress&#8217;s traditional server-side rendering strengths. The Interactivity API bridges this gap by bringing <a href=\"https://developer.wordpress.org/block-editor/reference-guides/interactivity-api/core-concepts/the-reactive-and-declarative-mindset/\">reactive and declarative programming principles</a> to WordPress without compromising its server-side rendering foundation.</p>\n<p>In this guide, we&#8217;ll explore how the Interactivity API processes directives on the server, enabling WordPress to deliver interactive, state-aware HTML from the initial page load, while setting the stage for seamless client-side interactivity.</p>\n<h2>Processing the directives on the server</h2>\n<p>The Interactivity API&#8217;s Server Directive Processing capabilities enable WordPress to generate the initial HTML with the correct interactive state, providing a faster initial render. After the initial server-side render, the Interactivity API&#8217;s client-side JavaScript takes over, enabling dynamic updates and interactions without requiring full page reloads. This approach combines the best of both worlds: the SEO and performance benefits of traditional WordPress server-side rendering, and the dynamic, reactive user interfaces offered by modern JavaScript frameworks.</p>\n<p>To understand how the Server Directive Processing works, let&#8217;s start with an example where a list of fruits is rendered using the <code>data-wp-each</code> directive.</p>\n<p>The following are the necessary steps to ensure that the directives are correctly processed by the Server Directive Processing of the Interactivity API during the server-side rendering of WordPress.</p>\n<ul>\n<li><strong>1. Mark the block as interactive</strong>\n<p>First, to enable the server processing of the interactive block&#8217;s directives, you must add <code>supports.interactivity</code> to the <code>block.json</code>:</p>\n<pre><code class=\"language-json\">{\n    \"supports\": {\n        \"interactivity\": true\n    }\n}\n</code></pre>\n</li>\n<li><strong>2. Initialize the global state or local context</strong>\n<p>Then, you must initialize either the global state or the local context that will be used during the server-side rendering of the page.</p>\n<p>If you are using global state, you must use the <code>wp_interactivity_state</code> function:</p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  'fruits' =&gt; array( 'Apple', 'Banana', 'Cherry' )\n));\n</code></pre>\n<p>If you are using local context, the initial values are defined with the <code>data-wp-context</code> directive itself, either by:</p>\n<ul>\n<li>Adding it directly to the HTML.\n<pre><code class=\"language-html\">&lt;ul data-wp-context='{ \"fruits\": [\"Apple\", \"Banana\", \"Cherry\"] }'&gt;\n    ...\n&lt;/ul&gt;\n</code></pre>\n</li>\n<li>Using the <code>wp_interactivity_data_wp_context</code> helper.\n<pre><code class=\"language-php\">&lt;?php\n$context = array( 'fruits' =&gt; array( 'Apple', 'Banana', 'Cherry' ) );\n?&gt;\n\n&lt;ul &lt;?php echo wp_interactivity_data_wp_context( $context ); ?&gt;&gt;\n  ...\n&lt;/ul&gt;\n</code></pre>\n</li>\n</ul>\n</li>\n<li><strong>3. Define the interactive elements using directives</strong>\n<p>Next, you need to add the necessary directives to the HTML markup.</p>\n<pre><code class=\"language-html\">&lt;ul data-wp-interactive=\"myFruitPlugin\"&gt;\n    &lt;template data-wp-each=\"state.fruits\"&gt;\n        &lt;li data-wp-text=\"context.item\"&gt;&lt;/li&gt;\n    &lt;/template&gt;\n&lt;/ul&gt;\n</code></pre>\n<p>In this example:</p>\n<ul>\n<li>The <code>data-wp-interactive</code> directive activates the interactivity for the DOM element and its children.</li>\n<li>The <code>data-wp-each</code> directive is used to render a list of elements. The directive can be used in <code>&lt;template&gt;</code> tags, with the value being a reference path to an array stored in the global state or the local context.</li>\n<li>The <code>data-wp-text</code> directive sets the inner text of an HTML element. Here, it points to <code>context.item</code>, which is where the <code>data-wp-each</code> directive stores each item of the array.</li>\n</ul>\n<p>The exact same directives can also be used when using local context instead of global state. The only difference is that <code>data-wp-each</code> points to <code>context.fruits</code> instead of <code>state.fruits</code>:</p>\n<pre><code class=\"language-html\">&lt;ul\n    data-wp-interactive=\"myFruitPlugin\"\n    data-wp-context='{ \"fruits\": [ \"Apple\", \"Banana\", \"Cherry\" ] }'\n&gt;\n    &lt;template data-wp-each=\"context.fruits\"&gt;\n        &lt;li data-wp-text=\"context.item\"&gt;&lt;/li&gt;\n    &lt;/template&gt;\n&lt;/ul&gt;\n</code></pre>\n</li>\n</ul>\n<p>That&#8217;s it! Once you&#8217;ve set up your interactive block with <code>supports.interactivity</code>, initialized your global state or local context, and added the directives to the HTML markup, the Interactivity API will take care of the rest. There&#8217;s no additional code required from the developer to process these directives on the server side.</p>\n<p>Behind the scenes, WordPress uses the <code>wp_interactivity_process_directives</code> function to find and process the directives in the HTML markup of your block. This function uses the HTML API to make the necessary changes to the markup, based on the found directives and the initial global state and/or local context.</p>\n<p>As a result, the HTML markup sent to the browser is already in its final form, with all directives correctly processed. This means that when the page first loads in the browser, it already contains the correct initial state of all interactive elements, without needing any JavaScript to modify it.</p>\n<p>This is how the final HTML markup of the fruit list example would look like (directives omitted):</p>\n<pre><code class=\"language-html\">&lt;ul&gt;\n    &lt;li&gt;Apple&lt;/li&gt;\n    &lt;li&gt;Banana&lt;/li&gt;\n    &lt;li&gt;Cherry&lt;/li&gt;\n&lt;/ul&gt;\n</code></pre>\n<p>As you can see, the <code>data-wp-each</code> directive has generated a <code>&lt;li&gt;</code> element for each fruit in the array, and the <code>data-wp-text</code> directive has been processed, populating each <code>&lt;li&gt;</code> with the correct fruit name.</p>\n<h2>Manipulating the global state and local context in the client</h2>\n<p>One of the key strengths of the Interactivity API is how it bridges the gap between server-side rendering and client-side interactivity. To do so, the global state and local context initialized on the server are also serialized and made available to the Interactivity API stores in the client, allowing the application to continue functioning and manipulating the DOM dynamically.</p>\n<p>Let&#8217;s extend this example to include a button that the user can click to add a new fruit to the list:</p>\n<pre><code class=\"language-html\">&lt;button data-wp-on-async--click=\"actions.addMango\"&gt;Add Mango&lt;/button&gt;\n</code></pre>\n<p>This new button has a <code>data-wp-on-async--click</code> directive that references <code>actions.addMango</code>, which is defined in our JavaScript store:</p>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n    actions: {\n        addMango() {\n            state.fruits.push( 'Mango' );\n        },\n    },\n} );\n</code></pre>\n<p>The same example would also work if you were using local context:</p>\n<pre><code class=\"language-javascript\">store( 'myFruitPlugin', {\n    actions: {\n        addMango() {\n            const context = getContext();\n            context.fruits.push( 'Mango' );\n        },\n    },\n} );\n</code></pre>\n<p>Now, when the user clicks the &#8220;Add Mango&#8221; button:</p>\n<ol>\n<li>The <code>addMango</code> action is triggered.</li>\n<li>The <code>'Mango'</code> item is added to the <code>state.fruits</code> (or <code>context.fruits</code>) array.</li>\n<li>The Interactivity API automatically updates the DOM, adding a new <code>&lt;li&gt;</code> element for the new fruit.</li>\n</ol>\n<pre><code class=\"language-html\">&lt;ul&gt;\n    &lt;li&gt;Apple&lt;/li&gt;\n    &lt;li&gt;Banana&lt;/li&gt;\n    &lt;li&gt;Cherry&lt;/li&gt;\n    &lt;li&gt;Mango&lt;/li&gt;\n&lt;/ul&gt;\n</code></pre>\n<p>Remember: initializing the state on the client is not necessary when it has already been done on the server.</p>\n<pre><code class=\"language-javascript\">store( 'myFruitPlugin', {\n    state: {\n        fruits: [ 'Apple', 'Banana', 'Cherry' ], // This is not necessary!\n    },\n} );\n</code></pre>\n<h2>Initializing the derived state in the server</h2>\n<p>The derived state, regardless of whether it derives from the global state, local context, or both, can also be processed on the server by the Server Directive Processing.</p>\n<p><em>Please, visit the <a href=\"./undestanding-global-state-local-context-and-derived-state.md\">Understanding global state, local context and derived state</a> guide to learn more about how derived state works in the Interactivity API.</em></p>\n<h3>Derived state that can be defined statically</h3>\n<p>Let&#8217;s imagine adding a button that can delete all fruits:</p>\n<pre><code class=\"language-html\">&lt;button data-wp-on-async--click=\"actions.deleteFruits\"&gt;\n    Delete all fruits\n&lt;/button&gt;\n</code></pre>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n    actions: {\n        // ...\n        deleteFruits() {\n            state.fruits = [];\n        },\n    },\n} );\n</code></pre>\n<p>Now, let&#8217;s display a special message when there is no fruit. To do this, let&#8217;s use a <code>data-wp-bind--hidden</code> directive that references a derived state called <code>state.hasFruits</code> to show/hide the message.</p>\n<pre><code class=\"language-html\">&lt;div data-wp-interactive=\"myFruitPlugin\"&gt;\n    &lt;ul data-wp-bind--hidden=\"!state.hasFruits\"&gt;\n        &lt;template data-wp-each=\"state.fruits\"&gt;\n            &lt;li data-wp-text=\"context.item\"&gt;&lt;/li&gt;\n        &lt;/template&gt;\n    &lt;/ul&gt;\n    &lt;div data-wp-bind--hidden=\"state.hasFruits\"&gt;No fruits, sorry!&lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n<p>The derived state <code>state.hasFruits</code> is defined on the client using a getter:</p>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n    state: {\n        get hasFruits() {\n            return state.fruits.length &gt; 0;\n        },\n    },\n    // ...\n} );\n</code></pre>\n<p>Up to this point, everything is fine in the client, and when we press the &#8220;Delete all fruits&#8221; button, the &#8220;No fruits, sorry!&#8221; message will be displayed. The problem is that since <code>state.hasFruits</code> is not defined on the server, the <code>hidden</code> attribute will not be part of the initial HTML, which means it will also be showing the message until JavaScript loads, causing not only confusion to the visitor, but also a layout shift when JavaScript finally loads and the message is hidden.</p>\n<p>To fix this, you must define the initial value of the derived state in the server using <code>wp_interactivity_state</code>.</p>\n<ul>\n<li>When the initial value is known and static, it can be defined directly:\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  'fruits'    =&gt; array( 'Apple', 'Banana', 'Cherry' ),\n  'hasFruits' =&gt; true\n));\n</code></pre>\n</li>\n<li>Or it can be defined by doing the necessary computations:\n<pre><code class=\"language-php\">$fruits    = array( 'Apple', 'Banana', 'Cherry' );\n$hasFruits = count( $fruits ) &gt; 0;\n\nwp_interactivity_state( 'myFruitPlugin', array(\n  'fruits'    =&gt; $fruits,\n  'hasFruits' =&gt; $hasFruits,\n));\n</code></pre>\n</li>\n</ul>\n<p>Regardless of the approach, the key point is that the initial value of <code>state.hasFruits</code> is now defined on the server. This allows the Server Directive Processing to handle the <code>data-wp-bind--hidden</code> directive and modify the HTML markup, adding the <code>hidden</code> attribute when needed.</p>\n<h3>Derived state that needs to be defined dynamically</h3>\n<p>In most cases, the initial derived state can be defined statically, as in the previous example. But sometimes, the value depends on dynamic values that also change in the server, and the derived logic needs to be replicated in PHP.</p>\n<p>To see an example of this, let&#8217;s continue by adding a shopping cart emoji (🛒) for each fruit, depending on whether it is on a shopping list or not.</p>\n<p>First, let&#8217;s add an array that represents the shopping list. <em>Remember that even though these arrays are static for simplicity sake, usually you will work with dynamic information, for example, information coming from the database.</em></p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  'fruits'        =&gt; array( 'Apple', 'Banana', 'Cherry' ),\n  'shoppingList'  =&gt; array( 'Apple', 'Cherry' ),\n));\n</code></pre>\n<p>Now, let&#8217;s add a derived state on the client that checks if each fruit is on the shopping list or not and returns the emoji.</p>\n<pre><code class=\"language-javascript\">store( 'myFruitPlugin', {\n    state: {\n        get onShoppingList() {\n            const context = getContext();\n            return state.shoppingList.includes( context.item ) ? '🛒' : &apos;&apos;;\n        },\n    },\n    // ...\n} );\n</code></pre>\n<p>And let&#8217;s use that derived state to show the appropriate emoji for each fruit.</p>\n<pre><code class=\"language-html\">&lt;ul data-wp-interactive=\"myFruitPlugin\"&gt;\n    &lt;template data-wp-each=\"state.fruits\"&gt;\n        &lt;li&gt;\n            &lt;span data-wp-text=\"context.item\"&gt;&lt;/span&gt;\n            &lt;span data-wp-text=\"state.onShoppingList\"&gt;&lt;/span&gt;\n        &lt;/li&gt;\n    &lt;/template&gt;\n&lt;/ul&gt;\n</code></pre>\n<p>Again, up to this point, everything is fine on the client side and the visitor will see the correct emoji displayed for the fruits they have on their shopping list. However, since <code>state.onShoppingList</code> is not defined on the server, the emoji will not be part of the initial HTML, and it will not be shown until JavaScript loads.</p>\n<p>Let&#8217;s fix that by adding the initial derived state using <code>wp_interactivity_state</code>. Remember that this time, the value depends on <code>context.item</code> that comes from the <code>data-wp-each</code> directive, which makes the derived value dynamic, so let&#8217;s replicate the JavaScript logic in PHP:</p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  // ...\n  'onShoppingList' =&gt; function() {\n    $state   = wp_interactivity_state();\n    $context = wp_interactivity_get_context();\n    return in_array( $context['item'], $state['shoppingList'] ) ? '🛒' : &apos;&apos;;\n  }\n));\n</code></pre>\n<p>That&#8217;s it! Now, our server can compute the derived state and know which fruits are on the shopping list and which are not. This allows the Server Directive Processing to populate the initial HTML with the correct values, ensuring that the user sees the correct information immediately, even before the JavaScript runtime loads.</p>\n<h2>Serializing other processed values to be consumed on the client</h2>\n<p>The <code>wp_interactivity_state</code> function is also valuable for sending processed values from the server to the client so they can be consumed later on. This feature is useful in many situations, such as managing translations.</p>\n<p>Let&#8217;s add translations to our example to see how this would work.</p>\n<pre><code class=\"language-php\">&lt;?php\nwp_interactivity_state( 'myFruitPlugin', array(\n  'fruits'         =&gt; array( __( 'Apple' ), __( 'Banana' ), __( 'Cherry' ) ),\n  'shoppingList'   =&gt; array( __( 'Apple' ), __( 'Cherry' ) ),\n  // ...\n?&gt;\n\n&lt;div data-wp-interactive=\"myFruitPlugin\"&gt;\n  &lt;button data-wp-on-async--click=\"actions.deleteFruits\"&gt;\n    &lt;?php echo __( 'Delete all fruits' ); ?&gt;\n  &lt;/button&gt;\n  &lt;button data-wp-on-async--click=\"actions.addMango\"&gt;\n    &lt;?php echo __( 'Add Mango' ); ?&gt;\n  &lt;/button&gt;\n  &lt;ul data-wp-bind--hidden=\"!state.hasFruits\"&gt;\n    &lt;template data-wp-each=\"state.fruits\"&gt;\n      &lt;li&gt;\n        &lt;span data-wp-text=\"context.item\"&gt;&lt;/span&gt;\n        &lt;span data-wp-text=\"state.onShoppingList\"&gt;&lt;/span&gt;\n      &lt;/li&gt;\n    &lt;/template&gt;\n  &lt;/ul&gt;\n  &lt;div data-wp-bind--hidden=\"state.hasFruits\"&gt;\n    &lt;?php echo __( 'No fruits, sorry!' ); ?&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n<p>That&#8217;s it! Since the Interactivity API works in PHP, you can add translations directly to the global state, the local context and the HTML markup.</p>\n<p>But wait, what happens with our <code>addMango</code> action? Remember, this action is defined only on JavaScript:</p>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n    actions: {\n        addMango() {\n            state.fruits.push( 'Mango' ); // Not translated!\n        },\n    },\n} );\n</code></pre>\n<p>To fix this issue, you can use the <code>wp_interactivity_state</code> function to serialize the translated mango string and then access that value in your action.</p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  'fruits' =&gt; array( __( 'Apple' ), __( 'Banana' ), __( 'Cherry' ) ),\n  'mango'  =&gt; __( 'Mango' ),\n));\n</code></pre>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n    actions: {\n        addMango() {\n            // `state.mango` contains the 'Mango' string already translated.\n            state.fruits.push( state.mango );\n        },\n    },\n} );\n</code></pre>\n<p>Take into account that if your application is more dynamic, you could serialize an array with all the fruit translations and just work with <em>fruit keywords</em> in your actions. For example:</p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myFruitPlugin', array(\n  'fruits'           =&gt; array( 'apple', 'banana', 'cherry' ),\n  'translatedFruits' =&gt; array(\n    'apple'  =&gt; __( 'Apple' ),\n    'banana' =&gt; __( 'Banana' ),\n    'cherry' =&gt; __( 'Cherry' ),\n    'mango'  =&gt; __( 'Mango' ),\n  ),\n  'translatedFruit'  =&gt; function() {\n    $state   = wp_interactivity_state();\n    $context = wp_interactivity_get_context();\n    return $state['translatedFruits'][ $context['item'] ];\n  }\n));\n</code></pre>\n<pre><code class=\"language-javascript\">const { state } = store( 'myFruitPlugin', {\n  state: {\n    get translatedFruit() {\n      const context = getContext();\n      return state.translatedFruits[ context.item ];\n    }\n  }\n  actions: {\n    addMango() {\n      state.fruits.push( 'mango' );\n    },\n  },\n} );\n</code></pre>\n<pre><code class=\"language-html\">&lt;template data-wp-each=\"state.fruits\"&gt;\n    &lt;li data-wp-text=\"state.translatedFruit\"&gt;&lt;/li&gt;\n&lt;/template&gt;\n</code></pre>\n<p>Serializing information from the server can also be useful in other scenarios, such as passing Ajax/REST-API URLs and nonces.</p>\n<pre><code class=\"language-php\">wp_interactivity_state( 'myPlugin', array(\n  'ajaxUrl' =&gt; admin_url( 'admin-ajax.php' ),\n  'nonce'   =&gt; wp_create_nonce( 'myPlugin_nonce' ),\n));\n</code></pre>\n<pre><code class=\"language-js\">const { state } = store( 'myPlugin', {\n    actions: {\n        *doSomething() {\n            const formData = new FormData();\n            formData.append( 'action', 'do_something' );\n            formData.append( '_ajax_nonce', state.nonce );\n\n            const data = yield fetch( state.ajaxUrl, {\n                method: 'POST',\n                body: formData,\n            } ).then( ( response ) =&gt; response.json() );\n\n            console.log( 'Server data', data );\n        },\n    },\n} );\n</code></pre>\n<h2>Processing directives in classic themes</h2>\n<p>Server Directive Processing happens automatically in your interactive blocks as soon as you add <code>supports.interactivity</code> to your <code>block.json</code> file. But what about classic themes?</p>\n<p>Classic themes can also use the Interactivity API, and if they want to take advantage of the Server Directive Processing (which they should), they can do so through the <code>wp_interactivity_process_directives</code> function. This function receives the HTML markup with unprocessed directives and returns the HTML markup modified according to the initial values of the global state, local context, and derived state.</p>\n<pre><code class=\"language-php\">// Initializes the global and derived state…\nwp_interactivity_state( '...', /* ... */ );\n\n// The interactive HTML markup that contains the directives.\n$html = '&lt;div data-wp-...&gt;...&lt;/div&gt;';\n\n// Processes the directives so they are ready to be sent to the client.\n$processed_html = wp_interactivity_process_directives( $html );\n</code></pre>\n<p>That&#8217;s it! There&#8217;s nothing else you need to do.</p>\n<p>If you want to use <code>wp_interactivity_process_directives</code> in a template file, you can use <code>ob_start</code> and <code>ob_get_clean</code> to capture the HTML output and process it before rendering.</p>\n<pre><code class=\"language-php\">&lt;?php\nwp_interactivity_state( 'myClassicTheme', /* ... */ );\nob_start();\n?&gt;\n\n&lt;div data-wp-interactive=\"myClassicTheme\"&gt;\n  ...\n&lt;/div&gt;\n\n&lt;?php\n$html = ob_get_clean();\necho wp_interactivity_process_directives( $html );\n</code></pre>\n<p><strong>Important:</strong> You only need to process the directives once. If you&#8217;re including an inner template file within another template, ensure that <code>wp_interactivity_process_directives</code> is only called in the outermost template file to avoid redundant processing.</p>\n<h2>Conclusion</h2>\n<p>The Interactivity API ensures a smooth and transparent transition from server-rendered content to client-side interactivity. The directives you define on the server, the initial global state or local context, and the client-side behavior all form part of the same ecosystem. This unified approach simplifies development, improves maintainability, and provides a better developer experience when creating interactive WordPress blocks.</p>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 154868,
    "menu_order": 87,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-154871",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/154871",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 3,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/154871/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 154904,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/154871/revisions/154904"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/154868"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=154871"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}