{
    "id": 135104,
    "date": "2021-03-10T02:39:47",
    "date_gmt": "2021-03-10T02:39:47",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/contributors/code/release/"
    },
    "modified": "2025-04-22T07:00:40",
    "modified_gmt": "2025-04-22T07:00:40",
    "slug": "release",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/contributors/code/release/",
    "title": {
        "rendered": "Gutenberg Release Process"
    },
    "content": {
        "rendered": "<p>The <a href=\"https://github.com/WordPress/gutenberg\">Gutenberg repository</a> on GitHub is used to perform several types of releases. This document serves as a checklist for each of these releases, and it can help you understand the different workflows involved.</p>\n<p>Before you begin, there are some requirements that must be met in order to successfully release a stable version of the Gutenberg plugin. You will need to:</p>\n<ul>\n<li>Be a member of the <a href=\"https://developer.wordpress.org/block-editor/block-editor/contributors/repository-management/#teams\">Gutenberg development team</a>. This gives you the ability to launch the GitHub actions that are related to the release process and to backport pull requests (PRs) to the release branch.</li>\n<li>Have write permissions on the <a href=\"https://make.wordpress.org/core\">Make WordPress Core</a> blog. This allows you to draft the release post.</li>\n<li>Obtain approval from a member of the Gutenberg Core team in order to upload the new version Gutenberg to the WordPress.org plugin directory.</li>\n</ul>\n<p>Similar requirements apply to releasing WordPress&#8217;s <a href=\"https://developer.wordpress.org/block-editor/contributors/code/release/#packages-releases-to-npm-and-wordpress-core-updates\">npm packages</a>.</p>\n<h2>Gutenberg plugin releases</h2>\n<p>The first step in releasing a stable version of the Gutenberg plugin is to <a href=\"https://github.com/WordPress/gutenberg/issues/new?assignees=&amp;labels=&amp;projects=&amp;template=New_release.md\">create an issue</a> in the Gutenberg repository. The issue template is called &#8220;Gutenberg Release,&#8221; and it contains a checklist for the complete release process, from release candidate to changelog curation to cherry-picking, stable release, and release post. The issue for <a href=\"https://github.com/WordPress/gutenberg/issues/50092\">Gutenberg 15.7</a> is a good example.</p>\n<p>The checklist helps you coordinate with developers and other teams involved in the release process. It ensures that all of the necessary steps are completed and that everyone is aware of the schedule and important milestones.</p>\n<h3>Release schedule</h3>\n<p>A new major version of Gutenberg is released approximately every two weeks. The current and next versions are tracked in <a href=\"https://github.com/WordPress/gutenberg/milestones\">GitHub milestones</a>, along with the date when each version will be tagged.</p>\n<p><strong>On the date of the current milestone</strong>, also called the tagging date, the first release candidate (RC) of Gutenberg is published. This is a pre-release version of the plugin that is made available for testing by plugin authors and users. If any regressions are found, a new RC can be published.</p>\n<p>Release candidates are versioned incrementally, starting with <code>-rc.1</code>, then <code>-rc.2</code>, and so on. As soon as the first RC (RC1) is published, preparation for the release post begins.</p>\n<p><strong>One week after the RC1</strong>, the stable version is created based on the last RC and any necessary regression fixes. Once the stable version is released, the release post is published.</p>\n<p>If critical bugs are discovered in stable versions of the plugin, patch versions can be released at any time.</p>\n<h3>Release management</h3>\n<p>Each major Gutenberg release is run by a release manager, also known as a release lead. This individual, or small team of individuals, is responsible for the release of Gutenberg with support from the broader <a href=\"https://developer.wordpress.org/block-editor/block-editor/contributors/repository-management/#teams\">Gutenberg development team</a>.</p>\n<p>The release manager is responsible for initiating all release activities, and their approval is required for any changes to the release plan. In the event of an emergency or if the release manager is unavailable, other team members may take appropriate action, but they should keep the release manager informed.</p>\n<div class=\"callout callout-tip\">\nIf you are a member of the <a href=\"https://developer.wordpress.org/block-editor/block-editor/contributors/repository-management/#teams\">Gutenberg development team</a> and are interested in leading a Gutenberg release, reach out in the <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> Slack channel.</div>\n<h3>Preparing a release</h3>\n<p>The plugin release process is mostly automated and happens on GitHub. You do not need to run any steps locally on your machine. However, it’s a good idea to have a local copy of Gutenberg for changelog preparation, general testing, and in case multiple release candidates are required. But more on that later.</p>\n<p>Here is an <a href=\"https://youtu.be/TnSgJd3zpJY\">11-minute video</a> that demonstrates the plugin release process. If you are unfamiliar with the process, we recommend watching the video first. The process is also documented in the following paragraphs, which provide more detailed instructions.</p>\n<h4>Organizing and labeling milestone PRs</h4>\n<div class=\"callout callout-info\">\n    <strong>Quick reference</strong></p>\n<ul>\n<li>Ensure all PRs are properly labeled.</li>\n<li>Each PR must have one label prefixed by <code>[Type]</code>.</li>\n</ul>\n</div>\n<p>The first step in preparing a Gutenberg release is to organize all PRs assigned to the current <a href=\"https://github.com/WordPress/gutenberg/milestones\">milestone</a> and ensure that each is properly labeled. <a href=\"https://github.com/WordPress/gutenberg/labels\">Labels</a> are used to automatically generate the changelog, and changing the labels on PRs is much faster than reorganizing an existing changelog in the release section afterward.</p>\n<p>To test the changelog automation that will be run as part of the release workflow, you can use the following command in your local copy of Gutenberg using the milestone of the stable release version you are working on:</p>\n<pre><code>npm run other:changelog -- --milestone=\"Gutenberg 16.2\"\n</code></pre>\n<p>The output of this command is the changelog for the provided milestone, which in the above example is Gutenberg 16.2. You can copy and paste the output into a Markdown document, which will make it easier to view and allow you to follow the links to each PR.</p>\n<p>All PRs should have a label prefixed by <code>[Type]</code> as well as labels for sub-categories. The two most common labels are <code>[Type] Bug</code> and <code>[Type] Enhancement</code>. When reviewing the generated changelog, pay close attention to the following:</p>\n<ul>\n<li><strong>Enhancements:</strong> Look for PRs that don&#8217;t have any subcategories attached.</li>\n<li><strong>Bug fixes:</strong> Also look for PRs that don&#8217;t have any subcategories attached.</li>\n<li><strong>Various:</strong> PRs in this section don&#8217;t have any labels at all.</li>\n</ul>\n<p>Update the labels on each PR as needed. You can continue generating the changelog until you are comfortable proceeding. Now you are ready to start the release candidate workflow.</p>\n<div class=\"callout callout-tip\">\nYou can see how the changelog is generated from the PR labels in the <a href=\"https://github.com/WordPress/gutenberg/blob/trunk/bin/plugin/commands/changelog.js\">changelog.js</a> file.\n</div>\n<h4>Running the release workflow</h4>\n<div class=\"callout callout-info\">\n    <strong>Quick reference</strong></p>\n<ul>\n<li>\n            Announce in <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> that you are about to start the release workflow.\n        </li>\n<li>\n            Run the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">Build Gutenberg Plugin Zip</a> workflow.\n        </li>\n</ul>\n</div>\n<p>Before you begin, announce in <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> Slack channel that you are about to start the workflow and indicate whether you are releasing a stable version of Gutenberg or an RC.</p>\n<p>Then go to the Gutenberg repository, click on the Actions tab, and then locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">Build Gutenberg Plugin Zip</a> action. Note the blue banner that says, “This workflow has a <code>workflow_dispatch</code> event trigger.” Expand the “Run workflow” dropdown on its right-hand side.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-3-1.png?ssl=1\" alt=\"Run workflow dropdown for the plugin release\" /></p>\n<p>To release an RC version of the plugin, enter <code>rc</code>in the text field. To release a stable version, enter <code>stable</code>. In each case, press the button “Run workflow”.</p>\n<p>This will trigger a GitHub Actions (GHA) workflow that will bump the plugin version, build the Gutenberg plugin <code>.zip</code> file, create a release draft, and attach the plugin <code>.zip</code> file. This part of the process typically takes about six minutes. The workflow will appear at the top of the list, right under the blue banner. Once it is finished, the workflow&#8217;s status icon will change from a yellow dot to a green checkmark. You can follow along for a more detailed view by clicking on the workflow.</p>\n<h4>Publishing the @wordpress packages to NPM</h4>\n<p>As part of the release workflow, all of the @wordpress packages are published to NPM. After the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">Build Gutenberg Plugin Zip</a> action has created the draft release, you may see a message that the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">Publish npm packages</a> action requires someone with appropriate permissions to trigger it.</p>\n<p>This message is misleading. You do not need to take any action to publish the @wordpress packages to NPM. The process is automated and will automatically run after the release notes are published.</p>\n<h4>Viewing the release draft</h4>\n<p>As soon as the workflow has finished, you’ll find the release draft under <a href=\"https://github.com/WordPress/gutenberg/releases\">Gutenberg Releases</a>. The draft is pre-populated with changelog entries based on previous RCs for this version and any changes that have since been cherry-picked to the release branch. Thus, when releasing the first stable version of a series, delete any RC version headers (that are only there for your information) and move the more recent changes to the correct section (see below).</p>\n<h4>Curating the release changelog</h4>\n<p>The best time to work on the changelog is when it is first created during the release candidate workflow. This is when the changelog automation is called, and the first version of the changelog becomes available. The changelog process is mostly automated, but it depends heavily on the proper labeling of the PRs in the milestone, as mentioned above.</p>\n<p>The stable release process takes the changelogs of the RCs and adds them to the stable release. However, there is one important thing to note: the stable release only &#8220;remembers&#8221; the first version of the changelog, which is the version that was available when RC1 was published. Any subsequent changes to the changelog of RC1 will not be included in the stable release.</p>\n<p>That means if you curate the whole changelog before you publish RC1, you won’t have to work on it for the stable release, except for the few items of subsequent RC2 or RC3 releases that will also be added to the stable release.</p>\n<p>Once the release changelog is available in the draft, take some time to read the notes and edit them to make sure they are easy to read and accurate. Don&#8217;t rush this part. It&#8217;s important to make sure the release notes are as organized as possible, but you don&#8217;t have to finish them all at once. You can save the draft and come back to it later.</p>\n<p>If you&#8217;re worried that people won&#8217;t be able to access the release candidate version until you publish the release, you can share the release artifact with the <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> Slack channel. This will give people access to the release candidate version while you finish curating the changelog.</p>\n<p>Here are some additional tips for preparing clear and concise changelogs:</p>\n<ul>\n<li>Move all entries under the <code>Various</code> section to a more appropriate section.</li>\n<li>Fix spelling errors or clarify wording. Phrasing should be easy to understand where the intended audience is those who use the plugin or are keeping up with ongoing development.</li>\n<li>Create new groupings as applicable, and move pull requests between.</li>\n<li>When multiple PRs relate to the same task (such as a follow-up pull request), try to combine them into a single entry. Good examples for this are PRs around removing Lodash for performance purposes, replacement of Puppeteer E2D tests with Playwright or efforts to convert public components to TypeScript.</li>\n<li>If subtasks of a related set of PRs are substantial, consider organizing as entries in a nested list.</li>\n<li>Remove PRs that revert other PRs in the same release if the net change in code is zero.</li>\n<li>Remove all PRs that only update the mobile app. The only exception to this rule is if the mobile app pull request also updates functionality for the web.</li>\n<li>If a subheader only has one PR listed, remove the subheader and move the PR to the next matching subheader with more than one item listed.</li>\n</ul>\n<h4>Creating release candidate patches (cherry-picking)</h4>\n<div class=\"callout callout-info\">\n    <strong>Quick reference</strong></p>\n<ul>\n<li>Ensure all PRs that need cherry-picking have the <code>Backport to Gutenberg RC</code> label.</li>\n<li>In your local clone of the Gutenberg repository, switch to the release branch: <code>git checkout release/X.Y</code></li>\n<li>Cherry-pick all merged PRs using the automated script: </code>npm run other:cherry-pick &#8220;Backport to Gutenberg RC&#8221;</code></li>\n</ul>\n</div>\n<p>After an RC is published but before the final stable release, some bugs related to the release might be fixed and committed to <code>trunk</code>. The stable release will not automatically include these fixes. Including them is a manual process, which is called cherry-picking.</p>\n<p>There are a couple of ways you might be made aware of these bugs as a release manager:</p>\n<ul>\n<li>Contributors may add the <code>Backport to Gutenberg RC</code> label to a closed PR. <a href=\"https://github.com/WordPress/gutenberg/pulls?q=is%3Apr+label%3A%22Backport+to+Gutenberg+RC%22+is%3Aclosed\">Do a search for any of these PRs</a> before publishing the final release.</li>\n<li>You may receive a direct message or a ping in the <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> Slack channel notifying you of PRs that need to be included in the RC. Even when this is the case, the <code>Backport to Gutenberg RC</code> should always be added to the PR.</li>\n</ul>\n<h5>Automated cherry-picking</h5>\n<p>The cherry-picking process can be automated with the <code>npm run other:cherry-pick \"[Insert Label]\"</code> script, which is included in Gutenberg. You will need to use the label <code>Backport to Gutenberg RC</code> when running the command and ensure all PRs that need cherry-picking have the label assigned.</p>\n<div class=\"callout callout-warning\">\nTo cherry-pick PRs, you must clone (not fork) the Gutenberg repository and have write access. Only members of the <a href=\"https://developer.wordpress.org/block-editor/block-editor/contributors/repository-management/#teams\">Gutenberg development team</a> have the necessary permissions to perform this action.</div>\n<p>Once you have cloned the Gutenberg repository to your local development environment, begin by switching to the release branch:</p>\n<pre><code>git checkout release/X.Y\n</code></pre>\n<p>Next, cherry-pick all the merged PRs with the appropriate backport label:</p>\n<pre><code>npm run other:cherry-pick \"Backport to Gutenberg RC\"\n</code></pre>\n<p>Behind the scenes, the script will:</p>\n<ul>\n<li>Cherry-pick all PRs with the label <code>Backport to Gutenberg RC</code></li>\n<li>Add them to the release milestone</li>\n<li><code>git push</code> all changes to the release branch</li>\n<li>Add a comment to the PR indicating it’s been cherry-picked</li>\n<li>Remove the label <code>Backport to Gutenberg RC</code> from the PR</li>\n</ul>\n<p>Here is a screenshot of the process:</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-7.png?ssl=1\" alt=\"Automated cherry-picking\" /></p>\n<h5>Manual cherry-picking</h5>\n<p>If you need to handle cherry-picking one at a time and one step at a time, you can follow this sequence manually. After checking out the corresponding release branch:</p>\n<ol>\n<li>Cherry-pick each PR (in chronological order) using <code>git cherry-pick [SHA]</code>.</li>\n<li>When done, push the changes to GitHub using <code>git push</code>.</li>\n<li>Remove the <code>Backport to Gutenberg RC</code> label and update the milestone to the current release for all cherry-picked PRs.</li>\n</ol>\n<p>To find the <code>[SHA]</code> for a pull request, open the PR, and you’ll see a message “<code>[Username]</code> merged commit <code>[SHA]</code> into <code>trunk</code>” near the end.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-5.png?ssl=1\" alt=\"Manual cherry-picking\" /></p>\n<p>If the cherry-picked fixes deserve another release candidate before the stable version is published, create one by following the instructions above. Let other contributors know that a new release candidate has been released in the <a href=\"https://wordpress.slack.com/messages/C02QB2JS7\">#core-editor</a> Slack channel.</p>\n<h4>Publishing the release</h4>\n<div class=\"callout callout-info\">\n    <strong>Quick reference</strong></p>\n<ul>\n<li>In the release draft, press the “Publish release” button.</li>\n<li>If publishing a stable release, get approval from a member of the <a href=\"https://github.com/orgs/WordPress/teams/gutenberg-release\">Gutenberg Release</a>, <a href=\"https://github.com/orgs/WordPress/teams/gutenberg-core\">Gutenberg Core</a>, or the <a href=\"https://github.com/orgs/WordPress/teams/wordpress-core\">WordPress Core</a> teams to upload the new plugin version to the WordPress.org plugin repository (SVN).</li>\n<li>Once uploaded, confirm that the latest version can be downloaded and updated from the WordPress plugin dashboard.</li>\n</ul>\n</div>\n<p>Only once you’re happy with the shape of the changelog in the release draft, press the “Publish release” button.</p>\n<p>Note that you do not need to change the checkboxes above the button. If you are publishing an RC, the “Set as a pre-release” will automatically be selected, and “Set as the latest release” will be selected if you are publishing the stable version.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image.png?ssl=1\" alt=\"Publishing the release checkboxes for an RC\" /></p>\n<p>Publishing the release will create a <code>git</code> tag for the version, publish the release, and trigger <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/upload-release-to-plugin-repo.yml\">another GHA workflow</a> with a twofold purpose:</p>\n<ol>\n<li>Use the release notes that you just edited to update <code>changelog.txt</code>, and</li>\n<li>Upload the new plugin version to the WordPress.org plugin repository (SVN) (only if you’re releasing a stable version).</li>\n</ol>\n<p>The last step needs approval by a member of either the <a href=\"https://github.com/orgs/WordPress/teams/gutenberg-release\">Gutenberg Release</a>, <a href=\"https://github.com/orgs/WordPress/teams/gutenberg-core\">Gutenberg Core</a>, or the <a href=\"https://github.com/orgs/WordPress/teams/wordpress-core\">WordPress Core</a> teams. These teams get a notification email when the release is ready to be approved, but if time is of the essence, you can ask in the #core-editor Slack channel or ping the <a href=\"https://github.com/orgs/WordPress/teams/gutenberg-release\">Gutenberg Release team</a>) to accelerate the process. Reaching out before launching the release process so that somebody is ready to approve is recommended. Locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/upload-release-to-plugin-repo.yml\">“Upload Gutenberg plugin to WordPress.org plugin repo” workflow</a> for the new version, and have it <a href=\"https://docs.github.com/en/actions/managing-workflow-runs/reviewing-deployments#approving-or-rejecting-a-job\">approved</a>.</p>\n<p>Once approved, the new Gutenberg version will be available to WordPress users all over the globe. Once uploaded, confirm that the latest version can be downloaded and updated from the WordPress plugin dashboard.</p>\n<p>The final step is to write a release post on <a href=\"https://make.wordpress.org/core/\">make.wordpress.org/core</a>. You can find some tips on that below.</p>\n<h3>Troubleshooting the release</h3>\n<blockquote><p>\n  The plugin was published to the WordPress.org plugin directory but the workflow failed.\n</p></blockquote>\n<p>This has happened occasionally, see <a href=\"https://github.com/WordPress/gutenberg/actions/runs/6955409957/job/18924124118\">this one</a> for example.</p>\n<p>It&#8217;s important to check that:</p>\n<ul>\n<li>the plugin from the directory works as expected</li>\n<li>the ZIP contents (see <a href=\"https://plugins.trac.wordpress.org/browser/gutenberg/\">Downloads</a>) looks correct (doesn&#8217;t have anything obvious missing)</li>\n<li>the <a href=\"https://plugins.trac.wordpress.org/browser/gutenberg/\">Gutenberg SVN repo</a> has two new commits (see <a href=\"https://plugins.trac.wordpress.org/browser/gutenberg/\">the log</a>):\n<ul>\n<li>the <code>trunk</code> folder should have &#8220;Committing version X.Y.Z&#8221;</li>\n<li>there is a new <code>tags/X.Y.Z</code> folder with the same contents as <code>trunk</code> whose latest commit is &#8220;Tagging version X.Y.Z&#8221;</li>\n</ul>\n</li>\n</ul>\n<p>Most likely, the tag folder couldn&#8217;t be created. This is a <a href=\"https://plugins.trac.wordpress.org/browser/gutenberg/\">known issue</a> that <a href=\"https://github.com/WordPress/gutenberg/issues/55295#issuecomment-1759292978\">can be fixed manually</a>.</p>\n<p>Either substitute SVN_USERNAME, SVN_PASSWORD, and VERSION for the proper values or set them as global environment variables first:</p>\n<pre><code class=\"language-sh\"># CHECKOUT THE REPOSITORY\nsvn checkout https://plugins.svn.wordpress.org/gutenberg/trunk --username \"$SVN_USERNAME\" --password \"$SVN_PASSWORD\" gutenberg-svn\n\n# MOVE TO THE LOCAL FOLDER\ncd gutenberg-svn\n\n# IF YOU HAPPEN TO HAVE ALREADY THE REPO LOCALLY\n# AND DIDN'T CHECKOUT, MAKE SURE IT IS UPDATED\n# svn up .\n\n# COPY CURRENT TRUNK INTO THE NEW TAGS FOLDER\nsvn copy https://plugins.svn.wordpress.org/gutenberg/trunk https://plugins.svn.wordpress.org/gutenberg/tags/$VERSION -m 'Tagging version $VERSION' --no-auth-cache --non-interactive  --username \"$SVN_USERNAME\" --password \"$SVN_PASSWORD\"\n</code></pre>\n<p>Ask around if you need help with any of this.</p>\n<h3>Documenting the release</h3>\n<p>Documenting the release is led by the release manager with the help of <a href=\"https://developer.wordpress.org/block-editor/block-editor/contributors/repository-management/#teams\">Gutenberg development team</a> members. This process is comprised of a series of sequential steps that, because of the number of people involved, and the coordination required, need to adhere to a timeline between the RC and stable releases. Stable Gutenberg releases happen on Wednesdays, one week after the initial RC.</p>\n<div class=\"callout callout-info\">\n    <strong>Timeline</strong></p>\n<ol>\n<li>Make a copy of the <a href=\"https://docs.google.com/document/d/1D-MTOCmL9eMlP9TDTXqlzuKVOg_ghCPm9_whHFViqMk/edit\">Google Doc Template for release posts</a> – Wednesday to Friday</li>\n<li>Select the release highlights – Friday to Monday</li>\n<li>Request release assets (images, videos) from the Design team once highlights are finalized – Friday to Monday</li>\n<li>Draft the release post and request peer review – Monday to Wednesday</li>\n<li>Publishing the post after the stable version is released – Wednesday</li>\n</ol>\n</div>\n<h4>Selecting the release highlights</h4>\n<p>Once the changelog is cleaned up, the next step is to choose a few changes to highlight in the release post. These highlights usually focus on new features and enhancements, including performance and accessibility ones, but can also include important API changes or critical bug fixes.</p>\n<p>Given the big scope of Gutenberg and the high number of PRs merged in each milestone, it is not uncommon to overlook impactful changes worth highlighting; because of this, this step is a collaborative effort between the release manager and other Gutenberg development team members. If you don’t know what to pick, reach out to others on the team for assistance.</p>\n<h4>Requesting release assets</h4>\n<p>After identifying the highlights of a new WordPress release, the release manager requests visual assets from the Design team. The request is made in the <a href=\"https://wordpress.slack.com/archives/C02S78ZAL\">#design</a> Slack channel, and an example post for 15.8 can be found <a href=\"https://wordpress.slack.com/archives/C02S78ZAL/p1684161811926279\">here</a>. The assets will be provided in a <a href=\"https://drive.google.com/drive/folders/1U8bVbjOc0MekWjpMjNaVFVhHFEzQkYLB\">Google Drive folder</a> assigned to the specific release.</p>\n<p>When creating visual assets for a WordPress release, use animations (video or GIF) or static images to showcase the highlights. Use <a href=\"https://make.wordpress.org/core/tag/gutenberg-new/\">previous release posts</a> as a guide, and keep in mind that animations are better for demonstrating workflows, while more direct highlights can be shown with an image. When creating assets, avoid using copyrighted material and disable browser plugins that can be seen in the browser canvas.</p>\n<h4>Drafting the release post</h4>\n<p>The release manager is responsible for drafting the release post based on the <a href=\"https://docs.google.com/document/d/1D-MTOCmL9eMlP9TDTXqlzuKVOg_ghCPm9_whHFViqMk/edit\">Google Doc Template</a>. That said, because of the nature of the release post content, responsibilities can be divided up and delegated to other team members if agreed upon in advance. Once the draft is complete, ask for peer review.</p>\n<h4>Publishing the release post</h4>\n<p>Once the post content is ready, an author with permission to post on <a href=\"https://make.wordpress.org/core/\">make.wordpress.org/core</a> will create a new draft and import the content. The post should include the following tags:</p>\n<ul>\n<li><a href=\"https://make.wordpress.org/core/tag/block-editor/\">#block-editor</a></li>\n<li><a href=\"https://make.wordpress.org/core/tag/core-editor/\">#core-editor</a></li>\n<li><a href=\"https://make.wordpress.org/core/tag/gutenberg/\">#gutenberg</a></li>\n<li><a href=\"https://make.wordpress.org/core/tag/gutenberg-new/\">#gutenberg-new</a></li>\n</ul>\n<p>The author should then enable public preview on the post and ask for a final peer review. This is encouraged by the <a href=\"https://make.wordpress.org/core/handbook/best-practices/post-comment-guidelines/#peer-review\">make/core posting guidelines</a>.</p>\n<p>Finally, the post should be published after the stable version is released and is available on WordPress.org. This will help external media to echo and amplify the release.</p>\n<h3>Creating minor releases</h3>\n<p>Occasionally it&#8217;s necessary to create a minor release (i.e. X.Y.<strong>Z</strong>) of the Plugin. This is usually done to expedite fixes for bad regressions or bugs. The <code>Backport to Gutenberg Minor Release</code> is usually used to identify PRs that need to be included in a minor release, but as release coordinator you may also be notified more informally through slack. Even so, it&#8217;s good to ensure all relevant PRs have the correct label.</p>\n<p>As you proceed with the following process, it&#8217;s worth bearing in mind that such minor releases are not created as branches in their own right (e.g. <code>release/12.5.0</code>) but are simply <a href=\"https://github.com/WordPress/gutenberg/releases/tag/v12.5.1\">tags</a>.</p>\n<p>The method for minor releases is nearly identical to the main Plugin release process (see above) but has some notable exceptions. Please make sure to read <em>the entire</em> guide before proceeding.</p>\n<h4>Updating the release branch</h4>\n<p>The minor release should only contain the <em>specific commits</em> required. To do this you should checkout the previous <em>major</em> stable (i.e. non-RC) release branch (e.g. <code>release/12.5</code>) locally and then cherry pick any commits that you require into that branch.</p>\n<div class=\"callout callout-alert\">\nIf an RC already exists for a new version, you _need_ to cherry-pick the same commits in the respective release branch, as they will not be included automatically. E.g.: If you&#8217;re about to release a new minor release for 12.5 and just cherry-picked into `release/12.5`, but 12.6.0-rc.1 is already out, then you need to cherry-pick the same commits into the `release/12.6` branch, or they won&#8217;t be included in subsequent releases for 12.6! Usually it&#8217;s best to coordinate this process with the release coordinator for the next release.\n</div>\n<p>The cherry-picking process can be automated with the <a href=\"https://developer.wordpress.org/block-editor/contributors/code/auto-cherry-picking/\"><code>npm run cherry-pick</code></a> script, but be sure to use the <code>Backport to Gutenberg Minor Release</code> label when running the script.</p>\n<p>You must also ensure that all PRs being included are assigned to the GitHub Milestone on which the minor release is based. Bear in mind, that when PRs are <em>merged</em> they are automatically assigned a milestone for the next <em>stable</em> release. Therefore you will need to go back through each PR in GitHub and re-assign the Milestone.</p>\n<p>For example, if you are releasing version <code>12.5.4</code>, then all PRs picked for that release must be unassigned from the <code>12.6</code> Milestone and instead assigned to the <code>12.5</code> Milestone.</p>\n<p>Once cherry picking is complete, you can also remove the <code>Backport to Gutenberg Minor Release</code> label from the PRs.</p>\n<p>Once you have the stable release branch in order and the correct Milestone assigned to your PRs you can <em>push the branch to GitHub</em> and continue with the release process using the GitHub website GUI.</p>\n<h4>Running the minor release</h4>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-1.png?ssl=1\" alt=\"Run workflow dropdown for the plugin release\" /></p>\n<p>Go to Gutenberg&#8217;s GitHub repository&#8217;s Actions tab, and locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">&#8220;Build Gutenberg Plugin Zip&#8221; action</a>. You should now <em>carefully</em> choose the next action based on information about the current Plugin release version:</p>\n<p><em>If</em> the previous release version was <strong>stable</strong> (<code>X.Y.Z</code> &#8211; e.g. <code>12.5.0</code>, <code>12.5.1</code> .etc) leave the <code>Use workflow from</code> field as <code>trunk</code> and then specify <code>stable</code> in the text input field. The workflow will automatically create a minor release, with z incremented (<code>x.y.(z+1)</code>) as required.</p>\n<p><em>If</em> however, the previous release was an <strong>RC</strong> (e.g. <code>X.Y.0-rc.1</code>) you will need to <em>manually</em> select the <em>stable version&#8217;s release branch</em> (e.g. <code>12.5.0</code>) when creating the release. Failure to do this will cause the workflow to release the next major <em>stable</em> version (e.g. <code>12.6.0</code>) which is not what you want.</p>\n<p>To do this, when running the Workflow, select the appropriate <code>release/</code> branch from the <code>Use workflow from</code> dropdown (e.g. <code>release/12.5</code>) and specify <code>stable</code> in the text input field.</p>\n<h5>Creating a minor release for previous stable releases</h5>\n<p>It is possible to create a minor release for any release branch even after a more recent stable release has been published. This can be done for <em>any</em> previous release branches, allowing more flexibility in delivering updates to users. In the past, users had to wait for the next stable release, potentially taking days. Now, fixes can be swiftly shipped to any previous release branches as required.</p>\n<p>The process is identical to the one documented above when an RC is already out: choose a previous release branch, type <code>stable</code>, and click &#8220;Run workflow&#8221;. The release will be published on the GitHub releases page for Gutenberg and to the WordPress core repository SVN as a <code>tag</code> under https://plugins.svn.wordpress.org/gutenberg/tags/. The SVN <code>trunk</code> directory will not be touched.</p>\n<p><strong>IMPORTANT:</strong> When publishing the draft created by the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">&#8220;Build Plugin Zip&#8221; workflow</a>, make sure to leave the &#8220;Set as last release&#8221; checkbox unchecked. If it is left checked by accident, the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/upload-release-to-plugin-repo.yml\">&#8220;Upload Gutenberg plugin to WordPress.org plugin&#8221; workflow</a> will still correctly upload it <strong>as a tag (and will <em>not</em> replace the <code>trunk</code> version)</strong> to the WordPress plugin repository SVN &#8211; the workflow will perform some version arithmetic to determine how the plugin should be shipped &#8211; but you&#8217;ll still need to fix the state on GitHub by setting the right release as <code>latest</code> on the <a href=\"https://github.com/WordPress/gutenberg/releases/\">releases</a> page!</p>\n<h4>Troubleshooting</h4>\n<blockquote><p>\n  The release draft was created but it was empty/contained an error message\n</p></blockquote>\n<p>If you forget to assign the correct Milestone to your cherry picked PR(s) then the changelog may not be generated as you would expect.</p>\n<p>It is important to always manually verify that the PRs shown in the changelog match up with those cherry picked to the release branch.</p>\n<p>Moreover, if the release includes only a single PR, then failing to assign the PR to the correct Milestone will cause an error to be displayed when generating the changelog. In this case you can edit the release notes to include details of the missing PR (manually copying the format from a previous release).</p>\n<p>If for any reason the Milestone has been closed, you may reopen it for the purposes of the release.</p>\n<blockquote><p>\n  The draft release only contains 1 asset file. Other releases have x3.\n</p></blockquote>\n<p>This is expected. The draft release will contain only the plugin zip. Only once the release is published will the remaining assets be generated and added to the release.</p>\n<blockquote><p>\n  Do I need to publish point releases to WordPress.org?\n</p></blockquote>\n<p>Yes. The method for this is identical to the main Plugin release process. You will need a member of the Gutenberg Core team the Gutenberg Release team to approve the release workflow.</p>\n<blockquote><p>\n  The release process failed to cherry-pick version bump commit to the trunk branch.\n</p></blockquote>\n<p>First, confirm that the step failed by checking the latest commits on <code>trunk</code> do not include the version bump commit. Then revert the version bump commit on the release branch &#8211; <code>git revert --no-edit {commitHash}</code>. Finally, push the changes and start the release process again.</p>\n<h2>Packages releases to NPM and WordPress Core updates</h2>\n<p>The Gutenberg repository follows the <a href=\"https://make.wordpress.org/core/handbook/about/release-cycle/\">WordPress SVN repository&#8217;s</a> branching strategy for every major WordPress release. In addition to that, it also contains two other special branches that control npm publishing workflows:</p>\n<ul>\n<li>The <code>wp/latest</code> branch contains the same version of packages as those published to npm with the <code>latest</code> distribution tag. The goal here is to have this branch synchronized with the last Gutenberg plugin release, and the only exception would be an unplanned <a href=\"#standalone-bugfix-package-releases\">bugfix release</a>.</li>\n<li>The <code>wp/next</code> branch contains the same version of packages as those published to npm with the <code>next</code> distribution tag. It always gets synchronized with the <code>trunk</code> branch. Projects should use those packages for development or testing purposes only.</li>\n<li>A Gutenberg branch <code>wp/X.Y</code> (example <code>wp/6.2</code>) targeting a specific WordPress major release (including its further minor increments) gets created based on the current Gutenberg plugin release branch <code>release/X.Y</code> (example <code>release/15.1</code>) shortly after the last release planned for inclusion in the next major WordPress release.</li>\n</ul>\n<p>Release types and their schedule:</p>\n<ul>\n<li><a href=\"#synchronizing-gutenberg-plugin\">Synchronizing Gutenberg Plugin</a> (<code>latest</code> dist tag) – publishing happens automatically every two weeks based on the newly created <code>release/X.Y</code> (example <code>release/12.8</code>) branch with the RC1 version of the Gutenberg plugin.</li>\n<li><a href=\"#wordpress-releases\">WordPress Releases</a> (<code>wp-X.Y</code> dist tag, example <code>wp-6.2</code>) – publishing gets triggered on demand from the <code>wp/X.Y</code> (example <code>wp/6.2</code>) branch. Once we reach the point in the WordPress major release cycle (shortly before Beta 1) where we only cherry-pick commits from the Gutenberg repository to the WordPress core, we use <code>wp/X.Y</code> branch (created from <code>release/X.Y</code> branch, example <code>release/15.1</code>) for npm publishing with the <code>wp-X.Y</code> dist-tag. It&#8217;s also possible to use older branches to backport bug or security fixes to the corresponding older versions of WordPress Core.</li>\n<li><a href=\"#development-releases\">Development Releases</a> (<code>next</code> dist tag) – it is also possible to perform development releases at any time when there is a need to test the upcoming changes.</li>\n</ul>\n<p>There is also an option to perform <a href=\"#standalone-bugfix-package-releases\">Standalone Bugfix Package Releases</a> at will. It should be reserved only for critical bug fixes or security releases that must be published to <em>npm</em> outside of regular cycles.</p>\n<h3>Synchronizing the Gutenberg plugin</h3>\n<p>For each Gutenberg plugin release, we also publish to npm an updated version of WordPress packages. This is automated with the <a href=\"#release-tool\">Release Tool</a> that handles releases for the Gutenberg plugin. A successful RC1 release triggers the npm publishing job, and this needs to be approved by a Gutenberg Core team member. Locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/build-plugin-zip.yml\">&#8220;Build Gutenberg Plugin Zip&#8221; workflow</a> for the new version, and have it <a href=\"https://docs.github.com/en/actions/managing-workflow-runs/reviewing-deployments#approving-or-rejecting-a-job\">approved</a>.</p>\n<p>We deliberately update the <code>wp/latest</code> branch within the Gutenberg repo with the content from the Gutenberg release <code>release/X.Y</code> (example <code>release/12.7</code>) branch at the time of the Gutenberg RC1 release. This is done to ensure that the <code>wp/latest</code> branch is as close as possible to the latest version of the Gutenberg plugin. It also practically removes the chances of conflicts while backporting to <code>trunk</code> commits with updates applied during publishing to <code>package.json</code> and <code>CHANGELOG.md</code> files. In the past, we had many issues in that aspect when doing npm publishing after the regular Gutenberg release a week later. When publishing the new package versions to npm, we pick at least the <code>minor</code> version bump to account for future bugfix or security releases.</p>\n<p>Behind the scenes, all steps are automated via <code>./bin/plugin/cli.js npm-latest</code> command. For the record, the manual process would look very close to the following steps:</p>\n<ol>\n<li>Ensure the WordPress <code>trunk</code> branch is open for enhancements.</li>\n<li>Get the last published Gutenberg release branch with <code>git fetch</code>.</li>\n<li>Check out the <code>wp/latest</code> branch.</li>\n<li>Remove all files from the current branch: <code>git rm -r .</code>.</li>\n<li>Check out all the files from the release branch: <code>git checkout release/x.x -- .</code>.</li>\n<li>Commit all changes to the <code>wp/latest</code> branch with <code>git commit -m \"Merge changes published in the Gutenberg plugin vX.X release\"</code> and push to the repository.</li>\n<li>Update the <code>CHANGELOG.md</code> files of the packages with the new publish version calculated and commit to the <code>wp/latest</code> branch. Assuming the package versions are written using this format <code>major.minor.patch</code>, make sure to bump at least the <code>minor</code> version bumps gets applied. For example, if the CHANGELOG of the package to be released indicates that the next unreleased version is <code>5.6.1</code>, choose <code>5.7.0</code> as a version in case of <code>minor</code> version. This is important as the patch version numbers should be reserved in case bug fixes are needed for a minor WordPress release (see below).</li>\n<li>Log-in to npm via the console: <code>npm login</code>. Note that you should have 2FA enabled.</li>\n<li>From the <code>wp/latest</code> branch, install npm dependencies with <code>npm ci</code>.</li>\n<li>Run the script <code>npx lerna publish --no-private</code>.\n<ul>\n<li>When asked for the version numbers to choose for each package pick the values of the updated CHANGELOG files.</li>\n<li>You&#8217;ll be asked for your One-Time Password (OTP) a couple of times. This is the code from the 2FA authenticator app you use. Depending on how many packages are to be released you may be asked for more than one OTP, as they tend to expire before all packages are released.</li>\n<li>If the publishing process ends up incomplete (perhaps because it timed-out or a bad OTP was introduced) you can resume it via <a href=\"https://lerna.js.org/docs/features/version-and-publish#from-package\"><code>npx lerna publish from-package</code></a>.</li>\n</ul>\n</li>\n<li>Finally, now that the npm packages are published, cherry-pick the commits created by lerna (&#8220;Publish&#8221; and the CHANGELOG update) into the <code>trunk</code> branch of Gutenberg.</li>\n</ol>\n<h3>WordPress releases</h3>\n<p>The following workflow is needed when bug or security fixes need to be backported into WordPress Core. This can happen in a few use-cases:</p>\n<ul>\n<li>During the <code>beta</code> and <code>RC</code> periods of the WordPress release cycle when <code>wp/X.Y</code> (example <code>wp/5.7</code>) branch for the release is already present.</li>\n<li>For WordPress minor releases and WordPress security releases (example <code>5.1.1</code>).</li>\n</ul>\n<ol>\n<li>Check out the relevant WordPress major branch (If the minor release is 5.2.1, check out <code>wp/5.2</code>).</li>\n<li>Create a feature branch from that branch, and cherry-pick the merge commits for the needed bug fixes onto it. The cherry-picking process can be automated with the <a href=\"https://developer.wordpress.org/block-editor/contributors/code/auto-cherry-picking/\"><code>npm run other:cherry-pick</code> script</a>.</li>\n<li>Create a Pull Request from this branch targeting the WordPress major branch used above.</li>\n<li>Merge the Pull Request using the &#8220;Rebase and Merge&#8221; button to keep the history of the commits.</li>\n</ol>\n<p>Now, the <code>wp/X.Y</code> branch is ready for publishing npm packages. In order to start the process, go to Gutenberg&#8217;s GitHub repository&#8217;s Actions tab, and locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a>. Note the blue banner that says &#8220;This workflow has a <code>workflow_dispatch</code> event trigger.&#8221;, and expand the &#8220;Run workflow&#8221; dropdown on its right hand side.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-2.png?ssl=1\" alt=\"Run workflow dropdown for npm publishing\" /></p>\n<p>To publish packages to npm for the WordPress major release, select <code>trunk</code> as the branch to run the workflow from (this means that the script used to run the workflow comes from the trunk branch, though the packages themselves will published from the release branch as long as the correct &#8220;Release type&#8221; is selected below), then select <code>wp</code> from the &#8220;Release type&#8221; dropdown and enter <code>X.Y</code> (example <code>5.2</code>) in the &#8220;WordPress major release&#8221; input field. Finally, press the green &#8220;Run workflow&#8221; button. It triggers the npm publishing job, and this needs to be approved by a Gutenberg Core team member. Locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a> for the current publishing, and have it <a href=\"https://docs.github.com/en/actions/managing-workflow-runs/reviewing-deployments#approving-or-rejecting-a-job\">approved</a>.</p>\n<p>For the record, the manual process would look like the following:</p>\n<ol>\n<li>Check out the WordPress branch used before (example <code>wp/5.2</code>).</li>\n<li><code>git pull</code>.</li>\n<li>Run the <code>npx lerna publish patch --no-private --dist-tag wp-5.2</code> command (see more in <a href=\"https://github.com/WordPress/gutenberg/blob/HEAD/packages/README.md#releasing-packages\">package release process</a>) but when asked for the version numbers to choose for each package, (assuming the package versions are written using this format <code>major.minor.patch</code>) make sure to bump only the <code>patch</code> version number. For example, if the last published package version for this WordPress branch was <code>5.6.0</code>, choose <code>5.6.1</code> as a version.</li>\n</ol>\n<p><strong>Note:</strong> For WordPress <code>5.0</code> and WordPress <code>5.1</code>, a different release process was used. This means that when choosing npm package versions targeting these two releases, you won&#8217;t be able to use the next <code>patch</code> version number as it may have been already used. You should use the &#8220;metadata&#8221; modifier for these. For example, if the last published package version for this WordPress branch was <code>5.6.1</code>, choose <code>5.6.1+patch.1</code> as a version.</p>\n<ol>\n<li>Optionally update the <code>CHANGELOG.md</code> files of the published packages with the new released versions and commit to the corresponding branch (Example <code>wp/5.2</code>).</li>\n<li>Cherry-pick the CHANGELOG update commits, if any, into the <code>trunk</code> branch of Gutenberg.</li>\n</ol>\n<p>Now, the npm packages should be ready and a patch can be created and committed into the corresponding WordPress SVN branch.</p>\n<h3>Standalone bugfix package releases</h3>\n<p>The following workflow is needed when packages require bug fixes or security releases to be published to <em>npm</em> outside of a regular release cycle.</p>\n<p>Note: Both the <code>trunk</code> and <code>wp/latest</code> branches are restricted and can only be <em>pushed</em> to by the Gutenberg Core team.</p>\n<p>Identify the commit hashes from the pull requests that need to be ported from the repo <code>trunk</code> branch to <code>wp/latest</code></p>\n<p>The <code>wp/latest</code> branch now needs to be prepared to release and publish the packages to <em>npm</em>.</p>\n<p>Open a terminal and perform the following steps:</p>\n<ol>\n<li><code>git checkout trunk</code></li>\n<li><code>git pull</code></li>\n<li><code>git checkout wp/latest</code></li>\n<li><code>git pull</code></li>\n</ol>\n<p>Before porting commits check that the <code>wp/latest</code> branch does not have any outstanding packages waiting to be published:</p>\n<ol>\n<li><code>git checkout wp/latest</code></li>\n<li><code>npx lerna updated</code></li>\n</ol>\n<p>Now <em>cherry-pick</em> the commits from <code>trunk</code> to <code>wp/latest</code>, use <code>-m 1 commithash</code> if the commit was a pull request merge commit:</p>\n<ol>\n<li><code>git cherry-pick -m 1 cb150a2</code></li>\n<li><code>git push</code></li>\n</ol>\n<p>Whilst waiting for the GitHub actions build for <code>wp/latest</code><a href=\"https://github.com/WordPress/gutenberg/actions?query=branch%3Awp%2Ftrunk\">branch to pass</a>, identify and begin updating the <code>CHANGELOG.md</code> files:</p>\n<ol>\n<li><code>git checkout wp/latest</code></li>\n<li><code>npx lerna updated</code><br />\n&gt; Example<br />\n&gt;<br />\n&gt; <code>shell<br />\n&gt; npx lerna updated<br />\n&gt; @wordpress/e2e-tests<br />\n&gt; @wordpress/jest-preset-default<br />\n&gt; @wordpress/scripts<br />\n&gt; lerna success found 3 packages ready to publish<br />\n&gt;</code></li>\n</ol>\n<p>Check the versions listed in the current <code>CHANGELOG.md</code> file, looking through the commit history of a package e.g <a href=\"https://github.com/WordPress/gutenberg/commits/HEAD/packages/scripts\">@wordpress/scripts</a> and look out for <em>&#8220;chore(release): publish&#8221;</em> and <em>&#8220;Update changelogs&#8221;</em> commits to determine recent version bumps, then looking at the commits since the most recent release should aid with discovering what changes have occurred since the last release.</p>\n<p>Note: You may discover the current version of each package is not up to date, if so updating the previously released versions would be appreciated.</p>\n<p>Now, the <code>wp/latest</code> branch is ready for publishing npm packages. In order to start the process, go to Gutenberg&#8217;s GitHub repository&#8217;s Actions tab, and locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a>. Note the blue banner that says &#8220;This workflow has a <code>workflow_dispatch</code> event trigger.&#8221;, and expand the &#8220;Run workflow&#8221; dropdown on its right hand side.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-6.png?ssl=1\" alt=\"Run workflow dropdown for npm publishing\" /></p>\n<p>To publish packages to npm with bugfixes, select <code>bugfix</code> from the &#8220;Release type&#8221; dropdown and leave empty &#8220;WordPress major release&#8221; input field. Finally, press the green &#8220;Run workflow&#8221; button. It triggers the npm publishing job, and this needs to be approved by a Gutenberg Core team member. Locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a> for the current publishing, and have it <a href=\"https://docs.github.com/en/actions/managing-workflow-runs/reviewing-deployments#approving-or-rejecting-a-job\">approved</a>.</p>\n<p>Behind the scenes, the rest of the process is automated with <code>./bin/plugin/cli.js npm-bugfix</code> command. For the record, the manual process would look very close to the following steps:</p>\n<ol>\n<li>Check out the <code>wp/latest</code> branch.</li>\n<li>Update the <code>CHANGELOG.md</code> files of the packages with the new publish version calculated and commit to the <code>wp/latest</code> branch.</li>\n<li>Log-in to npm via the console: <code>npm login</code>. Note that you should have 2FA enabled.</li>\n<li>From the <code>wp/latest</code> branch, install npm dependencies with <code>npm ci</code>.</li>\n<li>Run the script <code>npx lerna publish --no-private</code>.\n<ul>\n<li>When asked for the version numbers to choose for each package pick the values of the updated CHANGELOG files.</li>\n<li>You&#8217;ll be asked for your One-Time Password (OTP) a couple of times. This is the code from the 2FA authenticator app you use. Depending on how many packages are to be released you may be asked for more than one OTP, as they tend to expire before all packages are released.</li>\n<li>If the publishing process ends up incomplete (perhaps because it timed-out or a bad OTP was introduced) you can resume it via <a href=\"https://lerna.js.org/docs/features/version-and-publish#from-package\"><code>npx lerna publish from-package</code></a>.</li>\n</ul>\n</li>\n<li>Finally, now that the npm packages are published, cherry-pick the commits created by lerna (&#8220;Publish&#8221; and the CHANGELOG update) into the <code>trunk</code> branch of Gutenberg.</li>\n</ol>\n<h3>Development releases</h3>\n<p>As noted in the <a href=\"#synchronizing-gutenberg-plugin\">Synchronizing Gutenberg Plugin</a> section, packages publishing happens every two weeks from the <code>wp/latest</code> branch. It&#8217;s also possible to use the development release to test the upcoming changes present in the <code>trunk</code> branch at any time. We are taking advantage of <a href=\"https://docs.npmjs.com/cli/v7/commands/npm-dist-tag\">package distribution tags</a> that make it possible to consume the future version of the codebase according to npm guidelines:</p>\n<blockquote><p>\n  By default, the <code>latest</code> tag is used by npm to identify the current version of a package, and <code>npm install &lt;pkg&gt;</code> (without any <code>@&lt;version&gt;</code> or <code>@&lt;tag&gt;</code> specifier) installs the <code>latest</code> tag. Typically, projects only use the <code>latest</code> tag for stable release versions, and use other tags for unstable versions such as prereleases.\n</p></blockquote>\n<p>In our case, we use the <code>next</code> distribution tag for code. Developers that want to install such a version of the package need to type:</p>\n<pre><code class=\"language-bash\">npm install @wordpress/components@next\n</code></pre>\n<p>In order to start the publishing process for development version of npm packages, go to Gutenberg&#8217;s GitHub repository&#8217;s Actions tab, and locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a>. Note the blue banner that says &#8220;This workflow has a <code>workflow_dispatch</code> event trigger.&#8221;, and expand the &#8220;Run workflow&#8221; dropdown on its right hand side.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/developer.wordpress.org/files/2023/07/image-4.png?ssl=1\" alt=\"Run workflow dropdown for npm publishing\" /></p>\n<p>To publish development packages to npm, select <code>development</code> from the &#8220;Release type&#8221; dropdown and leave empty &#8220;WordPress major release&#8221; input field. Finally, press the green &#8220;Run workflow&#8221; button. It triggers the npm publishing job, and this needs to be approved by a Gutenberg Core team member. Locate the <a href=\"https://github.com/WordPress/gutenberg/actions/workflows/publish-npm-packages.yml\">&#8220;Publish npm packages&#8221; action</a> for the current publishing, and have it <a href=\"https://docs.github.com/en/actions/managing-workflow-runs/reviewing-deployments#approving-or-rejecting-a-job\">approved</a>.</p>\n<p>Behind the scenes, the release process is fully automated via <code>./bin/plugin/cli.js npm-next</code> command. It ensures<br />\nthe <code>wp/next</code> branch is synchronized with the latest release branch (<code>release/X.Y</code>) created for the Gutenberg plugin. To avoid collisions in the versioning of packages, we always include the newest commit&#8217;s <code>sha</code>, for example, <code>@wordpress/block-editor@5.2.10-next.645224df70.0</code>.</p>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 135090,
    "menu_order": 379,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-135104",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135104",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 56,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135104/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 157554,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135104/revisions/157554"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135090"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=135104"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}