{
    "id": 135085,
    "date": "2021-03-10T00:39:48",
    "date_gmt": "2021-03-10T00:39:48",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/handbook/glossary/"
    },
    "modified": "2024-04-05T15:09:51",
    "modified_gmt": "2024-04-05T15:09:51",
    "slug": "glossary",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/getting-started/glossary/",
    "title": {
        "rendered": "Glossary"
    },
    "content": {
        "rendered": "<h2>Attribute sources</h2>\n<p>An object describing the attributes shape of a block. The keys can be named as most appropriate to describe the state of a block type. The value for each key is a function which describes the strategy by which the attribute value should be extracted from the content of a saved post&#8217;s content. When processed, a new object is created, taking the form of the keys defined in the attribute sources, where each value is the result of the attribute source function.</p>\n<h2>Attributes</h2>\n<p>The object representation of the current state of a block in post content. When loading a saved post, this is determined by the attribute sources for the block type. These values can change over time during an editing session when the user modifies a block, and are used when determining how to serialize the block.</p>\n<h2>Block</h2>\n<p>The abstract term used to describe units of markup that, composed together, form the content or layout of a webpage. The idea combines concepts of what in WordPress today we achieve with shortcodes, custom HTML, and embed discovery into a single consistent API and user experience.</p>\n<h2>Block Styles</h2>\n<p>The CSS styles that are part of the block, either via its stylesheet or via the block markup itself. For example, a class attached to the block markup is considered block styles.</p>\n<p>Compare to <a href=\"#global-styles\">Global Styles</a>. In contraposition to Global Styles, block styles are sometimes referred to as <a href=\"#local-styles\">Local Styles</a>.</p>\n<p>Learn more about <a href=\"https://developer.wordpress.org/block-editor/explanations/architecture/styles/#block-styles\">Block Styles</a>.</p>\n<h2>Block Supports</h2>\n<p>An API for blocks to declare what features they support. By declaring support for a feature, the API would add additional <a href=\"#attributes\">attributes</a> to the block and matching UI controls for most of the existing block supports.</p>\n<p>See <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-supports/\">Block Supports reference documentation</a> for a deep dive into the API.</p>\n<h2>Block Theme</h2>\n<p>A theme built in block forward way that allows Full Site Editing to work. The core of a block theme are its block templates and block template parts. To date, block theme templates have been HTML files of block markup that map to templates from the standard WordPress template hierarchy.</p>\n<h2>Block categories</h2>\n<p>These are not a WordPress taxonomy, but instead used internally to sort blocks in the Block Library.</p>\n<h2>Block ~Inserter~ Library</h2>\n<p>Primary interface for selecting from the available blocks, triggered by plus icon buttons on Blocks or in the top-left of the editor interface.</p>\n<h2>Block name</h2>\n<p>A unique identifier for a block type, consisting of a plugin-specific namespace and a short label describing the block&#8217;s intent. e.g. <code>core/image</code></p>\n<h2>Block Templates</h2>\n<p>A template is a pre-defined arrangement of blocks, possibly with predefined attributes or placeholder content. You can provide a template for a post type, to give users a starting point when creating a new piece of content, or inside a custom block with the <code>InnerBlocks</code> component. At their core, templates are simply HTML files of block markup that map to templates from the standard WordPress template hierarchy, for example index, single or archive. This helps control the front-end defaults of a site that are not edited via the Page Editor or the Post Editor. See the <a href=\"../../developers/block-api/block-templates/\">templates documentation</a> for more information.</p>\n<h2>Block Template Parts</h2>\n<p>Building on Block Templates, these parts help set structure for reusable items like a Footer or Header that one typically sees in a WordPress site. They are primarily site structure and are never to be mixed with the post content editor. With Full Site Editing and block based themes, users can create their own arbitrary Template Parts, save those in the database for their site, and re-use them throughout their site. Template parts are equivalent – in blocks – of theme template parts. They are generally defined by a theme first, carry some semantic meaning (could be swapped between themes such as a header), and can only be inserted in the site editor context (within “templates”).</p>\n<h2>Block type</h2>\n<p>In contrast with the blocks composing a particular post, a block type describes the blueprint by which any block of that type should behave. So while there may be many images within a post, each behaves consistent with a unified image block type definition.</p>\n<h2>Classic block</h2>\n<p>A block which embeds the TinyMCE editor as a block, TinyMCE was the base of the previous core editor. Older content created prior to the block editor will be loaded in to a single Classic block.</p>\n<h2>Dynamic block</h2>\n<p>A type of block where the content of which may change and cannot be determined at the time of saving a post, instead calculated any time the post is shown on the front of a site. These blocks may save fallback content or no content at all in their JavaScript implementation, instead deferring to a PHP block implementation for runtime rendering.</p>\n<h2>Full Site Editing</h2>\n<p>This refers to a collection of features that ultimately allows users to edit their entire website using blocks as the starting point. This feature set includes everything from block patterns to global styles to templates to design tools for blocks (and more). First released in WordPress 5.9.</p>\n<h2>Global Styles</h2>\n<p>The CSS styles generated by WordPress and enqueued as an embedded stylesheet in the front end of the site. The stylesheet ID is <code>global-styles-inline-css</code>. The contents of this stylesheet come from the default <code>theme.json</code> of WordPress, the theme&#8217;s <code>theme.json</code>, and the styles provided by the user via the global styles sidebar in the site editor.</p>\n<p>See <a href=\"https://developer.wordpress.org/block-editor/reference-guides/theme-json-reference/\">theme.json reference docs</a></a>, the <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/themes/global-settings-and-styles/\">how to guide</a>, and an introduction to <a href=\"https://developer.wordpress.org/block-editor/explanations/architecture/styles/\">styles in the block editor</a>.</p>\n<p>Compare to <a href=\"#block-styles\">block styles</a>.</p>\n<h2>Inspector</h2>\n<p>Deprecated term. See <a href=\"#settings-sidebar\">Settings Sidebar.</a></p>\n<h2>Local Styles</h2>\n<p>See <a href=\"#block-styles\">Block Styles</a>.</p>\n<h2>Navigation Block</h2>\n<p>A block that allows you to edit a site&#8217;s navigation menu, both in terms of structure and design.</a></p>\n<h2>Patterns</h2>\n<p>Patterns are predefined layouts of blocks that can be inserted as starter content that are meant to be changed by the user every time. Once inserted, they exist as a local save and are not global.</p>\n<h2>Post settings</h2>\n<p>A sidebar region containing metadata fields for the post, including scheduling, visibility, terms, and featured image.</p>\n<h2>Query Block</h2>\n<p>A block that replicates the classic <a href=\"https://developer.wordpress.org/reference/classes/wp_query/\" rel=\"class\">WP_Query</a> and allows for further customization with additional functionality.</p>\n<h2>Reusable block</h2>\n<p>A block that is saved and then can be shared as a reusable, repeatable piece of content.</p>\n<h2>RichText</h2>\n<p>A common component enabling rich content editing including bold, italics, hyperlinks, etc.</p>\n<h2>Serialization</h2>\n<p>The process of converting a block&#8217;s attributes object into HTML markup, which occurs each time a block is edited.</p>\n<h2>Settings Sidebar</h2>\n<p>The panel on the right that contains the document and block settings. The sidebar is toggled using the Settings gear icon. Block settings are shown when a block is selected, otherwise document settings are shown.</p>\n<h2>Site Editor</h2>\n<p>The cohesive experience that allows you to directly edit and navigate between various templates, template parts, styling options, and more.</p>\n<h2>Static block</h2>\n<p>A type of block where the content of which is known at the time of saving a post. A static block will be saved with HTML markup directly in post content.</p>\n<h2>Template Editing Mode</h2>\n<p>A scaled down direct editing experience allowing you to edit/change/create the template a post/page uses.</p>\n<h2>Theme Blocks</h2>\n<p>Blocks that accomplish everything possible in traditional templates using template tags (ex: Post Author Block). A full list can be found <a href=\"https://github.com/WordPress/gutenberg/issues/22724\">here</a>.</p>\n<h2>TinyMCE</h2>\n<p><a href=\"https://www.tinymce.com/\">TinyMCE</a> is a web-based JavaScript WYSIWYG (What You See Is What You Get) editor.</p>\n<h2>Toolbar</h2>\n<p>A set of button controls. In the context of a block, usually referring to the toolbar of block controls shown above the selected block.</p>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 137157,
    "menu_order": 18,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-135085",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135085",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 13,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135085/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 151758,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135085/revisions/151758"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/137157"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=135085"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}