{
    "id": 135086,
    "date": "2021-03-10T00:39:48",
    "date_gmt": "2021-03-10T00:39:48",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/handbook/faq/"
    },
    "modified": "2024-12-28T04:04:09",
    "modified_gmt": "2024-12-28T04:04:09",
    "slug": "faq",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/getting-started/faq/",
    "title": {
        "rendered": "Frequently Asked Questions"
    },
    "content": {
        "rendered": "<p>What follows is a set of questions that have come up from the last few years of Gutenberg development. If you have any questions you’d like to have answered and included here, <a href=\"https://github.com/WordPress/gutenberg/issues\">just open up a GitHub issue</a> with your question. We’d love the chance to answer and provide clarity to questions we might not have thought to answer. For a look back historically, please see Matt&#8217;s November 2018 post <a href=\"https://ma.tt/2018/11/a-gutenberg-faq/\">WordPress 5.0: A Gutenberg FAQ</a>.</p>\n<h2>The Gutenberg Project</h2>\n<h3>What is Gutenberg?</h3>\n<p>“Gutenberg” is the name of the project to create a new editor experience for WordPress — contributors have been working on it since January 2017 and it’s one of the most significant changes to WordPress in years. It’s built on the idea of using “blocks” to write and design posts and pages. This will serve as the foundation for future improvements to WordPress, including blocks as a way not just to design posts and pages, but also entire sites. The overall goal is to simplify the first-time user experience of WordPress — for those who are writing, editing, publishing, and designing web pages. The editing experience is intended to give users a better visual representation of what their post or page will look like when they hit publish. Originally, this was the kickoff goal:</p>\n<blockquote><p>\n  The editor will endeavor to create a new page and post building experience that makes writing rich posts effortless, and has “blocks” to make it easy what today might take shortcodes, custom HTML, or “mystery meat” embed discovery.\n</p></blockquote>\n<p>Key takeaways include the following points:</p>\n<ul>\n<li>Authoring richly laid-out posts is a key strength of WordPress.</li>\n<li>By embracing blocks as an interaction paradigm, we can unify multiple different interfaces into one. Instead of learning how to write shortcodes and custom HTML, or pasting URLs to embed media, there&#8217;s a common, reliable flow for inserting any kind of content.</li>\n<li>“Mystery meat” refers to hidden features in software, features that you have to discover. WordPress already supports a large number of blocks and 30+ embeds, so let&#8217;s surface them.</li>\n</ul>\n<p>Gutenberg is developed on <a href=\"https://github.com/WordPress/gutenberg\">GitHub</a> under the WordPress organization. The block editor has been available in core WordPress since 5.0. If you want to test upcoming features from Gutenberg project, it is <a href=\"https://wordpress.org/plugins/gutenberg/\">available in the plugin repository</a>.</p>\n<h3>What’s on the roadmap long term?</h3>\n<p>There are four phases of Gutenberg which you can see on the <a href=\"https://wordpress.org/about/roadmap/\">official WordPress roadmap</a>. As of writing this, we’re currently in phase 2:</p>\n<ol>\n<li>Easier Editing — Already available in WordPress since 5.0, with ongoing improvements.</li>\n<li>Customization — Full Site editing, Block Patterns, Block Directory, Block based themes.</li>\n<li>Collaboration — A more intuitive way to co-author content</li>\n<li>Multi-lingual — Core implementation for Multi-lingual sites</li>\n</ol>\n<h3>When was Gutenberg started?</h3>\n<p>The editor focus started in early 2017 with the first three months spent designing, planning, prototyping, and testing prototypes, to help us inform how to approach this project. The first plugin was launched during WordCamp Europe in June 2017.</p>\n<h3>When was Gutenberg merged into WordPress?</h3>\n<p>Gutenberg was first merged into <a href=\"https://wordpress.org/news/2018/12/bebo/\">WordPress 5.0</a> in December 2018. See <a href=\"https://developer.wordpress.org/block-editor/principles/versions-in-wordpress/\">the versions in WordPress page</a> for a complete list of Gutenberg plugin versions merged into WordPress core releases.</p>\n<h3>WordPress is already the world&#8217;s most popular publishing platform. Why change the editor at all?</h3>\n<p>The Editor is where most of the action happens in WordPress’s daily use, and it was a place where we could polish and perfect the block experience in a contained environment. Further, as an open-source project, we believe that it is critical for WordPress to continue to innovate and keep working to make the core experience intuitive and enjoyable for all users. As a community project, Gutenberg has the potential to do just that, and we’re excited to pursue this goal together. If you’d like to test, contribute, or offer feedback, we welcome you to <a href=\"https://github.com/WordPress/gutenberg/issues\">share what you find on GitHub</a>.</p>\n<h2>The Editing Experience</h2>\n<h3>What are “blocks” and why are we using them?</h3>\n<p>The classic WordPress editor is an open text window—it’s always been a wonderful blank canvas for writing, but when it comes to building posts and pages with images, multimedia, embedded content from social media, polls, and other elements, it required a mix of different approaches that were not always intuitive:</p>\n<ul>\n<li>Media library/HTML for images, multimedia and approved files.</li>\n<li>Pasted links for embeds.</li>\n<li>Shortcodes for specialized assets from plugins.</li>\n<li>Featured images for the image at the top of a post or page.</li>\n<li>Excerpts for subheadings.</li>\n<li>Widgets for content on the side of a page.</li>\n</ul>\n<p>As we thought about these uses and how to make them obvious and consistent, we began to embrace the concept of “blocks.” All of the above items could be blocks: easy to search and understand, and easy to dynamically shift around the page. The block concept is very powerful, and when designed thoughtfully, can offer an outstanding editing and publishing experience. Ultimately, the idea with blocks is to create a new common language across WordPress, a new way to connect users to plugins, and replace a number of older content types — things like shortcodes and widgets — that one usually has to be well-versed in the idiosyncrasies of WordPress to understand.</p>\n<h3>What is the writing experience like?</h3>\n<p>Our goal with Gutenberg is not just to create a seamless post- and page-building experience. We also want to ensure that it provides a seamless writing experience. To test this out yourself, <a href=\"https://wordpress.org/gutenberg/\">head to this demo and give it a try</a>!</p>\n<h3>Is Gutenberg built on top of TinyMCE?</h3>\n<p>No. <a href=\"https://www.tinymce.com/\">TinyMCE</a> is only used for the &#8220;Classic&#8221; block.</p>\n<h3>Are there Keyboard Shortcuts for Gutenberg?</h3>\n<p>Yes. There are a lot! There is a help modal showing all available keyboard shortcuts.</p>\n<p>You can see the whole list going to the top right corner menu of the new editor and clicking on “Keyboard Shortcuts” (or by using the keyboard shortcut <kbd>Shift</kbd>+<kbd>Alt</kbd>+<kbd>H</kbd> on Linux/Windows and <kbd>⌃</kbd><kbd>⌥</kbd><kbd>H</kbd> on macOS).</p>\n<p>Here is a brief animation illustrating how to find and use the keyboard shortcuts:</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/make.wordpress.org/core/files/2020/07/keyboard-shortcuts.gif?ssl=1\" alt=\"GIF showing how to access keyboard shortcuts\" /></p>\n<h3>Does Gutenberg support columns?</h3>\n<p>Yes, a columns block is available in Gutenberg.</p>\n<h3>Does Gutenberg support nested blocks?</h3>\n<p>Yes, it is supported. You can have multiple levels of nesting – blocks within blocks within blocks. See the <a href=\"https://developer.wordpress.org/block-editor/tutorials/block-tutorial/nested-blocks-inner-blocks/\">Nested Block Tutorial</a> for more information.</p>\n<h3>Does drag and drop work for rearranging blocks?</h3>\n<p>Yes, you can drag and drop blocks to rearrange their order.</p>\n<h2>The Development Experience</h2>\n<h3>How do I make my own block?</h3>\n<p>The best place to start is the <a href=\"https://developer.wordpress.org/block-editor/getting-started/create-block/\">Create a Block Tutorial</a>.</p>\n<h3>Does Gutenberg involve editing posts/pages in the front end?</h3>\n<p>No, we are designing Gutenberg primarily as a replacement for the post and page editing screens. That said, front-end editing is often confused with an editor that looks exactly like the front end. And that is something that Gutenberg will allow as themes customize individual blocks and provide those styles to the editor. Since content is designed to be distributed across so many different experiences—from desktop and mobile to full-text feeds and syndicated article platforms—we believe it&#8217;s not ideal to create or design posts from just one front-end experience.</p>\n<h3>Given Gutenberg is built in JavaScript, how do old meta boxes (PHP) work?</h3>\n<p>See the <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/metabox/\">Meta Box Tutorial</a> for more information on using Meta boxes with the new block editor.</p>\n<h3>How can plugins extend the Gutenberg UI?</h3>\n<p>The main extension point we want to emphasize is creating new blocks. Blocks are added to the block editor using plugins, see the <a href=\"https://developer.wordpress.org/block-editor/getting-started/tutorial/\">Build your first block Tutorial</a> to get started.</p>\n<h3>Are Custom Post Types still supported?</h3>\n<p>Indeed. There are multiple ways in which custom post types can leverage Gutenberg. The plan is to allow them to specify the blocks they support, as well as defining a default block for the post type. It&#8217;s not currently the case, but if a post type disables the content field, the “advanced” section at the bottom would fill the page.</p>\n<h2>Styles</h2>\n<h3>Can themes <em>style</em> blocks?</h3>\n<p>Yes. Blocks can provide their own styles, which themes can add to or override, or they can provide no styles at all and rely fully on what the theme provides.</p>\n<h3>How do block styles work in both the front-end and back-end?</h3>\n<p>Blocks are able to provide base structural CSS styles, and themes can add styles on top of this. Some blocks, like a Separator (<code>&lt;hr/&gt;</code>), likely don&#8217;t need any front-end styles, while others, like a Gallery, need a few.</p>\n<p>Other features, like the new <em>wide</em> and <em>full-wide</em> alignment options, are simply CSS classes applied to blocks that offer this alignment. We are looking at how a theme can opt into this feature, for example using <code>add_theme_support</code>.</p>\n<p>This is currently a work in progress and we recommend reviewing the <a href=\"https://developer.wordpress.org/themes/block-themes/\">block based theme documentation</a> to learn more.</p>\n<h3>What are block variations? Are they the same as block styles?</h3>\n<p>No, <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-variations/\">block variations</a> are different versions of a single base block, sharing a similar functionality but with slight differences in their implementation or settings (attributes, InnerBlocks, etc.). Block variations are transparent for users, and once there is a registered block variation, it will appear as a new block. For example, the <code>embed</code> block registers different block variations to embed content from specific providers.</p>\n<p>Meanwhile, <a href=\"https://developer.wordpress.org/block-editor/reference-guides/filters/block-filters/#block-style-variations\">block styles</a> allow you to provide alternative styles to existing blocks, and they work by adding a <code>className</code> to the block’s wrapper. Once a block has registered block styles, a block style selector will appear in its sidebar so that users can choose among the different registered styles.</p>\n<h3>How do editor styles work?</h3>\n<p>Regular editor styles are opt-in and work as is in most cases. Themes can also load extra stylesheets by using the following hook:</p>\n<pre><code class=\"language-php\">function gutenbergtheme_editor_styles() {\n    wp_enqueue_style( 'gutenbergtheme-blocks-style', get_template_directory_uri() . '/blocks.css');\n}\nadd_action( 'enqueue_block_editor_assets', 'gutenbergtheme_editor_styles' );\n</code></pre>\n<p><em>See:</em> <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/themes/theme-support/#editor-styles\">Editor Styles</a></p>\n<h2>Compatibility</h2>\n<h3>What browsers does Gutenberg support?</h3>\n<p>Gutenberg works in modern browsers.</p>\n<p>The <a href=\"https://make.wordpress.org/core/handbook/best-practices/browser-support/\">list of supported browsers can be found in the Make WordPress handbook</a>. The term “modern browsers” generally refers to the <em>current and previous two versions</em> of each major browser.</p>\n<p>Since WordPress 5.8, Gutenberg no longer supports any version of Internet Explorer.</p>\n<h3>Should I be concerned that Gutenberg will make my plugin obsolete?</h3>\n<p>The goal of Gutenberg is not to put anyone out of business. It&#8217;s to evolve WordPress so there&#8217;s more business to be had in the future, for everyone.</p>\n<p>Aside from enabling a rich post and page building experience, a meta goal is to <em>move WordPress forward</em> as a platform. Not only by modernizing the UI, but by modernizing the foundation.</p>\n<p>We realize it&#8217;s a big change. We also think there will be many new opportunities for plugins. WordPress is likely to ship with a range of basic blocks, but there will be plenty of room for highly tailored premium plugins to augment existing blocks or add new blocks to the mix.</p>\n<h3>Is it possible to opt out of Gutenberg for my site?</h3>\n<p>There is a “Classic” block, which is virtually the same as the current editor, except in block form.</p>\n<p>There is also the <a href=\"https://wordpress.org/plugins/classic-editor/\">Classic Editor plugin</a> which restores the previous editor, see the plugin for more information. The WordPress Core team has committed to supporting the Classic Editor plugin <a href=\"https://make.wordpress.org/core/2018/11/07/classic-editor-plugin-support-window/\">until December 2021</a>.</p>\n<h3>How do custom TinyMCE buttons work in Gutenberg?</h3>\n<p>Custom TinyMCE buttons still work in the “Classic” block, which is a block version of the classic editor you know today.</p>\n<p>Gutenberg comes with a new universal inserter tool, which gives you access to every block available, searchable, sorted by recency and categories. This inserter tool levels the playing field for every plugin that adds content to the editor, and provides a single interface to learn how to use.</p>\n<h3>How do shortcodes work in Gutenberg?</h3>\n<p>Shortcodes continue to work as they do now.</p>\n<p>However we see the block as an evolution of the <code>[shortcode]</code>. Instead of having to type out code, you can use the universal inserter tray to pick a block and get a richer interface for both configuring the block and previewing it. We would recommend people eventually upgrade their shortcodes to be blocks.</p>\n<h3>Should I move shortcodes to content blocks?</h3>\n<p>We think so for a variety of reasons including but not limited to:</p>\n<ul>\n<li>Blocks have visual editing built-in which creates a more rich, dynamic experience for building your site.</li>\n<li>Blocks are simply html and don’t persist things the browser doesn&#8217;t understand on the front-end. In comparison, if you disable a plugin that powers a shortcode, you end up with strange visuals on the front-end (often just showing the shortcode in plain text).</li>\n<li>Blocks will be discovered more readily with the launch of the block directory in a way shortcodes never could be allowing for more people to get more functionality.</li>\n</ul>\n<p>Ultimately, Blocks are designed to be visually representative of the final look, and, with the launch of the Block Directory in 5.5, they will become the expected way in which users will discover and insert content in WordPress.</p>\n<h2>Miscellaneous</h2>\n<h3>Is Gutenberg made to be properly accessible?</h3>\n<p>Accessibility is not an afterthought. Not every aspect of Gutenberg is accessible at the moment. You can check logged issues <a href=\"https://github.com/WordPress/gutenberg/labels/Accessibility%20%28a11y%29\">here</a>. We understand that WordPress is for everyone, and that accessibility is about inclusion. This is a key value for us.</p>\n<p>If you would like to contribute to the accessibility of Gutenberg, we can always use more people to test and contribute.</p>\n<h3>How is data stored? I&#8217;ve seen HTML comments. What is their purpose?</h3>\n<p>Our approach—as outlined in <a href=\"https://make.wordpress.org/core/2017/01/17/editor-technical-overview/\">the technical overview introduction</a>—is to augment the existing data format in a way that doesn’t break the decade-and-a-half-fabric of content WordPress provides. In other terms, this optimizes for a format that prioritizes human readability (the HTML document of the web) and easy-to-render-anywhere over a machine convenient file (JSON in post-meta) that benefits the editing context primarily.</p>\n<p>This also <a href=\"https://github.com/WordPress/gutenberg/issues/1516\">gives us the flexibility</a> to store those blocks that are inherently separate from the content stream (reusable pieces like widgets or small post type elements) elsewhere, and just keep token references for their placement.</p>\n<p>We suggest you look at the <a href=\"https://developer.wordpress.org/block-editor/explanations/architecture/key-concepts/\">Gutenberg key concepts</a> to learn more about how this aspect of the project works.</p>\n<h3>How can I parse the post content back out into blocks in PHP or JS?</h3>\n<p>In JS:</p>\n<pre><code class=\"language-js\">var blocks = wp.blocks.parse( postContent );\n</code></pre>\n<p>In PHP:</p>\n<pre><code class=\"language-php\">$blocks = parse_blocks( $post_content );\n</code></pre>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 137157,
    "menu_order": 19,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-135086",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135086",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 25,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135086/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 156153,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/135086/revisions/156153"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/137157"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=135086"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}