{
    "id": 138642,
    "date": "2021-12-27T19:24:48",
    "date_gmt": "2021-12-27T19:24:48",
    "guid": {
        "rendered": "https://developer.wordpress.org/block-editor/how-to-guides/metabox/"
    },
    "modified": "2024-11-18T21:54:47",
    "modified_gmt": "2024-11-18T21:54:47",
    "slug": "metabox",
    "status": "publish",
    "type": "blocks-handbook",
    "link": "https://developer.wordpress.org/block-editor/how-to-guides/metabox/",
    "title": {
        "rendered": "Meta Boxes"
    },
    "content": {
        "rendered": "<h2>Overview</h2>\n<p>Prior to the block editor, custom meta boxes were used to extend the editor. Now there are new ways to extend, giving more power to the developer and a better experience for the authors. It is recommended to port older custom meta boxes to one of these new methods to create a more unified and consistent experience for those using the editor.</p>\n<p>The block editor does support most existing meta boxes, see <a href=\"#backward-compatibility\">the backward compatibility section below</a> for details .</p>\n<p>If you are interested in working with the post meta outside the editor, check out the <a href=\"https://developer.wordpress.org/block-editor/how-to-guides/sidebar-tutorial/plugin-sidebar-0/\">Sidebar Tutorial</a>.</p>\n<h3>Use blocks to store meta</h3>\n<p>Typically, blocks store attribute values in the serialized block HTML. However, you can also create a block that saves its attribute values as post meta, that can be accessed programmatically anywhere in your template.</p>\n<p>This guide shows how to create a block that prompts a user for a single value, and saves it to post meta.</p>\n<h2>Before you start</h2>\n<p>This guide assumes you are already familiar with WordPress plugins, post meta, and basic JavaScript. Review the <a href=\"https://developer.wordpress.org/block-editor/getting-started/fundamentals/javascript-in-the-block-editor/\">Getting started with JavaScript tutorial</a> for an introduction.</p>\n<p>The guide will walk through creating a basic block, but recommended to go through the <a href=\"https://developer.wordpress.org/block-editor/getting-started/tutorial/\">Create Block tutorial</a> for a deeper understanding of creating custom blocks.</p>\n<p>You will need:</p>\n<ul>\n<li>WordPress development environment,</li>\n<li>A minimal plugin activated and ready to edit</li>\n<li>JavaScript setup for building and enqueuing</li>\n</ul>\n<p>A <a href=\"https://github.com/WordPress/block-development-examples/tree/trunk/plugins/meta-block-bb1e55\">complete meta-block example</a> is available that you can use as a reference for your setup.</p>\n<h2>Step-by-step guide</h2>\n<ol>\n<li><a href=\"#step-1-register-meta-field\">Register Meta Field</a></li>\n<li><a href=\"#step-2-add-meta-block\">Add Meta Block</a></li>\n<li><a href=\"#step-3-use-post-meta-data\">Use Post Meta Data</a></li>\n<li><a href=\"#step-4-use-block-templates-optional\">Finishing Touches</a></li>\n</ol>\n<h3>Step 1: Register meta field</h3>\n<p>A post meta field is a WordPress object used to store extra data about a post. You need to first register a new meta field prior to use. See Managing <a href=\"https://developer.wordpress.org/plugins/metadata/managing-post-metadata/\">Post Metadata</a> to learn more about post meta.</p>\n<p>When registering the field, note the <code>show_in_rest</code> parameter. This ensures the data will be included in the REST API, which the block editor uses to load and save meta data. See the <a href=\"https://developer.wordpress.org/reference/functions/register_post_meta/\"><code>register_post_meta</code></a> function definition for extra information.</p>\n<p>Additionally, your post type needs to support <code>custom-fields</code> for <code>register_post_meta</code> function to work</p>\n<p>To register the field, add the following to your PHP plugin:</p>\n<pre><code class=\"language-php\">&lt;?php\n// register custom meta tag field\nfunction myguten_register_post_meta() {\n    register_post_meta( 'post', 'myguten_meta_block_field', array(\n        'show_in_rest' =&gt; true,\n        'single' =&gt; true,\n        'type' =&gt; 'string',\n    ) );\n}\nadd_action( 'init', 'myguten_register_post_meta' );\n</code></pre>\n<h3>Step 2: Add meta block</h3>\n<p>With the meta field registered in the previous step, next create a new block to display the field value to the user.</p>\n<p>The hook <code>useEntityProp</code> can be used by the blocks to get or change meta values.</p>\n<p>Add this code to the JavaScript <code>src/index.js</code>:</p>\n<pre><code class=\"language-js\">import { registerBlockType } from '@wordpress/blocks';\nimport { TextControl } from '@wordpress/components';\nimport { useSelect } from '@wordpress/data';\nimport { useEntityProp } from '@wordpress/core-data';\nimport { useBlockProps } from '@wordpress/block-editor';\n\nregisterBlockType( 'myguten/meta-block', {\n    edit: ( { setAttributes, attributes } ) =&gt; {\n        const blockProps = useBlockProps();\n        const postType = useSelect(\n            ( select ) =&gt; select( 'core/editor' ).getCurrentPostType(),\n            []\n        );\n\n        const [ meta, setMeta ] = useEntityProp( 'postType', postType, 'meta' );\n\n        const metaFieldValue = meta[ 'myguten_meta_block_field' ];\n        const updateMetaValue = ( newValue ) =&gt; {\n            setMeta( { ...meta, myguten_meta_block_field: newValue } );\n        };\n\n        return (\n            &lt;div { ...blockProps }&gt;\n                &lt;TextControl\n                    __nextHasNoMarginBottom\n                    __next40pxDefaultSize               \n                    label=\"Meta Block Field\"\n                    value={ metaFieldValue }\n                    onChange={ updateMetaValue }\n                /&gt;\n            &lt;/div&gt;\n        );\n    },\n\n    // No information saved to the block.\n    // Data is saved to post meta via the hook.\n    save: () =&gt; {\n        return null;\n    },\n} );\n</code></pre>\n<p>Confirm this works by creating a post and add the Meta Block. You will see your field that you can type a value in. When you save the post, either as a draft or published, the post meta value will be saved too. You can verify by saving and reloading your draft, the form will still be filled in on reload.</p>\n<p>You could also confirm the data is saved by checking the database table <code>wp_postmeta</code> and confirm the new post id contains the new field data.</p>\n<p><strong>Troubleshooting</strong>: Be sure to build your code between changes, you updated the PHP code from Step 1, and JavaScript files are enqueued. Check the build output and developer console for errors.</p>\n<h3>Step 3: Use post meta data</h3>\n<p>You can use the post meta data stored in the last step in multiple ways.</p>\n<h4>Use post meta in PHP</h4>\n<p>The first example uses the value from the post meta field and appends it to the end of the post content wrapped in a <code>H4</code> tag.</p>\n<pre><code class=\"language-php\">function myguten_content_filter( $content ) {\n    $value = get_post_meta( get_the_ID(), 'myguten_meta_block_field', true );\n    if ( $value ) {\n        return sprintf( \"%s &lt;h4&gt; %s &lt;/h4&gt;\", $content, esc_html( $value ) );\n    } else {\n        return $content;\n    }\n}\nadd_filter( 'the_content', 'myguten_content_filter' );\n</code></pre>\n<h4>Use post meta in a block</h4>\n<p>You can also use the post meta data in other blocks. For this example the data is loaded at the end of every Paragraph block when it is rendered, ie. shown to the user. You can replace this for any core or custom block types as needed.</p>\n<p>In PHP, use the <a href=\"https://developer.wordpress.org/reference/functions/register_block_type/\">register_block_type</a> function to set a callback when the block is rendered to include the meta value.</p>\n<pre><code class=\"language-php\">function myguten_render_paragraph( $block_attributes, $content ) {\n    $value = get_post_meta( get_the_ID(), 'myguten_meta_block_field', true );\n    // check value is set before outputting\n    if ( $value ) {\n        return sprintf( \"%s (%s)\", $content, esc_html( $value ) );\n    } else {\n        return $content;\n    }\n}\n\nregister_block_type( 'core/paragraph', array(\n    'api_version' =&gt; 3,\n    'render_callback' =&gt; 'myguten_render_paragraph',\n) );\n</code></pre>\n<h3>Step 4: Use block templates (optional)</h3>\n<p>One problem using a meta block is the block is easy for an author to forget, since it requires being added to each post. You solve this by using <a href=\"https://developer.wordpress.org/block-editor/reference-guides/block-api/block-templates/\">block templates</a>. A block template is a predefined list of block items per post type. Templates allow you to specify a default initial state for a post type.</p>\n<p>For this example, you use a template to automatically insert the meta block at the top of a post.</p>\n<p>Add the following code to the <code>myguten-meta-block.php</code> file:</p>\n<pre><code class=\"language-php\">function myguten_register_template() {\n    $post_type_object = get_post_type_object( 'post' );\n    $post_type_object-&gt;template = array(\n        array( 'myguten/meta-block' ),\n    );\n}\nadd_action( 'init', 'myguten_register_template' );\n</code></pre>\n<p>You can also add other block types in the array, including placeholders, or even lock down a post to a set of specific blocks. Templates are a powerful tool for controlling the editing experience, see the documentation linked above for more.</p>\n<h2>Conclusion</h2>\n<p>This guide showed how using blocks you can read and write to post meta. See the section below for backward compatibility with existing meta boxes.</p>\n<h2>Backward compatibility</h2>\n<h3>Testing, converting, and maintaining existing meta boxes</h3>\n<p>Before converting meta boxes to blocks, it may be easier to test if a meta box works with the block editor, and explicitly mark it as such.</p>\n<p>If a meta box <em>doesn&#8217;t</em> work with the block editor, and updating it to work correctly is not an option, the next step is to add the <code>__block_editor_compatible_meta_box</code> argument to the meta box declaration:</p>\n<pre><code class=\"language-php\">add_meta_box( 'my-meta-box', 'My Meta Box', 'my_meta_box_callback',\n    null, 'normal', 'high',\n    array(\n        '__block_editor_compatible_meta_box' =&gt; false,\n    )\n);\n</code></pre>\n<p>WordPress won&#8217;t show the meta box but a message saying that it isn&#8217;t compatible with the block editor, including a link to the Classic Editor plugin. By default, <code>__block_editor_compatible_meta_box</code> is <code>true</code>.</p>\n<p>After a meta box is converted to a block, it can be declared as existing for backward compatibility:</p>\n<pre><code class=\"language-php\">add_meta_box( 'my-meta-box', 'My Meta Box', 'my_meta_box_callback',\n    null, 'normal', 'high',\n    array(\n        '__back_compat_meta_box' =&gt; true,\n    )\n);\n</code></pre>\n<p>When the block editor is used, this meta box will no longer be displayed in the meta box area, as it now only exists for backward compatibility purposes. It will display as before in the classic editor.</p>\n<h3>Meta box data collection</h3>\n<p>On each block editor page load, we register an action that collects the meta box data to determine if an area is empty. The original global state is reset upon collection of meta box data.</p>\n<p>See <a href=\"https://developer.wordpress.org/reference/functions/register_and_do_post_meta_boxes/\"><code>register_and_do_post_meta_boxes</code></a>.</p>\n<p>It will run through the functions and hooks that <code>post.php</code> runs to register meta boxes; namely <code>add_meta_boxes</code>, <code>add_meta_boxes_{$post-&gt;post_type}</code>, and <code>do_meta_boxes</code>.</p>\n<p>Meta boxes are filtered to strip out any core meta boxes, standard custom taxonomy meta boxes, and any meta boxes that have declared themselves as only existing for backward compatibility purposes.</p>\n<p>Then each location for this particular type of meta box is checked for whether it is active. If it is not empty a value of true is stored, if it is empty a value of false is stored. This meta box location data is then dispatched by the editor Redux store in <code>INITIALIZE_META_BOX_STATE</code>.</p>\n<p>Ideally, this could be done at instantiation of the editor and help simplify this flow. However, it is not possible to know the meta box state before <code>admin_enqueue_scripts</code>, where we are calling <code>initializeEditor()</code>. This will have to do, unless we want to move <code>initializeEditor()</code> to fire in the footer or at some point after <code>admin_head</code>. With recent changes to editor bootstrapping this might now be possible. Test with ACF to make sure.</p>\n<h3>Redux and React meta box management</h3>\n<p>When rendering the block editor, the meta boxes are rendered to a hidden div <code>#metaboxes</code>.</p>\n<p><em>The Redux store will hold all meta boxes as inactive by default</em>. When<br />\n<code>INITIALIZE_META_BOX_STATE</code> comes in, the store will update any active meta box areas by setting the <code>isActive</code> flag to <code>true</code>. Once this happens React will check for the new props sent in by Redux on the <code>MetaBox</code> component. If that <code>MetaBox</code> is now active, instead of rendering null, a <code>MetaBoxArea</code> component will be rendered. The <code>MetaBox</code> component is the container component that mediates between the <code>MetaBoxArea</code> and the Redux Store. <em>If no meta boxes are active, nothing happens. This will be the default behavior, as all core meta boxes have been stripped.</em></p>\n<h4>MetaBoxArea component</h4>\n<p>When the component renders it will store a reference to the meta boxes container and retrieve the meta boxes HTML from the prefetch location.</p>\n<p>When the post is updated, only meta box areas that are active will be submitted. This prevents unnecessary requests. No extra revisions are created by the meta box submissions. A Redux action will trigger on <code>REQUEST_POST_UPDATE</code> for any active meta box. See <code>editor/effects.js</code>. The <code>REQUEST_META_BOX_UPDATES</code> action will set that meta box&#8217;s state to <code>isUpdating</code>. The <code>isUpdating</code> prop will be sent into the <code>MetaBoxArea</code> and cause a form submission.</p>\n<p>When the meta box area is saving, we display an updating overlay, to prevent users from changing the form values while a save is in progress.</p>\n<p>An example save url would look like:</p>\n<p><code>example.org/wp-admin/post.php?post=1&amp;action=edit&amp;meta-box-loader=1</code></p>\n<p>This url is automatically passed into React via a <code>_wpMetaBoxUrl</code> global variable.</p>\n<p>This page mimics the <code>post.php</code> post form, so when it is submitted it will fire all of the normal hooks and actions, and have the proper global state to correctly fire any PHP meta box mumbo jumbo without needing to modify any existing code. On successful submission, React will signal a <code>handleMetaBoxReload</code> to remove the updating overlay.</p>\n<h3>Common compatibility issues</h3>\n<p>Most PHP meta boxes should continue to work in the block editor, but some meta boxes that include advanced functionality could break. Here are some common reasons why meta boxes might not work as expected in the block editor:</p>\n<ul>\n<li>Plugins relying on selectors that target the post title, post content fields, and other metaboxes (of the old editor).</li>\n<li>Plugins relying on TinyMCE&#8217;s API because there&#8217;s no longer a single TinyMCE instance to talk to in the block editor.</li>\n<li>Plugins making updates to their DOM on &#8220;submit&#8221; or on &#8220;save&#8221;.</li>\n</ul>\n<p>Please also note that if your plugin triggers a PHP warning or notice to be output on the page, this will cause the HTML document type (<code>&lt;!DOCTYPE html&gt;</code>) to be output incorrectly. This will cause the browser to render using &#8220;Quirks Mode&#8221;, which is a compatibility layer that gets enabled when the browser doesn&#8217;t know what type of document it is parsing. The block editor is not meant to work in this mode, but it can <em>appear</em> to be working just fine. If you encounter issues such as <em>meta boxes overlaying the editor</em> or other layout issues, please check the raw page source of your document to see that the document type definition is the first thing output on the page. There will also be a warning in the JavaScript console, noting the issue.</p>\n<h2>Additional resources</h2>\n<ul>\n<li><a href=\"https://developer.wordpress.org/news/2023/03/03/creating-a-custom-block-that-stores-post-meta/\">Creating a custom block that stores post meta</a></li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 134350,
    "menu_order": 45,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-138642",
        "blocks-handbook",
        "type-blocks-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/138642",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/blocks-handbook"
            }
        ],
        "version-history": [
            {
                "count": 12,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/138642/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155763,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/138642/revisions/155763"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/blocks-handbook/134350"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=138642"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}