{
    "id": 11153,
    "date": "2014-10-19T18:02:46",
    "date_gmt": "2014-10-19T18:02:46",
    "guid": {
        "rendered": "http://developer.wordpress.org/?post_type=plugin-handbook&#038;p=11153"
    },
    "modified": "2024-11-24T13:04:09",
    "modified_gmt": "2024-11-24T13:04:09",
    "slug": "enqueuing",
    "status": "publish",
    "type": "plugin-handbook",
    "link": "https://developer.wordpress.org/plugins/javascript/enqueuing/",
    "title": {
        "rendered": "Server Side PHP and Enqueuing"
    },
    "content": {
        "rendered": "\n<p>There are two parts to the server side PHP script that are needed to implement AJAX communication. First we need to enqueue the jQuery script on the web page and localize any PHP values that the jQuery script needs. Second is the actual handling of the AJAX request.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Enqueue Script</h2>\n\n\n\n<p>This section covers the two major quirks of AJAX in WordPress that trip up experienced coders new to WordPress. One is the need to enqueue scripts in order to get meta links to appear correctly in the page&#8217;s head section. The other is that <strong>all</strong> AJAX requests need to be sent through <code>wp-admin/admin-ajax.php</code>. Never send requests directly to your plugin pages.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Enqueue</h3>\n\n\n\n<p>Use the function <code><a href=\"https://developer.wordpress.org/reference/functions/wp_enqueue_script/\">wp_enqueue_script()</a></code> to get WordPress to insert a meta link to your script in the page&#8217;s section. Never hardcode such links in the header template. As a plugin developer, you do not have ready access to the header template, but this rule bears mentioning anyway.</p>\n\n\n\n<p>The enqueue function accepts five parameters as follows:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>$handle</strong> is the name for the script.</li>\n\n\n\n<li><strong>$src</strong> defines where the script is located. For portability, use <code>plugins_url()</code> to build the proper URL. If you are enqueuing the script for something besides a plugin, use some related function to create a proper URL – never hardcode it</li>\n\n\n\n<li><strong>$deps</strong> is an array that can handle any script that your new script depends on, such as jQuery. Since we are using jQuery to send an AJAX request, you will at least need to list <code>'jquery'</code> in the array.</li>\n\n\n\n<li><strong>$ver</strong> lets you list a version number.</li>\n\n\n\n<li><strong>$args</strong> an array of arguments that define footer printing (via an <code>in_footer</code> key) and script loading strategies (via a <code>strategy</code> key) such as <code>defer</code> or <code>async</code>. This replaces/overloads the <code>$in_footer</code> parameter as of WordPress version 6.3.</li>\n</ul>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">wp_enqueue_script(\n\t'ajax-script',\n\tplugins_url( '/js/myjquery.js', __FILE__ ),\n\tarray( 'jquery' ),\n\t'1.0.,0',\n\tarray(\n\t   'in_footer' =&gt; true,\n\t)\n);</code></pre>\n\n\n\n<p>You cannot enqueue scripts directly from your plugin code page when it is loaded. Scripts must be enqueued from one of a few action hooks &#8211; which one depends on what sort of page the script needs to be linked to. For administration pages, use <code>admin_enqueue_scripts</code>. For front-end pages use <code>wp_enqueue_scripts</code>, except for the login page, in which case use <code>login_enqueue_scripts</code>.</p>\n\n\n\n<p>The <code>admin_enqueue_scripts</code> hook passes the current page filename to your callback. Use this information to only enqueue your script on pages where it is needed. The front-end version does not pass anything. In that case, use template tags such as <code>is_home()</code>, <code>is_single()</code>, etc. to ensure that you only enqueue your script where it is needed. This is the complete enqueue code for our example:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">add_action( 'admin_enqueue_scripts', 'my_enqueue' );\nfunction my_enqueue( $hook ) {\n\tif ( 'myplugin_settings.php' !== $hook ) {\n\t\treturn;\n\t}\n\twp_enqueue_script(\n\t\t'ajax-script',\n\t\tplugins_url( '/js/myjquery.js', __FILE__ ),\n\t\tarray( 'jquery' ),\n\t\t'1.0.0',\n\t\tarray(\n\t\t   'in_footer' =&gt; true,\n\t\t)\n\t);\n}</code></pre>\n\n\n\n<p>Why do we use a named function here but use anonymous functions with jQuery? Because closures are only recently supported by PHP. jQuery has supported them for quite some time. Since some people may still be running older versions of PHP, we always use named functions for maximum compatibility. If you have a recent PHP version and are developing only for your own installation, go ahead and use closures if you like.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Register vs. Enqueue</h4>\n\n\n\n<p>You will see examples in other tutorials that religiously use <code><a href=\"https://developer.wordpress.org/reference/functions/wp_register_script/\">wp_register_script()</a></code>. This is fine, but its use is optional. What is not optional is <code>wp_enqueue_script()</code>. This function must be called in order for your script file to be properly linked on the web page. So why register scripts? It creates a useful tag or handle with which you can easily reference the script in various parts of your code as needed. If you just need your script loaded and are not referencing it elsewhere in your code, there is no need to register it.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Delayed Script Loading</h4>\n\n\n\n<p>WordPress provides support for specifying a script loading strategy via the <code>wp_register_script()</code> and <code>wp_enqueue_script()</code> functions, by way of the <code>strategy</code> key within the new <code>$args</code> array parameter introduced in WordPress 6.3.</p>\n\n\n\n<p>Supported strategies are as follows:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>defer</strong>\n<ul class=\"wp-block-list\">\n<li>Added by specifying an array key value pair of <code>'strategy' =&gt; 'defer'</code> to the $args parameter.</li>\n\n\n\n<li>Scripts marked for deferred execution — via the defer script attribute — are only executed once the DOM tree has fully loaded (but before the <code>DOMContentLoaded</code> and window load events). Deferred scripts are executed in the same order they were printed/added in the DOM, unlike asynchronous scripts.</li>\n</ul>\n</li>\n\n\n\n<li><strong>async</strong>\n<ul class=\"wp-block-list\">\n<li>Added by specifying an array key value pair of <code>'strategy' =&gt; 'async'</code> to the <code>$args</code> parameter.</li>\n\n\n\n<li>Scripts marked for asynchronous execution — via the <code>async</code> script attribute — are executed as soon as they are loaded by the browser. Asynchronous scripts do not have a guaranteed execution order, as script B (although added to the DOM after script A) may execute first given that it may complete loading prior to script A. Such scripts may execute either before the DOM has been fully constructed or after the <code>DOMContentLoaded</code> event.</li>\n</ul>\n</li>\n</ul>\n\n\n\n<p>Following is an example of specifying a loading strategy for an additional script enqueue within our plugin:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">wp_register_script(\n    'ajax-script-two',\n    plugins_url( '/js/myscript.js', __FILE__ ),\n    array( ajax-script ),\n    '1.0.,0',\n    array(\n          'strategy' =&gt; 'defer',\n     )\n);</code></pre>\n\n\n\n<p>The same approach applies when using <code>wp_enqueue_script()</code>. In the example above, we indicate that we intend to load the <code>'ajax-script-two'</code> script in a deferred manner.</p>\n\n\n\n<p>When specifying a delayed script loading strategy, consideration of the script’s dependency tree (its dependencies and/or dependents) is taken into account when deciding on an “eligible strategy” so as not to result in application of a strategy that is valid for one script but detrimental to others in the tree by causing an unintended out of order of execution. As a result of such logic, the intended loading strategy that you pass via the <code>$args</code> parameter may not be the final (chosen) strategy, but it will never be detrimental to (or stricter than) the intended strategy.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Nonce</h3>\n\n\n\n<p>You need to create a nonce so that the jQuery AJAX request can be validated as a legitimate request instead of a potentially nefarious request from some unknown bad actor. Only your PHP script and your jQuery script will know this value. When the request is received, you can verify it is the same value created here. This is how to create a nonce for our example:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">$title_nonce = wp_create_nonce( 'title_example' );</code></pre>\n\n\n\n<p>The parameter <code>title_example</code> can be any arbitrary string. It&#8217;s suggested the string be related to what the nonce is used for, but it can really be anything that suits you.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Localize</h3>\n\n\n\n<p>If you recall from the <a href=\"https://developer.wordpress.org/plugins/javascript/jquery/\">jQuery Section</a>, data created by PHP for use by jQuery was passed in a global object named <code>my_ajax_obj</code>. In our example, this data was a nonce and the complete URL to <code>admin-ajax.php</code>. The process of assigning object properties and creating the global jQuery object is called <strong>localizing</strong>. This is the localizing code used in our example which uses <code><a href=\"https://developer.wordpress.org/reference/functions/wp_localize_script/\">wp_localize_script()</a></code>.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">wp_localize_script(\n\t'ajax-script',\n\t'my_ajax_obj',\n\tarray(\n\t\t'ajax_url' =&gt; admin_url( 'admin-ajax.php' ),\n\t\t'nonce'    =&gt; $title_nonce,\n\t)\n);</code></pre>\n\n\n\n<p>Note how our script handle <code>ajax-script</code> is used so that the global object is assigned to the right script. The object is global to our script, not to all scripts. Localization can also be called from the same hook that is used to enqueue scripts. The same goes for creating a nonce, though that particular function can be called virtually anywhere. All of that combined together in a single hook callback looks like this:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">add_action( 'admin_enqueue_scripts', 'my_enqueue' );\n\n/**\n * Enqueue my scripts and assets.\n *\n * @param $hook\n */\nfunction my_enqueue( $hook ) {\n\tif ( 'myplugin_settings.php' !== $hook ) {\n\t\treturn;\n\t}\n\twp_enqueue_script(\n\t\t'ajax-script',\n\t\tplugins_url( '/js/myjquery.js', __FILE__ ),\n\t\tarray( 'jquery' ),\n\t\t'1.0.0',\n\t\ttrue\n\t);\n\n\twp_localize_script(\n\t\t'ajax-script',\n\t\t'my_ajax_obj',\n\t\tarray(\n\t\t\t'ajax_url' =&gt; admin_url( 'admin-ajax.php' ),\n\t\t\t'nonce'    =&gt; wp_create_nonce( 'title_example' ),\n\t\t)\n\t);\n}</code></pre>\n\n\n\n<div class=\"wp-block-wporg-notice is-info-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\"> Remember to only add this nonce localization to the needed pages, do not display a nonce to someone who should not use it. And remember to use <code>current_user_can()</code> with a capability or role to complete the security.</div></div>\n\n\n\n\n<h2 class=\"wp-block-heading\">AJAX Action</h2>\n\n\n\n<p>The other major part of the server side PHP code is the actual AJAX handler that receives the POSTed data, does something with it, then sends an appropriate response back to the browser. This takes on the form of a WordPress <a href=\"https://developer.wordpress.org/plugins/hooks/actions/\">action hook</a>. Which hook tag you use depends on whether the user is logged in or not and what value your jQuery script passed as the <em>action:</em> value.</p>\n\n\n\n<div class=\"wp-block-wporg-notice is-info-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\"> <strong>$_GET , $_POST and $_COOKIE vs $_REQUEST</strong></p>\n<p>You&#8217;ve probably used one or more of the PHP super globals such as <code>$_GET</code> or <code>$_POST</code> to retrieve values from forms or cookies (using <code>$_COOKIE</code>). Maybe you prefer <code>$_REQUEST</code> instead, or at least have seen it used. It&#8217;s kind of cool &#8211; regardless of the request method, <code>POST</code> or <code>GET</code>, it will have the form values. Works great for pages that use both methods. On top of that, it has cookie values as well. One stop shopping! Therein lies its tragic flaw. In the case of a name conflict, the cookie value will override any form values. Thus it is ridiculously easy for a bad actor to craft a counterfeit cookie on their browser, which will overwrite any form value you might be expecting from the request. <code>$_REQUEST</code> is an easy route for hackers to inject arbitrary data into your form values. To be extra safe, stick to the specific variables and avoid the one size fits all.</div></div>\n\n\n\n\n<p>Since our AJAX exchange is for the plugin&#8217;s settings page, the user must be logged in. If you recall from the <a href=\"https://developer.wordpress.org/plugins/javascript/jquery/\">jQuery section</a>, the <code>action:</code> value is <code>\"my_tag_count\"</code>. This means our action hook tag will be <code>wp_ajax_my_tag_count</code>. If our AJAX exchange were to be utilized by users who were not currently logged in, the action hook tag would be <code>wp_ajax_nopriv_my_tag_count</code> The basic code used to hook the action looks like this:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">add_action( 'wp_ajax_my_tag_count', 'my_ajax_handler' );\n\n/**\n * Handles my AJAX request.\n */\nfunction my_ajax_handler() {\n\t// Handle the ajax request here\n\n\twp_die(); // All ajax handlers die when finished\n}</code></pre>\n\n\n\n<p>The first thing your AJAX handler should do is verify the nonce sent by jQuery with <code><a href=\"https://developer.wordpress.org/reference/functions/check_ajax_referer/\">check_ajax_referer()</a></code>, which should be the same value that was localized when the script was enqueued.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">check_ajax_referer( 'title_example' );</code></pre>\n\n\n\n<p>The provided parameter must be identical to the parameter provided <a href=\"#php-nonce\">earlier</a> to <code>wp_create_nonce()</code>. The function simply dies if the nonce does not check out. If this were a true nonce, now that it was used, the value is no longer any good. You would then generate a new one and send it to the callback script so that it can be used for the next request. But since WordPress nonces are good for twenty-four hours, you needn&#8217;t do anything but check it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Data</h3>\n\n\n\n<p>With the nonce out of the way, our handler can deal with the data sent by the jQuery script contained in <code>$_POST['title']</code>. First we assign the value to a new variable, after running it through <a href=\"https://developer.wordpress.org/reference/functions/wp_unslash/\">wp_unslash()</a> to remove any unexpected quotes.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">$title = wp_unslash( $_POST['title'] );</code></pre>\n\n\n\n<p>We can save the user&#8217;s selection in user meta by using <a href=\"https://developer.wordpress.org/reference/functions/update_user_meta/\">update_user_meta()</a>.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">update_user_meta( get_current_user_id(), 'title_preference', sanitize_post_title( $title ) );</code></pre>\n\n\n\n<p>Then we build a query in order to get the post count for the selected title tag.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">$args      = array(\n\t'tag' =&gt; $title,\n);\n$the_query = new WP_Query( $args );</code></pre>\n\n\n\n<p>Finally we can send the response back to the jQuery script. There&#8217;s several ways to transmit data. Let&#8217;s look at some of the options before we deal with the specifics of our example.</p>\n\n\n\n<h4 class=\"wp-block-heading\">XML</h4>\n\n\n\n<p>PHP support for XML leaves something to be desired. Fortunately, WordPress provides the <code><a href=\"https://developer.wordpress.org/reference/classes/wp_ajax_response/\">WP_Ajax_Response</a></code> class to make the task easier. The <a href=\"https://developer.wordpress.org/reference/classes/wp_ajax_response/\" rel=\"class\">WP_Ajax_Response</a> class will generate an XML-formatted response, set the correct content type for the header, output the response xml, then die — ensuring a proper XML response.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"json\">JSON</h4>\n\n\n\n<p>This format is lightweight and easy to use, and WordPress provides the <code><a href=\"https://developer.wordpress.org/reference/functions/wp_send_json/\">wp_send_json</a></code> function to json-encode your response, print it, and die — effectively replacing <a href=\"https://developer.wordpress.org/reference/classes/wp_ajax_response/\" rel=\"class\">WP_Ajax_Response</a>. WordPress also provides the <code><a href=\"https://developer.wordpress.org/reference/functions/wp_send_json_success/\">wp_send_json_success</a></code> and <code><a href=\"https://developer.wordpress.org/reference/functions/wp_send_json_error/\">wp_send_json_error</a></code> functions, which allow the appropriate done() or fail() callbacks to fire in JS.</p>\n\n\n\n<h4 class=\"wp-block-heading\">Other</h4>\n\n\n\n<p>You can transfer data any way you like, as long as the sender and receiver are coordinated. Text formats like comma delimited or tab delimited are one of many possibilities. For small amounts of data, sending the raw stream may be adequate. That is what we will do with our example &#8211; we will send the actual replacement HTML, nothing else.</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">echo esc_html( $title ) . ' (' . $the_query-&gt;post_count . ') ';</code></pre>\n\n\n\n<p>In a real world application, you must account for the possibility that the action could fail for some reason&#8211;for instance, maybe the database server is down. The response should allow for this contingency, and the jQuery script receiving the response should act accordingly, perhaps telling the user to try again later.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Die</h3>\n\n\n\n<p>When the handler has finished all of its tasks, it needs to die. If you are using the <a href=\"https://developer.wordpress.org/reference/classes/wp_ajax_response/\" rel=\"class\">WP_Ajax_Response</a> or wp_send_json* functions, this is automatically handled for you. If not, simply use the WordPress <code><a href=\"https://developer.wordpress.org/reference/functions/wp_die/\">wp_die()</a> </code>function.</p>\n\n\n\n<h3 class=\"wp-block-heading\">AJAX Handler Summary</h3>\n\n\n\n<p>The complete AJAX handler for our example looks like this:</p>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">/**\n * AJAX handler using JSON\n */\nfunction my_ajax_handler__json() {\n\tcheck_ajax_referer( 'title_example' );\n\t$title = wp_unslash( $_POST['title'] );\n\n\tupdate_user_meta( get_current_user_id(), 'title_preference', sanitize_post_title( $title ) );\n\n\t$args      = array(\n\t\t'tag' =&gt; $title,\n\t);\n\t$the_query = new WP_Query( $args );\n\twp_send_json( esc_html( $title ) . ' (' . $the_query-&gt;post_count . ') ' );\n}</code></pre>\n\n\n\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php\">/**\n * AJAX handler not using JSON.\n */\nfunction my_ajax_handler() {\n\tcheck_ajax_referer( 'title_example' );\n\t$title = wp_unslash( $_POST['title'] );\n\n\tupdate_user_meta( get_current_user_id(), 'title_preference', sanitize_post_title( $title ) );\n\n\t$args      = array(\n\t\t'tag' =&gt; $title,\n\t);\n\t$the_query = new WP_Query( $args );\n\techo esc_html( $title ) . ' (' . $the_query-&gt;post_count . ') ';\n\twp_die(); // All ajax handlers should die when finished\n}</code></pre>\n",
        "protected": false
    },
    "author": 12560283,
    "featured_media": 0,
    "parent": 11151,
    "menu_order": 3,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-11153",
        "plugin-handbook",
        "type-plugin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11153",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/plugin-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/12560283"
            }
        ],
        "version-history": [
            {
                "count": 23,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11153/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155818,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11153/revisions/155818"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11151"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=11153"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}