{
    "id": 39010,
    "date": "2018-10-12T18:51:43",
    "date_gmt": "2018-10-12T18:51:43",
    "guid": {
        "rendered": "https://developer.wordpress.org/?post_type=plugin-handbook&#038;p=39010"
    },
    "modified": "2024-03-11T19:36:04",
    "modified_gmt": "2024-03-11T19:36:04",
    "slug": "using-the-forums",
    "status": "publish",
    "type": "plugin-handbook",
    "link": "https://developer.wordpress.org/plugins/wordpress-org/using-the-forums/",
    "title": {
        "rendered": "Using the Forums"
    },
    "content": {
        "rendered": "\n<p>With the free plugin hosting, all plugin developers are given access to use the support forums and the reviews to help manage their plugins.</p>\n\n\n\n<p>Developers are required to comply with the <a href=\"https://wordpress.org/support/guidelines/\">forum guidelines</a>&nbsp;while using the forums, which can lead to some confusion about how to manage premium versions of plugins.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The guidelines apply to everyone</h2>\n\n\n\n<p>The plugin owner is the ultimate controller of the plugin. However, if the other developers or support reps violate the guideline, the plugin is at risk for censure and closure. It is not the responsibility of the forum or plugin teams to manage your company/employees. If a support rep is making sock puppets, the plugin developers will be notified and expected to take action. If they cannot, or will not, restrain their coworkers, we will cease to host their plugins and may ban the company.</p>\n\n\n\n<p><strong><em>Everyone</em></strong> has to abide by the guidelines. No exceptions.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The directory is not a marketplace</h2>\n\n\n\n<p>The plugin directory and forums are not for you to sell or support products that are not hosted here.&nbsp;If the only reason you have a plugin in our systems is for your business promotion, you must understand that there are no special considerations granted to anyone for that.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Users are not customers</h2>\n\n\n\n<p>Users on WordPress.org are not your customers and should be treated as users. This means you <em>cannot</em> ask them for private contact information, you cannot offer to log in to their site, and you cannot charge them for help. It is for your own legal protection, we prohibit those things. Even with the contract of a purchase, you are liable for damages caused by your logging into their site. Doing so without the purchase makes it more dangerous.</p>\n\n\n\n<p>If someone is a customer (that is they purchased your premium offering and posted in the free forums),&nbsp;you can and should remind them that you cannot support them in the WordPress.org forums, and provide a link to your professional support services. Similarly, you can tell people that you aren&#8217;t able to offer free support in the forums and link to your site where you can explain in full detail.</p>\n\n\n\n<h2 class=\"wp-block-heading\">You may request users open tickets on your own system</h2>\n\n\n\n<p>This is especially true if you have a service that requires an account. There is already a pre-existing relationship with the user, and asking them to open a ticket for support of services is reasonable and permitted. You may also ask them to open a ticket if they&#8217;re an actual paying customer.</p>\n\n\n\n<p>If you want to offer a higher level of support as a service (i.e. something they pay for), it&#8217;s acceptable to tell users that they have reached the limit of what you can support for free. In those situations, we recommend you have this disclosed in your readme with a dedicated page on your site to explain in detail what is and is not available for free help.</p>\n\n\n\n<p>For everyone else,&nbsp;if you&#8217;re helping people in the free forums, you are expected to help them <em>in</em> the forums.</p>\n\n\n\n<h2 class=\"wp-block-heading\">You are <em>not</em> required to offer free support</h2>\n\n\n\n<p>If you don&#8217;t want to offer free support, you don&#8217;t have to. We strongly recommend you make that clear in your readme (preferably at the top of the description so its hard to miss), and we will back you up on this.</p>\n\n\n\n<p>Keep in mind, people leaving you bad reviews because of that won&#8217;t be removed. You can reply to the reviews and explain why you don&#8217;t offer support, of course, and that you did disclose that fact.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Reviews of premium versions are permitted (within reason)</h2>\n\n\n\n<p>This can be confusing. </p>\n\n\n\n<p>We believe users have the right to leave a review that includes details about a premium version of a plugin provided the following are true:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>The plugin itself upsells/promotes the premium version either within the readme or the plugin settings page</li>\n\n\n\n<li>The review contains details about the functionality/usability of the plugin </li>\n\n\n\n<li>The review is <strong>not</strong> only a complaint about upselling</li>\n\n\n\n<li>The review does <strong>not</strong> contain harassment, abuse, vulgarities, or other attacks towards the developer</li>\n\n\n\n<li>The review is <strong>not</strong> about a premium-only plugin that is not hosted (whole or in part) on WordPress.org</li>\n</ol>\n\n\n\n<p>We do not tolerate abuse or harassment towards developers any more than we do towards users. That said, negative reviews are not, in and of themselves, always abusive. Sometimes people just don&#8217;t like your plugins, and that&#8217;s okay.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Multiple accounts for a company are permitted (within reason)</h2>\n\n\n\n<p>The real issue here is that users don&#8217;t like talking to &#8220;MarvelTech100&#8221; as much as they like to talk to Carol Danvers. Faceless automatons are hard to connect with. </p>\n\n\n\n<p>That said, having a company account to own your plugin is perfectly logical and reasonable. However in those situations, the account is only intended to be the <strong>owner</strong> of the plugins/themes, and is <strong>not</strong> permitted to use the forums.</p>\n\n\n\n<p>If you want to have two accounts, where one is your personal account and the other is &#8220;You at the company&#8221; that&#8217;s totally fine. People just prefer talking to people.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Sharing accounts is&nbsp;not permitted</h2>\n\n\n\n<p>Related to that, don&#8217;t share accounts. It causes confusion, drama, and makes it very difficult to unravel who you are if someone on your team violates the guidelines. It never ends well.</p>\n",
        "protected": false
    },
    "author": 71562,
    "featured_media": 0,
    "parent": 11185,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-39010",
        "plugin-handbook",
        "type-plugin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/39010",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/plugin-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/71562"
            }
        ],
        "version-history": [
            {
                "count": 8,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/39010/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 152718,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/39010/revisions/152718"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11185"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=39010"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}