{
    "id": 22396,
    "date": "2021-08-26T21:35:26",
    "date_gmt": "2021-08-26T21:35:26",
    "guid": {
        "rendered": "https://developer.wordpress.org/?post_type=plugin-handbook&#038;p=22396"
    },
    "modified": "2024-07-19T19:53:41",
    "modified_gmt": "2024-07-19T19:53:41",
    "slug": "requests",
    "status": "publish",
    "type": "plugin-handbook",
    "link": "https://developer.wordpress.org/plugins/rest-api/requests/",
    "title": {
        "rendered": "Requests"
    },
    "content": {
        "rendered": "<h2>Overview</h2>\r\nThe REST API is very simple in many ways. There is input, known as the request. The input is interpreted by the server and output is created. The output, is known as the response. In some ways, you can think of a request to the WordPress REST API as a set of directions or instructions that should be carried out and interpreted by the API. By default, the WordPress REST API is intended to use HTTP requests as its request medium. HTTP is the foundation for communication of data over the internet, which makes the WordPress REST API a very far reaching API. Requests in the API utilize a lot of the different aspects present in HTTP requests like URIs, HTTP methods, headers, and parameters. The data structure of a request is conveniently handled by the <code>WP_REST_Request</code> class.\r\n<h2><a href=\"https://developer.wordpress.org/reference/classes/wp_rest_request/\" rel=\"class\">WP_REST_Request</a></h2>\r\nThis class is one of the three main infrastructure classes introduced in WordPress 4.4. When an HTTP request is made to an endpoint of the API, the API will automatically create an instance of the <code>WP_REST_Request</code> class, matching the provided data. The response object is auto-generated in <code>WP_REST_Server</code>&#8216;s <code>serve_request()</code> method. Once the request is created and authentication is checked, the request is dispatched and our endpoint callbacks begin to be fired. All of the data stored up in the <code>WP_REST_Request</code> object is passed into our callbacks for our registered endpoints. So both our <code>permissions_callback</code> and <code>callback</code> are called with the request object being passed in. This enables us to access the various request properties in our callbacks, so that we can tailor our responses to match the desired output.\r\n<h2>Request Properties</h2>\r\nRequest objects have many different properties, each of which can be used in various ways. The main properties are the request method, route, headers, parameters and attributes. Let&#8217;s break each of these down into their role in a request. If you were to create a request object yourself it would look like this:\r\n\r\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php \">$request = new WP_REST_Request( 'GET', '/my-namespace/v1/examples' );</code></pre>\r\n\r\nIn the above code sample we are only specifying that the request object method is <code>GET</code> and we should be matching the route <code>/my-namespace/v1/examples</code> which in the context of an entire URL would look like this: <code>https://ourawesomesite.com/wp-json/my-namepsace/v1/examples</code>. The method and route arguments for the <code>WP_REST_Request</code> constructor are used to map the request to the desired endpoint. If the request is made to an endpoint that is not registered then a helpful 404 error message is returned in the response. Let&#8217;s look at the various properties in more depth.\r\n<h3>Method</h3>\r\nThe method property of a request object by default matches the HTTP Request method. The method in most cases will be one of <code>GET</code>, <code>POST</code>, <code>PUT</code>, <code>DELETE</code>, <code>OPTIONS</code>, or <code>HEAD</code>. These methods will be used to match the various endpoints registered to a route. When the API finds a match for the method and route it will fire the callbacks for that endpoint.\r\n\r\nThe following convention is a best practice for matching HTTP methods: <code>GET</code> for read only tasks, <code>POST</code> for creation, <code>PUT</code> for updating, and <code>DELETE</code> for deleting. The request method acts as an indicator for the expected functionality of your endpoints. When you make a <code>GET</code> request to a route, you should expect to be returned read only data.\r\n<h3>Route</h3>\r\nThe route for a request, by default, will match the server environment variable for path info; <code>$_SERVER['PATH_INFO']</code>. When you make an HTTP request to a route of the WordPress REST API, the generated <code>WP_REST_Request</code> object will be made to match that path, which will hopefully then be matched to a valid endpoint. In short the route for a request is where you want to target your request in the API.\r\n\r\nIf we had registered a books endpoint, using <code>GET</code>, it might live at <code>https://ourawesomesite.com/wp-json/my-namespace/v1/books</code>. If we went to that URL in our browser, we would see our collection of books represented in JSON. WordPress will automatically generate the request object for us and handle all of the routing to match endpoints. So since we don&#8217;t really have to worry about the routing ourselves understanding how to pass extra data we want in our requests is a much more important thing to understand.\r\n<h3>Headers</h3>\r\nHTTP Request headers are simply just extra data about our HTTP request. Request headers can specify caching policy, what our request content is, where the request is coming from and many other things. Request headers do not necessarily interact with our endpoints directly, but the information in the headers helps WordPress know what to do. To pass in data that we want our endpoints to interact with we want to use parameters.\r\n<h3>Parameters</h3>\r\nWhen making requests to the WordPress REST API, most of the additional data passed in will take on the form of parameters. What are parameters? There are four different types in the context of the API. There are route parameters, query parameters, body parameters, and file parameters. Let&#8217;s take a look at each one a bit more in depth.\r\n<h4>URL Params</h4>\r\nURL parameters are automatically generated in a <code>WP_REST_Request</code> from the path variables in the requested route. What does that mean? Let&#8217;s look at this route, which grabs individual books by id: <code>/my-namespace/v1/books/(?P\\d+)</code>. The odd looking <code>(?P\\d+)</code> is a path variable. The name of the path variable is &#8216;<code>id</code>&#8216;.\r\n\r\nIf we were to make a request like <code>GET https://ourawesomesite.com/wp-json/my-namespace/v1/books/5</code>, <code>5</code> will become the value for our <code>id</code> path variable. The <code>WP_REST_Request</code> object will automatically take that path variable and store it as a URL parameter. Now inside of our endpoint callbacks we can interact with that URL parameter really easily. Let&#8217;s look at an example.\r\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php line-numbers\">// Register our individual books endpoint.\r\nfunction prefix_register_book_route() {\r\n    register_rest_route( 'my-namespace/v1', '/books/(?P&lt;id&gt;\\d+)', array(\r\n        // Supported methods for this endpoint. WP_REST_Server::READABLE translates to GET.\r\n        'methods' =&gt; WP_REST_Server::READABLE,\r\n        // Register the callback for the endpoint.\r\n        'callback' =&gt; 'prefix_get_book',\r\n    ) );\r\n}\r\n\r\nadd_action( 'rest_api_init', 'prefix_register_book_route' ); \r\n\r\n/**\r\n * Our registered endpoint callback. Notice how we are passing in $request as an argument.\r\n * By default, the WP_REST_Server will pass in the matched request object to our callback.\r\n *\r\n * @param WP_REST_Request $request The current matched request object.\r\n */\r\nfunction prefix_get_book( $request ) {\r\n    // Here we are accessing the path variable 'id' from the $request.\r\n    $book = prefix_get_the_book( $request['id'] );\r\n    return rest_ensure_response( $book );\r\n}\r\n\r\n// A simple function that grabs a book title from our books by ID.\r\nfunction prefix_get_the_book( $id ) {\r\n    $books = array(\r\n        'Design Patterns',\r\n        'Clean Code',\r\n        'Refactoring',\r\n        'Structure and Interpretation of Computer Programs',\r\n    );\r\n\r\n    $book = &apos;&apos;;\r\n    if ( isset( $books[ $id ] ) ) {\r\n        // Grab the matching book.\r\n        $book = $books[ $id ];\r\n    } else {\r\n        // Error handling.\r\n        return new WP_Error( 'rest_not_found', esc_html__( 'The book does not exist', 'my-text-domain' ), array( 'status' =&gt; 404 ) );\r\n    }\r\n\r\n    return $book;\r\n}</code></pre>\r\nIn the example above we see how path variables are stored as URL parameters in the request object.  We can then access those parameters in our endpoint callbacks. The above example is a pretty common use case for using URL params. Adding too many path variables to a route can slow down the matching of routes and it can also over complicate registering endpoints, it is advised to use URL parameters sparingly. If we aren&#8217;t supposed to use parameters directly in our URL path, then we need another way to pass in extra information to our request.  This is where query and body parameters come in, they will typically do most of the heavy lifting in your API.\r\n<h4>Query Params</h4>\r\nQuery parameters exist in the query string portion of a URI. The query string portion of a URI in <code>https://ourawesomesite.com/wp-json/my-namespace/v1/books?per_page=2&amp;genre=fiction</code> is <code>?per_page=2&amp;genre=fiction</code>. The query string is started by the &#8216;<code>?</code>&#8216; character, the different values within the query string are separated by the &#8216;<code>&amp;</code>&#8216; character. We specified two parameters in our query string; <code>per_page</code> and <code>fiction</code>. In our endpoint we would want to grab only two books from the fiction genre. We could access those values in a callback like this: <code>$request['per_page']</code>, and <code>$request['genre']</code> ( assuming $request is the name of the argument we are using ). If you are familiar with PHP you have probably used query parameters in your web applications.\r\n\r\nIn PHP, the query parameters get stored in the superglobal <code>$_GET</code>. It is important to note that you should never directly access any superglobals or server variables in your endpoints. It is always best to work with what is provided by the <code>WP_REST_Request</code> class. Another common method for passing in variables to an endpoint is to use body parameters.\r\n<h4>Body Params</h4>\r\nBody parameters are key value pairs that are stored in the request body. If you have ever sent a <code>POST</code> request via a <code></code>, through cURL, or some other method, then you have used body parameters. With body parameters you can pass them as different content types as well. The default <code>Content-Type</code> header for a <code>POST</code> request is <code>x-www-form-urlencoded</code>. When using <code>x-www-form-urlencoded</code>, the parameters are sent like a query string; <code>per_page=2&amp;genre=fiction</code>. An HTML form, by default, will bundle up the various inputs and send a <code>POST</code> request matching the <code>x-www-form-urlencoded</code> pattern.\r\n\r\nIt is important to note that although the HTTP specification does not prohibit the use of sending body parameters in <code>GET</code> requests, it is encouraged that you do not use body parameters in a <code>GET</code> request. Body parameters can and should be used for <code>POST</code>, <code>PUT</code>, and <code>DELETE</code> requests.\r\n<h4>File Params</h4>\r\nFile parameters in a <code>WP_REST_Request</code> object are stored when the request uses a special content type header; <code>multipart/form-data</code>. The file data can then be accessed from the request object using <code>$request-&gt;get_file_params()</code>. The file parameters are equivalent to the PHP superglobal: <code>$_FILES</code>. Remember, do not access the superglobals directly only use what the <code>WP_REST_Request</code> object provides.\r\n\r\nIn the endpoint callback we could use <code>wp_handle_upload()</code> to then add in the desired files to WordPress&#8217;s media uploads directory. The file parameters are only useful for dealing with file data and you should never use them for any other purpose.\r\n<h3>Attributes</h3>\r\n<code>WP_REST_Request</code> also supports request attributes. The attributes of a request are the attributes registered to the match route. If we made a <code>GET</code> request to <code>my-namespace/v1/books</code>, and then we called <code>$request-&gt;get_attributes()</code> inside of our endpoint callback, we would be returned all of the registration options for the <code>my-namespace/v1/books</code> endpoint. If we made a <code>POST</code> request to the same route and our endpoint callback also returned <code>$request-&gt;get_attributes()</code>, we would receive a different set of endpoint options registered to the <code>POST</code> endpoint callback.\r\n\r\nIn the attributes we will get a response containing supported methods, options, whether to show this endpoint in the index, a list of registered arguments for the endpoint, and our registered callbacks. It might look something like this:\r\n<pre class=\"wp-block-code\"><code lang=\"js\" class=\"language-js line-numbers\">{\r\n  &quot;methods&quot;: {\r\n    &quot;GET&quot;: true\r\n  },\r\n  &quot;accept_json&quot;: false,\r\n  &quot;accept_raw&quot;: false,\r\n  &quot;show_in_index&quot;: true,\r\n  &quot;args&quot;: {\r\n    &quot;context&quot;: {\r\n      &quot;description&quot;: &quot;Scope under which the request is made; determines fields present in response.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;sanitize_callback&quot;: &quot;sanitize_key&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;,\r\n      &quot;enum&quot;: [\r\n        &quot;view&quot;,\r\n        &quot;embed&quot;,\r\n        &quot;edit&quot;\r\n      ],\r\n      &quot;default&quot;: &quot;view&quot;\r\n    },\r\n    &quot;page&quot;: {\r\n      &quot;description&quot;: &quot;Current page of the collection.&quot;,\r\n      &quot;type&quot;: &quot;integer&quot;,\r\n      &quot;default&quot;: 1,\r\n      &quot;sanitize_callback&quot;: &quot;absint&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;,\r\n      &quot;minimum&quot;: 1\r\n    },\r\n    &quot;per_page&quot;: {\r\n      &quot;description&quot;: &quot;Maximum number of items to be returned in result set.&quot;,\r\n      &quot;type&quot;: &quot;integer&quot;,\r\n      &quot;default&quot;: 10,\r\n      &quot;minimum&quot;: 1,\r\n      &quot;maximum&quot;: 100,\r\n      &quot;sanitize_callback&quot;: &quot;absint&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;search&quot;: {\r\n      &quot;description&quot;: &quot;Limit results to those matching a string.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;sanitize_callback&quot;: &quot;sanitize_text_field&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;after&quot;: {\r\n      &quot;description&quot;: &quot;Limit response to resources published after a given ISO8601 compliant date.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;format&quot;: &quot;date-time&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;author&quot;: {\r\n      &quot;description&quot;: &quot;Limit result set to posts assigned to specific authors.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;default&quot;: [],\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;author_exclude&quot;: {\r\n      &quot;description&quot;: &quot;Ensure result set excludes posts assigned to specific authors.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;default&quot;: [],\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;before&quot;: {\r\n      &quot;description&quot;: &quot;Limit response to resources published before a given ISO8601 compliant date.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;format&quot;: &quot;date-time&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;exclude&quot;: {\r\n      &quot;description&quot;: &quot;Ensure result set excludes specific ids.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;default&quot;: [],\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;\r\n    },\r\n    &quot;include&quot;: {\r\n      &quot;description&quot;: &quot;Limit result set to specific ids.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;default&quot;: [],\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;\r\n    },\r\n    &quot;offset&quot;: {\r\n      &quot;description&quot;: &quot;Offset the result set by a specific number of items.&quot;,\r\n      &quot;type&quot;: &quot;integer&quot;,\r\n      &quot;sanitize_callback&quot;: &quot;absint&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;order&quot;: {\r\n      &quot;description&quot;: &quot;Order sort attribute ascending or descending.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;default&quot;: &quot;desc&quot;,\r\n      &quot;enum&quot;: [\r\n        &quot;asc&quot;,\r\n        &quot;desc&quot;\r\n      ],\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;orderby&quot;: {\r\n      &quot;description&quot;: &quot;Sort collection by object attribute.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;default&quot;: &quot;date&quot;,\r\n      &quot;enum&quot;: [\r\n        &quot;date&quot;,\r\n        &quot;relevance&quot;,\r\n        &quot;id&quot;,\r\n        &quot;include&quot;,\r\n        &quot;title&quot;,\r\n        &quot;slug&quot;\r\n      ],\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;slug&quot;: {\r\n      &quot;description&quot;: &quot;Limit result set to posts with a specific slug.&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;validate_callback&quot;: &quot;rest_validate_request_arg&quot;\r\n    },\r\n    &quot;status&quot;: {\r\n      &quot;default&quot;: &quot;publish&quot;,\r\n      &quot;description&quot;: &quot;Limit result set to posts assigned a specific status; can be comma-delimited list of status types.&quot;,\r\n      &quot;enum&quot;: [\r\n        &quot;publish&quot;,\r\n        &quot;future&quot;,\r\n        &quot;draft&quot;,\r\n        &quot;pending&quot;,\r\n        &quot;private&quot;,\r\n        &quot;trash&quot;,\r\n        &quot;auto-draft&quot;,\r\n        &quot;inherit&quot;,\r\n        &quot;any&quot;\r\n      ],\r\n      &quot;sanitize_callback&quot;: &quot;sanitize_key&quot;,\r\n      &quot;type&quot;: &quot;string&quot;,\r\n      &quot;validate_callback&quot;: [\r\n        {},\r\n        &quot;validate_user_can_query_private_statuses&quot;\r\n      ]\r\n    },\r\n    &quot;filter&quot;: {\r\n      &quot;description&quot;: &quot;Use WP Query arguments to modify the response; private query vars require appropriate authorization.&quot;\r\n    },\r\n    &quot;categories&quot;: {\r\n      &quot;description&quot;: &quot;Limit result set to all items that have the specified term assigned in the categories taxonomy.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;,\r\n      &quot;default&quot;: []\r\n    },\r\n    &quot;tags&quot;: {\r\n      &quot;description&quot;: &quot;Limit result set to all items that have the specified term assigned in the tags taxonomy.&quot;,\r\n      &quot;type&quot;: &quot;array&quot;,\r\n      &quot;sanitize_callback&quot;: &quot;wp_parse_id_list&quot;,\r\n      &quot;default&quot;: []\r\n    }\r\n  },\r\n  &quot;callback&quot;: [\r\n    {},\r\n    &quot;get_items&quot;\r\n  ],\r\n  &quot;permission_callback&quot;: [\r\n    {},\r\n    &quot;get_items_permissions_check&quot;\r\n  ]\r\n}</code></pre>\r\n\r\nAs you can see we have all of the information we have registered to our endpoint already there, ready to go! The request attributes are typically used at a lower level and are handled by the <code>WP_REST_Server</code> class, however there are cool things that can be done inside of endpoint callbacks, like restricting accepted parameters to match registered arguments.\r\n\r\nThe WP REST API is designed for you so that you do not have to mess around with any internals, so some of these more advanced methods of interacting with <code>WP_REST_Request</code> are not going to be commonly practiced. The core of using the WP REST API is linked to registering routes and endpoints. Requests are the tool we use to tell the API which endpoint we want to hit. This is most commonly done over HTTP, however we can also use <code>WP_REST_Request</code>s internally.\r\n<h2>Internal Requests</h2>\r\nThe key to making internal requests is using <code>rest_do_request()</code>. All you need to do is pass in a request object and you will be returned a response. Because the request is never served by the <code>WP_REST_Server</code>, the response data is never encoded into json, meaning we have our response object as a PHP object. This is pretty awesome and enables us to do a lot of interesting things. For one, we can create efficient batch endpoints. From a performance perspective, one of the hurdles is minimizing HTTP requests. We can create batch endpoints that will use <code>rest_do_request()</code> to serve all of our requests internally all in one HTTP request. Here is a very simplistic batch endpoint for read only data, so you can see <code>rest_do_request()</code> in action.\r\n<pre class=\"wp-block-code\"><code lang=\"php\" class=\"language-php line-numbers\">// Register our mock batch endpoint.\r\nfunction prefix_register_batch_route() {\r\n    register_rest_route( 'my-namespace/v1', '/batch', array(\r\n        // Supported methods for this endpoint. WP_REST_Server::READABLE translates to GET.\r\n        'methods' =&gt; WP_REST_Server::READABLE,\r\n        // Register the callback for the endpoint.\r\n        'callback' =&gt; 'prefix_do_batch_request',\r\n        // Register args for the batch endpoint.\r\n        'args' =&gt; prefix_batch_request_parameters(),\r\n    ) );\r\n}\r\n\r\nadd_action( 'rest_api_init', 'prefix_register_batch_route' );\r\n\r\n/**\r\n * Our registered endpoint callback. Notice how we are passing in $request as an argument.\r\n * By default, the WP_REST_Server will pass in the matched request object to our callback.\r\n *\r\n * @param WP_REST_Request $request The current matched request object.\r\n */\r\nfunction prefix_do_batch_request( $request ) {\r\n    // Here we initialize the array that will hold our response data.\r\n    $data = array();\r\n\t$data = prefix_handle_batch_requests( $request['requests'] );\r\n\treturn $data;\r\n}\r\n\r\n/**\r\n * This handles the building of the response for the batch requests we make.\r\n *\r\n * @param array $requests An array of data to build WP_REST_Request objects from.\r\n * @return WP_REST_Response A collection of response data for batch endpoints.\r\n */\r\nfunction prefix_handle_batch_requests( $requests ) {\r\n\t$data = array();\r\n\r\n\t// Foreach request specified in the requests param run the endpoint.\r\n\tforeach ( $requests as $request_params ) {\r\n\t\t$response = prefix_handle_request( $request_params );\r\n\t\t$key = $request_params['method'] . ' ' . $request_params['route'];\r\n\t\t$data[ $key ] = prefix_prepare_for_collection( $response );\r\n\t}\r\n\r\n\treturn rest_ensure_response( $data );\r\n}\r\n\r\n/**\r\n * This handles the building of the response for the batch requests we make.\r\n *\r\n * @param array $request_params Data to build a WP_REST_Request object from.\r\n * @return WP_REST_Response Response data for the request.\r\n */\r\nfunction prefix_handle_request( $request_params ) {\r\n\t$request = new WP_REST_Request( $request_params['method'], $request_params['route'] );\r\n\r\n\t// Add specified request parameters into the request.\r\n\tif ( isset( $request_params['params'] ) ) {\r\n\t\tforeach ( $request_params['params'] as $param_name =&gt; $param_value ) {\r\n\t\t\t$request-&gt;set_param( $param_name, $param_value );\r\n\t\t}\r\n\t}\r\n\t$response = rest_do_request( $request );\r\n\treturn $response;\r\n}\r\n\r\n/**\r\n * Prepare a response for inserting into a collection of responses.\r\n *\r\n * This is lifted from WP_REST_Controller class in the WP REST API v2 plugin.\r\n *\r\n * @param WP_REST_Response $response Response object.\r\n * @return array Response data, ready for insertion into collection data.\r\n */\r\nfunction prefix_prepare_for_collection( $response ) {\r\n\tif ( ! ( $response instanceof WP_REST_Response ) ) {\r\n\t\treturn $response;\r\n\t}\r\n\r\n\t$data = (array) $response-&gt;get_data();\r\n\t$server = rest_get_server();\r\n\r\n\tif ( method_exists( $server, 'get_compact_response_links' ) ) {\r\n\t\t$links = call_user_func( array( $server, 'get_compact_response_links' ), $response );\r\n\t} else {\r\n\t\t$links = call_user_func( array( $server, 'get_response_links' ), $response );\r\n\t}\r\n\r\n\tif ( ! empty( $links ) ) {\r\n\t\t$data['_links'] = $links;\r\n\t}\r\n\r\n\treturn $data;\r\n}\r\n\r\n/**\r\n * Returns the JSON schema data for our registered parameters.\r\n *\r\n * @return array $params A PHP representation of JSON Schema data.\r\n */\r\nfunction prefix_batch_request_parameters() {\r\n    $params = array();\r\n\r\n    $params['requests'] = array(\r\n\t\t'description'        =&gt; esc_html__( 'An array of request objects arguments that can be built into WP_REST_Request instances.', 'my-text-domain' ),\r\n\t\t'type'               =&gt; 'array',\r\n\t\t'required'           =&gt; true,\r\n\t\t'validate_callback'  =&gt; 'prefix_validate_requests',\r\n\t\t'items'              =&gt; array(\r\n\t\t\tarray(\r\n\t\t\t\t'type' =&gt; 'object',\r\n\t\t\t\t'properties' =&gt; array(\r\n\t\t\t\t\t'method' =&gt; array(\r\n\t\t\t\t\t\t'description' =&gt; esc_html__( 'HTTP Method of the desired request.', 'my-text-domain' ),\r\n\t\t\t\t\t\t'type'        =&gt; 'string',\r\n\t\t\t\t\t\t'required'    =&gt; true,\r\n\t\t\t\t\t\t'enum'        =&gt; array(\r\n\t\t\t\t\t\t\t'GET',\r\n\t\t\t\t\t\t\t'POST',\r\n\t\t\t\t\t\t\t'PUT',\r\n\t\t\t\t\t\t\t'DELETE',\r\n\t\t\t\t\t\t\t'OPTIONS',\r\n\t\t\t\t\t\t),\r\n\t\t\t\t\t),\r\n\t\t\t\t\t'route' =&gt; array(\r\n\t\t\t\t\t\t'description' =&gt; esc_html__( 'Desired route for the request.', 'my-text-domain' ),\r\n\t\t\t\t\t\t'required'    =&gt; true,\r\n\t\t\t\t\t\t'type'        =&gt; 'string',\r\n\t\t\t\t\t\t'format'      =&gt; 'uri',\r\n\t\t\t\t\t),\r\n\t\t\t\t\t'params' =&gt; array(\r\n\t\t\t\t\t\t'description' =&gt; esc_html__( 'Key value pairs of desired request parameters.', 'my-text-domain' ),\r\n\t\t\t\t\t\t'type' =&gt; 'object',\r\n\t\t\t\t\t),\r\n\t\t\t\t),\r\n\t\t\t),\r\n\t\t),\r\n\t);\r\n\r\n\treturn $params;\r\n}\r\n\r\nfunction prefix_validate_requests( $requests, $request, $param_key ) {\r\n\t// If requests isn't an array of requests then we don't process the batch.\r\n\tif ( ! is_array( $requests ) ) {\r\n\t\treturn new WP_Error( 'rest_invald_param', esc_html__( 'The requests parameter must be an array of requests.' ), array( 'status' =&gt; 400 ) );\r\n\t}\r\n\r\n\tforeach ( $requests as $request ) {\r\n\t\t// If the method or route is not set then we do not run the requests.\r\n\t\tif ( ! isset( $request['method'] ) || ! isset( $request['route'] ) ) {\r\n\t\t\treturn new WP_Error( 'rest_invald_param', esc_html__( 'You must specify the method and route for each request.' ), array( 'status' =&gt; 400 ) );\r\n\t\t}\r\n\r\n\t\tif ( isset( $request['params'] ) &amp;&amp; ! is_array( $request['params'] ) ) {\r\n\t\t\treturn new WP_Error( 'rest_invald_param', esc_html__( 'You must specify the params for each request as an array of named key value pairs.' ), array( 'status' =&gt; 400 ) );\r\n\t\t}\r\n\t}\r\n\r\n\t// This is a black listing approach to data validation.\r\n\treturn true;\r\n}</code></pre>\r\n\r\nThat is quite a decent chunk of code that covers a number of topics, but everything centers around what happens in <code>prefix_handle_request()</code>. Here we are passing in an array that tells us a HTTP method, a route, and a set of parameters we want to turn into a request. We then build the request object for the method and route. If any parameters were specified we use the <code>WP_REST_Request::set_param()</code> method to add in the desired parameters. Once our <code>WP_REST_Request</code> is ready to go we use <code>rest_do_request</code> to internally match that endpoint and the response is returned to our batch endpoint response collection. Using a batch endpoint like this can net you huge performance gains, as you will only make one HTTP request to get a response for multiple endpoints.  The implementation of this is not necessarily the best and serves as an example; not the only way to do this.",
        "protected": false
    },
    "author": 14582129,
    "featured_media": 0,
    "parent": 22370,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-22396",
        "plugin-handbook",
        "type-plugin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/22396",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/plugin-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/14582129"
            }
        ],
        "version-history": [
            {
                "count": 18,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/22396/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 136943,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/22396/revisions/136943"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/22370"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=22396"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}