{
    "id": 15282,
    "date": "2015-04-09T15:13:08",
    "date_gmt": "2015-04-09T15:13:08",
    "guid": {
        "rendered": "http://developer.wordpress.org/?post_type=plugin-handbook&#038;p=15282"
    },
    "modified": "2024-10-12T19:30:08",
    "modified_gmt": "2024-10-12T19:30:08",
    "slug": "plugin-developer-faq",
    "status": "publish",
    "type": "plugin-handbook",
    "link": "https://developer.wordpress.org/plugins/wordpress-org/plugin-developer-faq/",
    "title": {
        "rendered": "Plugin Developer FAQ"
    },
    "content": {
        "rendered": "\n<p>There are lot of ins and outs to hosting WordPress plugins. Please take a minute to see if your question is answered here before reaching out for assistance.</p>\n\n\n\n<div class=\"wp-block-wporg-notice is-info-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\">\n<p>Last Updated: 12 October 2024</p>\n</div></div>\n\n\n\n<h2 class=\"wp-block-heading\">The Plugin Review Team</h2>\n\n\n\n<h3 class=\"wp-block-heading\">How do I contact the Plugin Review team?</h3>\n\n\n\n<p>You can contact us by email at <code>plugins@wordpress.org</code> &#8211; we reply to all emails within 7 business days.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I join the team?</h3>\n\n\n\n<p>Please take a look at <a href=\"https://make.wordpress.org/plugins/handbook/apply/\">this handbook page</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Submissions and Reviews</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Where do I submit my plugin?</h3>\n\n\n\n<p>Go to the <a href=\"https://wordpress.org/plugins/developers/add/\">Add</a> page&nbsp;and upload your file. You should make sure that:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>It&#8217;s a .zip file and under 10Mb.</li>\n\n\n\n<li>It&#8217;s in the common WordPress plugin format so that it can be installed using the &#8216;Upload Plugin&#8217; feature in WordPress.</li>\n\n\n\n<li>It&#8217;s production-ready: complete, without errors, without unnecessary logs, without development tools, and that all necessary files are properly compiled or generated.</li>\n</ul>\n\n\n\n<p>We do not accept placeholders or plugins that aren&#8217;t ready to be used.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What if my plugin is over 10 megs?</h3>\n\n\n\n<p>Double check that you aren&#8217;t including unused files (like test folders, documentation, and full node/vendor folders). The majority of plugins who face this issue have included all sorts of development content that has no place in the final code.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What happens after submission?</h3>\n\n\n\n<p>You will get an automated email telling you about the submission immediately. It will be queued, and as soon as we get to it, we will manually download and review your code. If we find no issues with the security, documentation, or presentation, your plugin will be approved. If we determine there are issues, you will receive a second email with details explaining what needs to be fixed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What will my plugin permalink (slug) be?</h3>\n\n\n\n<p>When you submit a plugin, you get an automated email telling you what the slug will be. This is populated based on the value of your Plugin Name in your main plugin file (the one with the plugin headers). </p>\n\n\n\n<p>For example:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Plugin name: <code>Boaty McBoatface</code></li>\n\n\n\n<li>Autogenerated Slug: <code>boaty-mcboatface</code></li>\n</ul>\n\n\n\n<p>If there is an existing plugin with your name or slug, then <a href=\"#why-is-my-submission-failing-saying-my-plugin-name-already-exists\" data-type=\"internal\" data-id=\"#why-is-my-submission-failing-saying-my-plugin-name-already-exists\">you&#8217;ll get a warning on the submission</a>.</p>\n\n\n\n<p>The slug will also determine the following:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The URL of your plugin&#8217;s WordPress.org public page: <code>wordpress.org/plugins/boaty-mcboatface</code></li>\n\n\n\n<li>The folder name of your plugin in the WordPress plugins directory: <code>&lt;wp-content-folder&gt;/plugins/boaty-mcboatface</code></li>\n\n\n\n<li>The address of your plugin&#8217;s SVN repository and trac: <code>plugins.svn.wordpress.org/boaty-mcboatface</code> and <code>plugins.trac.wordpress.org/browser/boaty-mcboatface </code></li>\n\n\n\n<li>Your plugin&#8217;s text-domain for internationalization functions: <code>esc_html__('Hello', 'boaty-mcboatface');</code></li>\n</ul>\n\n\n\n<p>Once your plugin is approved, this name <strong>cannot</strong> be renamed. Please chose wisely.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why did I get a different slug than I was told?</h3>\n\n\n\n<p>If we have to change your permalink (slug) we will always email you to explain why. In general, we change your permalink when you have obvious typos or mistakes (<em>foundre</em> instead of <em>founder</em>, for example) or if there are conflicts with existing trademarks or other plugins. Please make sure you read your review email carefully, as we do explain why we do things.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why is my submission failing saying my plugin name already exists?</h3>\n\n\n\n<p>There are two reasons this happens:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>You&#8217;re trying to use a plugin with a permalink that already exists on WordPress.org</li>\n\n\n\n<li>You&#8217;re trying to use a plugin with a permalink that exists <strong>outside</strong> WordPress.org and has a significant user base.</li>\n</ol>\n\n\n\n<p>The first one is obvious. You can&#8217;t have two plugins with the same permalink so you need to pick a new one.</p>\n\n\n\n<p>The second one is confusing because it&#8217;s telling you that somewhere, not on WordPress.org, that permalink is in use. It&#8217;s important to understand that the way the plugin update API works is that it compares the plugin folder name (i.e. the permalink) to every plugin it has hosted on WordPress.org. If there&#8217;s a match, then it checks for updates and users are prompted to upgrade.</p>\n\n\n\n<p>When that happens, users of the &#8216;original&#8217; plugin (the one we don&#8217;t host) would upgrade to the one from WordPress.org and, if that isn&#8217;t what you actually wanted to do, you could break their sites.</p>\n\n\n\n<p>Sometimes this situation develops when a company or person releases their plugin privately (via Github for example) and decides they want to re-release it on WordPress.org. In those cases, we recommend you email us and we&#8217;ll walk you through how to get past the error.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why am I getting an error that says I cannot begin my plugin name with a term?</h3>\n\n\n\n<p>That error is to inform you that you may not begin your Display Name with someone else&#8217;s trademarked term. This is to protect you and the directory from legal issues regarding trademark abuse. To correct the issue, you must change the Display Name in your plugin&#8217;s readme and main PHP files.</p>\n\n\n\n<p>Please do not try to &#8216;work around&#8217; this by cleverly renaming your plugin (WuuCommerce for example). All that does is make us worry you&#8217;re not going to be able to follow guidelines in the future.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why am I getting an error that says I cannot use a term <em>entirely</em> in my plugin name?</h3>\n\n\n\n<p>Some trademark owners have requested we no longer permit the use of specific terms in plugin names entirely. If you see this error, then you must remove the term from your plugin name.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>To proceed with this submission you must remove &#8220;[TERM]&#8221; from the Plugin Name: line in both your main plugin file and readme entirely.</p>\n</blockquote>\n\n\n\n<p>If you attempt to get around this by changing your term from &#8216;Facerange&#8217; to &#8216;Face-Range&#8217;, we will pend your submission and reiterate that you cannot use the term. Please don&#8217;t try to be sneaky or clever to get past this restriction. </p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I submit an official plugin?</h3>\n\n\n\n<p>Log in as the official organization user account and submit with that account <em>only</em>.</p>\n\n\n\n<p>How we will know that you are the official organization? Because of your email address mostly.</p>\n\n\n\n<p>We cannot accept plugins that act in name of an organization submitted by individual developer accounts, unless they&#8217;re clearly company ones as well. For example, submitting your official plugin with a user that has a gmail address is likely to be flagged for trademark infringement.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What if I submitted the plugin with the wrong user ID?</h3>\n\n\n\n<p>Just reply to the email right away and let us know. We can transfer ownership for you. If you forget to do this, you can fix it yourself by <a href=\"#how-do-i-give-someone-else-access-to-my-plugin\">adding the correct account as a committer</a> and then having that account remove your own.</p>\n\n\n\n<p><strong>DO NOT</strong> resubmit your plugin. Just tell us right away and we&#8217;ll fix it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How long does it take to get a plugin approved?</h3>\n\n\n\n<p>There&#8217;s no official average, as no two plugins are the same. If your plugin is small and all the code is correct, it should be approved within<strong> fourteen</strong> days of <em>initial review</em>.</p>\n\n\n\n<p>If your plugin has any code issues, it will take as long as it takes for you to correct the issues. Either way, you <em>will</em> get an email from <code>plugins@wordpress.org</code> with the status, so please add that to your email whitelist and patiently wait for our response.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I sent in the fixes but no one replied. How long should I wait?</h3>\n\n\n\n<p>We aim to reply to all reviews within ten (10) business days. If it&#8217;s been less than that, it just means we&#8217;ve been really busy. If it&#8217;s been two days, like over a weekend or a holiday, then you should not <strong>reasonably</strong> expect a reply.</p>\n\n\n\n<p>Remember the review team is made up of 100% volunteers, all of whom have full time day jobs, and other volunteer duties. We do reply promptly, but we also have lives outside of WordPress.</p>\n\n\n\n<h3 class=\"wp-block-heading\">If my plugin has a problem, how long do I have to fix it?</h3>\n\n\n\n<p>There&#8217;s no timeline and as long as we know you&#8217;re working on it and we feel you&#8217;re making progress, we&#8217;ll leave the review open. Your plugin will be rejected after 3 months, but the review will remain open.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why was my plugin rejected after three months?</h3>\n\n\n\n<p>If your plugin review is not complete after three (3) months, we will reject your submission in order to keep the queue maintainable. At any point in time, we have more than 500 people mid-review, and we figure that 3 months is a pretty reasonable time frame.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I finally fixed my plugin. Should I resubmit?</h3>\n\n\n\n<p>If your plugin was rejected after three months, submit it again and reply to the email so we are aware that you wanna continue a previous unfinished review. Even if it&#8217;s been 18 months. The longest time to date has been 3 years. We don&#8217;t mind if it takes a while.</p>\n\n\n\n<p><strong>DO NOT</strong> resubmit your plugin if it was rejected for any other reason, just reply to the email.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How many plugins can I submit for review at a time?</h3>\n\n\n\n<p>Generally, just one. If you&#8217;re a plugin author with more than one million active plugin installations, we understand that you have more ongoing projects, so you would have a different limit of up to 10 plugin submissions at the same time.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why can&#8217;t I submit more than one plugin at a time?</h3>\n\n\n\n<p>Allowing people to have multiple submissions at once was proven to be detrimental to the review process. Errors were regularly found in all the plugins, resulting in the same emails being sent multiple times. In addition, people often got confused as to which review they were working on, muddying the waters about what needed to be solved. By changing this to one-at-a-time, confusion in those matters dropped significantly.</p>\n\n\n\n<p>In addition, many new users don&#8217;t know how to use SVN, and wound up submitting multiple plugins and never using any. That can be a drain on our resources, so we do limit people.</p>\n\n\n\n<p>Since all plugins get an initial review within four weeks, this should not be a hardship.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I submit multiple plugins with multiple accounts?</h3>\n\n\n\n<p>No. And if you do so, we will suspend all your secondary accounts. Don&#8217;t try to get around the one-at-a-time rule please.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I need my plugin approved by a specific date, what should I do?</h3>\n\n\n\n<p>Submit it as early as possible. Unless the plugin is meant to address a security or legal issue, we don&#8217;t permit queue jumping. If it <em>is</em> related to one of those, please email <code>plugins@wordpress.org</code> and explain the situation.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Are there specific things that I should avoid doing?</h3>\n\n\n\n<p>We look for some pretty obvious things, all of which are listed <a href=\"https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/\">in our guidelines</a>. Most can be summed up as &#8220;Don’t be a spammer,&#8221; but to touch on the ones people do the most:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Not including a <code>readme.txt</code> file when acting as a service</li>\n\n\n\n<li>Not testing the plugin with <code>WP_DEBUG</code></li>\n\n\n\n<li>Including custom versions of packaged JavaScript libraries</li>\n\n\n\n<li>Calling external files unnecessarily</li>\n\n\n\n<li>&#8220;Powered By&#8221; links</li>\n\n\n\n<li>Phoning home</li>\n</ul>\n\n\n\n<p>Again, this is a brief overview. Please read the guidelines, as the full list is quite detailed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Are there plugins you don&#8217;t accept?</h3>\n\n\n\n<p>We don&#8217;t accept plugins that do &#8216;nothing,&#8217; are illegal, or encourage bad behavior. This includes black hat SEO spamming, content spinners, hate-plugins, and so on.</p>\n\n\n\n<p>Similarly we do not accept framework plugins or library plugins. If your plugin has to require other plugins or themes to edit themselves in order to use your plugin, it&#8217;s a library. If your plugin is a template from which more code can be built by customizing the files directly, it&#8217;s a framework or boilerplate. Frameworks and libraries should be packaged with each plugin (hopefully in a way that doesn’t conflict with other plugins using the framework or libraries). At least until core supports plugin dependencies.</p>\n\n\n\n<p>We also don&#8217;t accept 100% copies of other people&#8217;s work or plugins that duplicate functionality found in WordPress Core. Basically, your plugin should do something new, or in a new way, or solve a specific issue.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I want to redo, upgrade, or rebrand my existing plugin. I just submit again, right?</h3>\n\n\n\n<p>No, you should rewrite and upgrade the existing plugin. Make it a major version release. We can&#8217;t rename plugins or transfer users, so a new one wouldn&#8217;t carry over any existing users, reviews, support topics, ratings, downloads, favorites, etc. Basically you&#8217;d leave <em>all</em> your current users out in the cold, and that&#8217;s mean.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I made a mistake with my submission. How can I fix it?</h3>\n\n\n\n<p>You can update your plugin files from the submission page at any time.</p>\n\n\n\n<p>You can update your slug once after submitting it.</p>\n\n\n\n<p>Every submission gets an automated email with directions. If you have a different issue, please reply to that or email <code>plugins@wordpress.org</code> and explain the situation.</p>\n\n\n\n<p>Regarding slugs if you need further changes, you&#8217;ll need to contact us. We also try to catch typos in names before we approve anything, but we make mistakes too.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Are there things I can&#8217;t do in a plugin name?</h3>\n\n\n\n<p>We have the following restrictions:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Plugins may not use vulgarities in the name or slug</li>\n\n\n\n<li>Plugins may not use &#8216;WordPress&#8217; or &#8216;Plugin&#8217; in their slugs except under extreme situations</li>\n\n\n\n<li>Plugins may not use version numbers in plugin slugs</li>\n\n\n\n<li>Due to system limitations, only English letters and Arabic numbers are permitted in the slug</li>\n\n\n\n<li>Plugins may not <strong>start</strong> or contain in a way that may be confusing a trademarked term or name of a specific project/library/tool <em>unless</em> submitted by an official representative</li>\n</ul>\n\n\n\n<p>We encourage everyone to be creative and come up with unique slugs. We automatically correct any plugin that has an unacceptable slug. If there&#8217;s a question as to the best choice, we will contact you to be sure.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Using The SVN Repository</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Where do I put my files?</h3>\n\n\n\n<p>Put your code files directly in the <code>trunk/</code> directory of your repository. Whenever you release a new version, <a href=\"https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/#task-3\">tag that release</a> by copying the current trunk revision to a new subdirectory of the <code>tags/</code> directory.</p>\n\n\n\n<p>Make sure you update <a href=\"https://wordpress.org/plugins/developers/#readme\"><code>trunk/readme.txt</code></a> to reflect the <strong>new</strong> stable tag.</p>\n\n\n\n<p>Images for the readme (such as <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/\">screenshots, plugin headers, and plugin icons</a>), belong in the <code>assets/</code> directory (which you may need to create) in the root of your SVN checkout. This will be on the same level as <code>tags/</code> and <code>trunk/</code>, for example.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I put my files in a subdirectory of <code>trunk/</code>?</h3>\n\n\n\n<p>No. Doing that will cause the zip generator to break.</p>\n\n\n\n<p>If you have complicated plugin with lots of files, you can of course organize them into subdirectories, but the <a href=\"https://wordpress.org/plugins/developers/#readme\">readme.txt file</a> and the root plugin file should go straight into <code>trunk/</code>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How should I name my tags (a.k.a. releases)?</h3>\n\n\n\n<p>Your Subversion tags should look like version numbers. Specifically, they should only contain <strong>numbers and periods</strong>. <code>2.8.4</code> is a good lookin’ tag, <code>my neato releaso</code> is a bad lookin’ tag. We recommend you use <a href=\"http://semver.org\">Semantic Versioning</a> to keep track of releases, but we do not enforce this.</p>\n\n\n\n<p>Note that we’re talking about <em>Subversion</em> tags here, not <code>readme.txt</code> search type tags.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How many old releases should I keep in SVN?</h3>\n\n\n\n<p>As few as possible. Very rarely does anyone need your old code in the release repository. Remember, SVN is <strong>not</strong> meant for your code versioning. You can use Github for stuff like that. SVN should have your current release versions, but you don&#8217;t need all the minor releases to all the previous versions. Just the last one or two for them is good.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I include SVN externals in my plugin?</h3>\n\n\n\n<p>No. You can add <a href=\"https://svnbook.red-bean.com/en/1.0/ch07s03.html\">svn externals</a> to your repository, but they won’t get added to the downloadable zip file.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I put zips and other compressed files in my plugin?</h3>\n\n\n\n<p>No.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I include minified JS?</h3>\n\n\n\n<p>Yes! However you either have to keep the non-minified in your plugin <em>or</em> direct people via your readme as to where they can get the non-minified files. </p>\n\n\n\n<p>It&#8217;s fine to minify, but it&#8217;s not okay to hide it. All code must be human readable for inclusion in this directory.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Your WordPress.Org Page</h2>\n\n\n\n<h3 class=\"wp-block-heading\">When does my plugin go &#8216;live&#8217;?</h3>\n\n\n\n<p>As soon as you push code to the SVN folders, your plugin will be live. <strong>DO NOT</strong> push code if you&#8217;re not ready, as there&#8217;s no &#8216;off&#8217; switch except to <a href=\"#closed-plugins\">close the plugin</a>. As closing a plugin is permanent, we recommend you not push code until you&#8217;re ready to go live.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Where does the WordPress.org Plugin Directory get its data?</h3>\n\n\n\n<p>From the information you specify in the plugin file and in the <a href=\"https://wordpress.org/plugins/developers/#readme\">readme.txt file</a>, and from the Subversion repository itself. Read <a href=\"https://developer.wordpress.org/plugins/wordpress-org/how-your-readme-txt-works/\">about how the readme.txt works</a> for more information.</p>\n\n\n\n<p>You should also make full use of the <a href=\"https://developer.wordpress.org/plugins/the-basics/header-requirements/\">Plugin Headers</a> in your main plugin file. Those will define how your username shows up on the WordPress.org hosting page, as well as in the WordPress Admin. We recommend using all those headers to fully document your plugin.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I specify what version of my plugin the WordPress.org Plugin Directory should use?</h3>\n\n\n\n<p>Yes, by specifying the <code>Stable Tag</code> field in your trunk directory’s <a href=\"https://wordpress.org/plugins/developers/#readme\">readme.txt file</a>.</p>\n\n\n\n<p>We ask you <strong>not</strong> use &#8216;trunk&#8217; as your stable tag, as that makes rollbacks more complicated than they need to be.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What version of WordPress should the “Tested Up To” value be?</h3>\n\n\n\n<p>Logically, whatever version you tested up to. However, never go above the current release candidate. If there is none, don’t go above the active version. So if WordPress’ stable release is 6.0.9, you can use 6.0 to 6.0.9 and everything will be fine. If there is a release of 6.1-RC then you may use 6.1, however you can go no higher. </p>\n\n\n\n<p>Do not attempt to be clever and use 6.5 or 7. This will result in errors on your page.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Do I need to release a new version of my plugin every time I update the readme?</h3>\n\n\n\n<p>No. If you&#8217;re only making cosmetic changes to the readme or your icons/headers, you <em>do not</em> need to release a new version. Just make sure you update the trunk and tag folders.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Do I need to release a new version of my plugin every time I update the code?</h3>\n\n\n\n<p>Yes. Otherwise no one gets updated.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What should be in my changelog?</h3>\n\n\n\n<p>A changelog is a log or record of all or all notable changes made to your plugin, including records of changes such as bug fixes, new features, etc. If you need help formatting your changelogs, we recommend <a href=\"https://keepachangelog.com/en/1.1.0/\">Keep A Changelog</a> as that&#8217;s the format used by many products out there.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How many versions should I keep in my changelog?</h3>\n\n\n\n<p>Always keep the current major release in your change log. For example, if your current version is 3.9.1, you&#8217;ll want that and 3.9 in the change log. Older versions should be removed and migrated to a <code>changelog.txt</code> file. That will allow them to be accessible to users, while keeping your readme shorter and more pertinent. At most, keep the most recent version of your plugin and one major version back in your readme&#8217;s changelog. Your <code>changelog.txt</code> will <strong>not</strong> be visible within the WordPress.org Plugin Directory, but that&#8217;s okay. Most users just want to know what&#8217;s new.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I include videos on plugin description pages?</h3>\n\n\n\n<p>For YouTube and Vimeo videos, simply paste the video link on a line by itself in your description. Note that the video must be set to allow embedding for the embed process to work. For videos hosted by the WordPress.com VideoPress service, use the <code></code> shortcode. Shortcodes can also be used for YouTube and Vimeo, if needed, just like in WordPress.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why does my plugin say it&#8217;s not been tested with the most recent WordPress versions?</h3>\n\n\n\n<p>That happens when you neglected to use a proper &#8216;Tested Up To&#8217; value in your headers in your readme. That value should be the latest version of WordPress that you&#8217;ve tested your plugin against. If the latest <strong>major</strong> WordPress version is 4.9, then you should have the value <code>4.9</code> to indicate compatibility. You do not need to update for minor releases (if your readme is compatible to 4.9 then that will cover 4.9 through 4.9.1000).</p>\n\n\n\n<p>Keep in mind, if you put in non-released versions of WordPress (like 6.0) you&#8217;ll see the same message.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How long does it take for the Plugin Directory to reflect my changes?</h3>\n\n\n\n<p>The WordPress.org Plugin Directory updates every few minutes. However, it may take longer for your changes to appear depending on the size of the update queue. Please give it at least <strong>6 hours</strong> before contacting us.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I make one of those cool banners for my plugin page?</h3>\n\n\n\n<p>You can make your own <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/#plugin-headers\">plugin headers</a> by uploading the correctly named files into the <code>assets</code> folder. Read <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/#plugin-headers\">about plugin headers</a> for more information.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I make a plugin icon?</h3>\n\n\n\n<p>You can make your own <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/#plugin-icons\">plugin icons</a> by uploading the correctly named files into the <code>assets</code> folder. Read <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-assets/#plugin-icons\">about plugin icons</a> for more information.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I use official logos in my plugin banner/icons?</h3>\n\n\n\n<p>Usually no. </p>\n\n\n\n<p>Your plugin icon should <em>never</em> be the unaltered, official logo of, say, Facerange. That would be infringing on their property.  You may not use official logos for your branding in your banners or icons. Even if you have permission to do so on your site, <em>we</em> don&#8217;t have that permission here.</p>\n\n\n\n<p>Much like your plugin name, we recommend your icons and headers be something unique to you. They tend to be more memorable that way.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How many tags can I use in my readme?</h3>\n\n\n\n<p>Per the guidelines, <a href=\"https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/#12-public-facing-pages-on-wordpress-org-readmes-must-not-spam\">plugins are limited to 12 tags in their readme</a>. This is to control spam. That said, only the first <strong>FIVE</strong> tags will display on WordPress.org, much for the same reason. The first 12 tags are used for searches, and the rest are ignored, so tag-stuffing won&#8217;t help you at all.</p>\n\n\n\n<p>In addition, any tags where you are the only one who uses them won’t show, because they’re not going to help anyone find another, similar, plugin.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Plugin Names</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Can I change my plugin&#8217;s name after it&#8217;s approved?</h3>\n\n\n\n<p>Yes and no. You can change the display name, but the <em>slug</em> — that part of the plugin URL that is yours — cannot be changed once a plugin is approved. That&#8217;s why we warn you, multiple times, upon submission.</p>\n\n\n\n<p>To change the display name, edit your main plugin file and change the value of &#8220;Plugin Name:&#8221; to the new name. You also will want to edit your header in your readme.txt to match.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why can&#8217;t I use someone&#8217;s trademark/brand as my plugin name?</h3>\n\n\n\n<p>Simply put, because you&#8217;re not them.</p>\n\n\n\n<p>If you have written an add-on plugin for BooCommerce, you may not name it &#8220;BooCommerce Improved Product Search&#8221; as that would generate the slug <code>boocommerce-improved-product-search</code> and that would conflict with the trademark of &#8216;BooCommerce.&#8217; That said, it would be acceptable to submit the name &#8220;Boo Improved Product Search&#8221; which would use the slug <code>bc-improved-product-search</code> (&#8220;bc&#8221; not being trademarked you see).</p>\n\n\n\n<p>As another example, if you have a plugin that integrates a service with a a popular cloud hosting company named Amazorn, you may call it &#8220;My Service Integration for Amazorn&#8221;, but you may <strong>not</strong> use &#8220;Amazorn &#8211; My Service Integration&#8221;.</p>\n\n\n\n<p>Consider the real life example of Keurig. If you made an eco-friendly brew cup, you could market it &#8220;EcoBrew Pod for Keurig&#8221; but you could NOT attempt to market it as &#8220;Keurig EcoBrew Pod.&#8221; The latter implies a direct relationship to Keurig and is actually against the law in some countries. In order to protect you, we need you to tread lightly with recognized brand names and trademarks. Always err on the side of caution; if they come and tell us to close your plugin because you used their term as the <em>first</em> word in the display name, we have to do it.</p>\n\n\n\n<p><em>Note: We no longer have permission to permit new plugins to use <code>woo</code> as the start of their permalink, and are required to enforce the use of <code>wc</code> instead.</em></p>\n\n\n\n<h3 class=\"wp-block-heading\">Can a company give me permission to use their trademark in my permalink?</h3>\n\n\n\n<p>No.</p>\n\n\n\n<p>While we understand that companies can and do grant usage permissions, we do not accept them for permalinks for a really important reason: we <em><strong>cannot</strong></em> change your permalink once the plugin is approved. This means if, later on, the company changes their mind and rescinds approval, the plugin will be closed and all of it&#8217;s users abandoned.</p>\n\n\n\n<p>In order to be forward thinking and proactive about a plugin&#8217;s long-term life in the directory, we do not accept &#8216;permission.&#8217; A permalink may not begin with a trademark (or commonly known brand/term) unless it is by the official owners.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I change my plugin&#8217;s URL/slug?</h3>\n\n\n\n<p>It&#8217;s impossible to change a plugin&#8217;s URL once it&#8217;s approved and we warn you about that in multiple places through the process.</p>\n\n\n\n<p>Due to that, we deny most requests for &#8216;new&#8217; plugins to replace old ones just to get a better slug.</p>\n\n\n\n<p>This is because we cannot migrate users between plugins nor can we redirect traffic. This means that submitted a new plugin to change a slug is incredibly detrimental to the plugin&#8217;s SEO and reputation, as users will be abandoned. The majority of plugins don&#8217;t actually need a new URL, and instead just want to edit their display name.</p>\n\n\n\n<p>Unless there&#8217;s an egregious typo, language, or legal issue related to your slug, we are <strong>unlikely</strong> to approve a new slug. If we do, we will flag your account to note that future rename requests are to be denied.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I change my plugin&#8217;s display name?</h3>\n\n\n\n<p>You&#8217;ll need to change it in the readme <em>and</em> the plugin main file.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I make my display name anything?</h3>\n\n\n\n<p>Don&#8217;t use vulgarities or slurs or other intentionally abusive language. You cannot claim, or appear to claim, to be an official source if you&#8217;re not. For example, if you&#8217;ve made a plugin that connects to the Frozbaz Service, you should call your plugin &#8220;Connector to Frozbaz Service&#8221; &#8211; in this way, you have made it clear you are making a plugin for a service, rather than being the service.</p>\n\n\n\n<p>If you&#8217;re combining multiple services (a payment gateway to a popular ecommerce plugin, for example), we strongly recommend you come up with an original, unique, display name.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I use WordPress or Plugin in my display name?</h3>\n\n\n\n<p>Currently yes, but you shouldn&#8217;t. It&#8217;s incredibly redundant and doesn&#8217;t actually help your SEO in any way, shape, or form. We already put WordPress <em>and</em> Plugin in your page title.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Should I use the trademark or registered symbol in my plugin name?</h3>\n\n\n\n<p>Assuming you actually did apply for trademarks, you certainly <em>can</em> but it&#8217;s not commonly done. Not even Google or Facebook do that. Simply by using your trademark term and having a log of it (like your SVN log), you have usually done the needed legal action required to protect your brand. Consult a lawyer for details.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Search</h2>\n\n\n\n<h3 class=\"wp-block-heading\">How long will it take for my plugin to show up in search?</h3>\n\n\n\n<p>Usually 6 to 14 days after a plugin is committed to SVN. This is because we have to add your data, parse it, and share it to all of our <em>heavily</em> cached servers. It&#8217;s not instantaneous. Also as a new plugin, we have no data on usage, so you may need to wait a bit.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I rank higher?</h3>\n\n\n\n<p>Write a good readme for the language, answer support posts promptly, get good reviews.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What&#8217;s weighted more, my URL or my display name?</h3>\n\n\n\n<p>Neither. Make your display name memorable and descriptive, while keeping it under 5 words, for maximum benefit.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Support Forums</h2>\n\n\n\n<h3 class=\"wp-block-heading\">How do I get notified for forums posts?</h3>\n\n\n\n<p>Go to <code>https://wordpress.org/support/plugin/YOURPLUGIN</code> and look at the sidebar on the right. Click the Subscribe to this Plugin button for email alerts.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I get notified for all my plugins?</h3>\n\n\n\n<p>Every plugin support forum page has a &#8220;Subscribe&#8221; button at the top of it. Click that and you will be emailed. You can see which plugin forums sets you are subscribed to at  <code>https://wordpress.org/support/users/YOURID/subscriptions</code></p>\n\n\n\n<p>For RSS, visit <code>https://wordpress.org/support/view/plugin-committer/YOURID</code> will list all of the support requests and reviews for any plugin you have commit access. Not a committer, just someone listed as an author? Use <code>https://wordpress.org/support/view/plugin-contributor/YOURID</code></p>\n\n\n\n<p>You can also go to <code>https://profiles.wordpress.org/YOURID/profile/notifications/</code> and put in any terms you want to be emailed for. Be careful, this can escalate if you use generic terms.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I give a support account access to my plugin?</h3>\n\n\n\n<p>You can add Support Representatives to your plugin. Support representatives can mark forum topics as resolved or sticky (same as plugin authors and contributors), but don’t have commit access to the plugin.</p>\n\n\n\n<p>The UI for managing plugin support reps can be found in Advanced View on the plugin page, next to managing committers. Once someone is added as a support rep, they will get a Plugin Support badge when replying to the plugin support topics or reviews.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Will you delete bad reviews or comments on my plugin?</h3>\n\n\n\n<p>Generally no. A review is a reflection of an individual&#8217;s experience with your product. If they didn&#8217;t like it, that&#8217;s not for us to change. If you feel that a review is invalid (such as for a different plugin), use the <code>modlook</code> button on the post. A member of the <strong>forums</strong> team will investigate. </p>\n\n\n\n<p>Abuse of the modlook feature may result in suspension of your plugins. Please, use it wisely.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What is &#8216;Sockpuppeting&#8217;?</h3>\n\n\n\n<p>That&#8217;s what happens when someone makes multiple accounts on the forums, usually to give themselves a number of 5-star reviews, or create fake support tickets to appear more responsive. Sockpuppeting is against our guidelines and will result in the reviews and posts being removed, but also may result in your account and all plugins being removed. Don&#8217;t do it and don&#8217;t flagrantly accuse others of doing it.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Closed Plugins</h2>\n\n\n\n<h3 class=\"wp-block-heading\">How do I close my plugin?</h3>\n\n\n\n<p>As of April 2020, you can close your own plugins at any time. To do so, go to the <strong>advanced</strong> tab on your plugin page (i.e. <code>https://wordpress.org/plugins/myplugin/advanced/</code>) and scroll down to the <strong>CLOSE THIS PLUGIN</strong> section. There you will see a warning message and a button.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"275\" src=\"https://i0.wp.com/developer.wordpress.org/files/2020/04/HowtoClose.png?resize=1024%2C275&#038;ssl=1\" alt=\"Image of the &quot;Close this plugin&quot; feature, with the note &quot;WARNING: Closing your plugin is intended to be a permanent action. You will not be able to reopen it without contacting the plugins team.&quot; Below that is a button saying &quot;I understand.&quot;\" class=\"wp-image-127346\" srcset=\"https://i0.wp.com/developer.wordpress.org/files/2020/04/HowtoClose.png?resize=1024%2C275&amp;ssl=1 1024w, https://i0.wp.com/developer.wordpress.org/files/2020/04/HowtoClose.png?resize=300%2C81&amp;ssl=1 300w, https://i0.wp.com/developer.wordpress.org/files/2020/04/HowtoClose.png?resize=768%2C206&amp;ssl=1 768w, https://i0.wp.com/developer.wordpress.org/files/2020/04/HowtoClose.png?w=1332&amp;ssl=1 1332w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\" /></figure>\n\n\n\n<p>If you agree to the warning, and want to close your plugin, press the button.</p>\n\n\n\n<p>Keep in mind, you <em>will not</em> get your plugin restored unless you can justify your situation. Closing a plugin by request is intended to be <strong>permanent</strong>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What if I accidentally closed my plugin?</h3>\n\n\n\n<p>Email <code>plugins@wordpress.org</code> and ask to please have your plugin reopened. However you will be asked how you managed to do that so that we can improve the functionality of the feature.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why won&#8217;t it let me close my own plugin?</h3>\n\n\n\n<p>Assuming you&#8217;re logged in as the correct account, it&#8217;s probably because you have too many users. If your plugin has more than 10,000 users, you will need to email <code>plugins@wordpress.org</code> and request for us to close it.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I temporarily close my plugin?</h3>\n\n\n\n<p>No. </p>\n\n\n\n<p>We do not permit this as it creates a poor experience for users. Hiding plugins makes users think the plugin has been pulled for security or guideline issues, which causes them not to trust you anymore. We cannot prevent what they think, so instead we prohibit &#8216;temporary&#8217; closures. </p>\n\n\n\n<p>Generally people want to do this when their plugin has a bug that is being fixed, or when they&#8217;re unable to support it. We recommend you instead just fix the bug as soon as possible, or if you cannot support the plugin, update the readme to say it&#8217;s currently unsupported and why.</p>\n\n\n\n<p>If this is for a brand new plugin, you should just call it a &#8216;public beta&#8217; so people are aware of the status.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What happens when a plugin is closed?</h3>\n\n\n\n<p>When a plugin is closed, the page shows as closed and the zips are no longer generated. No one will be able to download the plugin via the website, nor will they be able to install it via the WordPress admin. The SVN repository will remain accessible to allow others to download and fork the code if desired, per the tenets of the directory. </p>\n\n\n\n<p>After 60 days, the closure message will change to alert people as to <em>why</em> it was closed but only in the broadest terms (Guideline Violation, Security, etc) and not with explicit details.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why was my plugin closed?</h3>\n\n\n\n<p>Plugins are closed for guideline violations, security issues, or by author requests. In the case of active issues (such as copyright infringement, abuse, and security), all accounts with commit access to a plugin are notified. </p>\n\n\n\n<p>If a plugin has never been used within 6 months (i.e. no code has been pushed to SVN), SVN is broken for upwards of 12 months, or a plugin&#8217;s readme indicates it&#8217;s deprecated, we <em>may</em> close without notification.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why was someone else&#8217;s plugin closed?</h3>\n\n\n\n<p>As of 2017, plugin closure reasons are tracked in the plugin database. Sixty days after a plugin is closed, the reason for the closure will be made public:</p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" width=\"1058\" height=\"526\" src=\"https://i0.wp.com/developer.wordpress.org/files/2015/04/not-hello-dolly.jpg?resize=1058%2C526&#038;ssl=1\" alt=\"Example of a closed plugin with the reason 'Author Request'\" class=\"wp-image-37702\" srcset=\"https://i0.wp.com/developer.wordpress.org/files/2015/04/not-hello-dolly.jpg?w=1058&amp;ssl=1 1058w, https://i0.wp.com/developer.wordpress.org/files/2015/04/not-hello-dolly.jpg?resize=300%2C149&amp;ssl=1 300w, https://i0.wp.com/developer.wordpress.org/files/2015/04/not-hello-dolly.jpg?resize=768%2C382&amp;ssl=1 768w, https://i0.wp.com/developer.wordpress.org/files/2015/04/not-hello-dolly.jpg?resize=1024%2C509&amp;ssl=1 1024w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\" /></figure>\n\n\n\n<p>Please note: We do not publicly disclose the details on exactly why a plugin has been closed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Can I get someone else&#8217;s plugin closed?</h3>\n\n\n\n<p>If you report an <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-security/reporting-plugin-security-issues/\">security issue</a> or a <a href=\"https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/\">guideline violation</a> in a plugin to <code>plugins@wordpress.org</code>, we will review and take appropriate action. Most of the time, this involves closing a plugin. Your name will not be disclosed unless you ask for it to be so, in order to protect you from backlash.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Someone posted a copy of my plugin! What do I do?</h3>\n\n\n\n<p>Email <code>plugins@wordpress.org</code> with a link to the stolen plugin. Include either a link to where we can download yours or attach the zip. We will compare the two files, as well as all the coding history we have, to determine if the plugin is, indeed, theft, or just an uncredited fork. </p>\n\n\n\n<p>Keep in mind, if you licensed your plugin as GPLv2 or later, then it&#8217;s perfectly permissible to fork your work, as long as copyright remains intact and you&#8217;re credited.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What do I do if someone copied some of my code and didn&#8217;t credit me?</h3>\n\n\n\n<p>Email <code>plugins@wordpress.org</code> right away! <strong>Especially</strong> if your code was non-GPL. While we do permit people to fork other plugins and include that code in their own plugins, it must be credited at all times. Copyright and credits are a requirement.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Will you close another plugin for violating a brand/trademark?</h3>\n\n\n\n<p>We do our best to uphold copyright and trademark requirements, as well as prevent brand confusion. Before plugin are approved, we often require them to make some of the more obvious changes. That said, there is a limit to how &#8216;different&#8217; a URL or name can be when we have 60,000 plugins in the directory, and when some terms are quite common (like &#8216;popup&#8217; or &#8216;all-in-one&#8217;). Because of that, we require developers to change the plugin&#8217;s <strong>display name</strong> to no longer cause conflict or confusion.</p>\n\n\n\n<p>If someone is clearly infringing on your copyright or trademark or existing brand, be it by display name or use of trademarked images, please email us at <code>plugins@wordpress.org</code> with some proof and we will contact the developer and require changes.</p>\n\n\n\n<p>We do expect these to be <em>reasonable</em> requests. That is, if you send us a complaint and list 12 plugins that all use the term &#8216;best contact form&#8217; because that&#8217;s your plugin name, we will review the plugins and only close them if they&#8217;re using the phrase excessively. If they use it once (i.e. &#8220;This is the best contact form plugin in the Faroe Islands&#8221;) then it&#8217;s acceptable. If they&#8217;re keyword stuffing the phrase, we&#8217;re more likely to close them for keyword stuffing. Simply, if your plugin name is super generic, this is going to happen, and it&#8217;s usually <strong>not</strong> an infringement case.</p>\n\n\n\n<p>Also note that if it&#8217;s not <strong>your</strong> trademark, we cannot accept your report. It is the responsibility of the trademark owners, not it&#8217;s users, to manage and maintain that.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How can I send a security report?</h3>\n\n\n\n<p>Email <code>plugins@wordpress.org</code> a clear and concise description of the issue. <a href=\"https://developer.wordpress.org/plugins/wordpress-org/plugin-security/reporting-plugin-security-issues/\">Please read our document on reporting security issues for details</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Do you provide bounties for finding bugs in a plugin?</h3>\n\n\n\n<p>No. We have no relationship with any bug bounty programs, so we don&#8217;t file your reports etc to them. The only one with which we work is <a href=\"https://hackerone.com/automattic\">hackerone.com/automattic</a> and that&#8217;s for bugs related to Automattic properties. Everything else is on your own, don&#8217;t ask us to submit things.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Do you help file or provide CVEs?</h3>\n\n\n\n<p>No. We do not have the ability to assist with CVEs.</p>\n\n\n\n<h3 class=\"wp-block-heading\">My plugin was closed, can I reopen it?</h3>\n\n\n\n<p>Maybe. If it was closed for a security reason, fix the issue, reply to the email, and most of the time we&#8217;ll reopen the plugin unless it has more security issues or severe guideline issues. If it was closed for guideline violations, it depends on the severity and nature of the violation. Repeat offenders are less likely to have a plugin reopened, for example, than first-timers.</p>\n\n\n\n<p>If you asked for the plugin to be closed, you will be expected to explain why the change of heart. Plugins are intended to remain closed when a developer requests it, and not reopened again a month later.</p>\n\n\n\n<p><em>All</em> plugins must pass a current standards and security review in order to be restored. This is not optional. Users will lose more faith in you for having your plugin closed multiple times than they would for one longer closure where you address all the potential issues.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Why was my plugin closed when it was my employee/co-worker who violated guidelines?</h3>\n\n\n\n<p>Everyone who represents a plugin, from support tech to developer, is the responsibility of the plugin owner. If they violate the guidelines egregiously, then the owners are expected to accept those consequences and correct course. When that doesn&#8217;t happen, plugins get closed. We notify the plugin owners in these cases and explain why and do our best to keep plugins open.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><em>All</em> my plugins were closed! How can I get them back?</h3>\n\n\n\n<p>It&#8217;s exceptionally rare that we close <span style=\"text-decoration: underline\">all</span> of a developer&#8217;s plugins. In general it happens because of the following:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>You asked us to close all your plugins</li>\n\n\n\n<li>Email issues\n<ol class=\"wp-block-list\">\n<li>The email bounced and we were unable to get in touch</li>\n\n\n\n<li>The email sent us auto-replies and warnings were sent at least twice to fix that </li>\n</ol>\n</li>\n\n\n\n<li>Guideline issues\n<ol class=\"wp-block-list\">\n<li>Previous censuring for behaviour and/or a final warning was issued</li>\n\n\n\n<li>Delivering legal threats to the directory and/or the volunteers</li>\n\n\n\n<li>The violation was deemed &#8216;egregious&#8217; (death threats, hundreds of sock puppets, harassment, etc) </li>\n</ol>\n</li>\n</ol>\n\n\n\n<p>If you asked us to close them, you have to explain <em>why</em> the change of heart.</p>\n\n\n\n<p>If you&#8217;re having email issues, you have to resolve them and you&#8217;ll be required to bring all your plugins up to current standards of security and guidelines.</p>\n\n\n\n<p>As for that last one &#8230; Generally you don&#8217;t get to come back from that. If we deliver you a final warning for your behaviour and, within less than a year, you start up again with the issues (or fail to resolve all the issues we mentioned), we&#8217;re not going to reopen your plugins.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I just got a final warning. What do I do?</h3>\n\n\n\n<p>First and foremost, <em>take it seriously</em>. The email will list exactly what the problems have been and why we&#8217;ve chosen to escalate to a final warning. Plugin Owners are expected to resolve all the issues, to cease causing new guideline violations, and to closely monitor the actions of any coworkers. In short, stop breaking the guidelines, stop making excuses, apologize for any misbehaviour, and correct course.</p>\n\n\n\n<p>The last thing we want to do is ban someone and disable all their plugins. It&#8217;s not healthy for the community. At the same time, if a developer is unable or unwilling to play by the same rules as everyone else, it&#8217;s detrimental to keep then in the directory and disrespectful to everyone else.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Plugin Ownership</h2>\n\n\n\n<h3 class=\"wp-block-heading\">How do I give someone else access to my plugin?</h3>\n\n\n\n<p>To add users as committers, that is give them access to update code, go to <code>https://wordpress.org/plugins/YOURPLUGIN/advanced</code> and add their username in as a committer.</p>\n\n\n\n<p>To have them show up as an author, add their username to the <code>readme.txt</code> file.</p>\n\n\n\n<p><em>Do not add regular users as authors.</em> It&#8217;s meant for people who help with development only. This means if someone &#8216;inspired&#8217; you, you should <span style=\"text-decoration: underline\">not</span> add them as an author.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What happens to a plugin if the plugin owner gets blocked?</h3>\n\n\n\n<p>The leadership of the WordPress project and the Plugin Review team will review each case individually.</p>\n\n\n\n<p>Not having a new owner for a plugin can have a lot of security implications, as users would no longer be able to receive new updates.</p>\n\n\n\n<p>In most cases, the plugin will be:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Closed for new updates:</strong> When the plugin doesn&#8217;t have a lot of active installations or is only necessary for specific use cases, the team will likely just close it.</li>\n\n\n\n<li><strong>Transferred to the WP community:</strong> Whenever we have a plugin that is relevant enough to become a community/canonical project, it could be transferred to the <code>wordpressdotorg</code> user.</li>\n\n\n\n<li><strong><a href=\"https://developer.wordpress.org/plugins/wordpress-org/take-over-an-existing-plugin/\">Adopted by a new user</a>:</strong> In an application process managed by the team, it could be possibly donated to a different user if approved by the WordPress project leadership.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">How do I remove someone&#8217;s access from my plugin?</h3>\n\n\n\n<p>Anyone with commit access can do this. Go to <code>https://wordpress.org/plugins/YOURPLUGIN/advanced</code> and hover over their ID. A delete link will appear. Click on it.</p>\n\n\n\n<p>Please don&#8217;t delete yourself.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How do I change the plugin owner?</h3>\n\n\n\n<p>Go to the Advanced tab and scroll down to the Danger Zone. There you will see a section for <strong>Transfer Your Plugin</strong>. Pick someone from the dropdown and click the button.</p>\n\n\n\n<p>For more details, please read the <a href=\"https://developer.wordpress.org/plugins/wordpress-org/transferring-your-plugin-to-a-new-owner/\">documentation on transferring plugins</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">I tried to transfer my plugin but it says I can&#8217;t. Why not?</h3>\n\n\n\n<p>Plugins with a large number of users (over 10,000) or ones that are deemed critical to the WordPress project (such as featured or beta plugins) can only be transfered via written request to the plugins team. <a href=\"https://developer.wordpress.org/plugins/wordpress-org/transferring-your-plugin-to-a-new-owner/\">Please read the documentation on transfering plugins for details</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">How can I take over an abandoned plugin?</h3>\n\n\n\n<p><a href=\"https://developer.wordpress.org/plugins/wordpress-org/take-over-an-existing-plugin/\">We permit users to adopt existing plugins that are no longer currently developed</a>.</p>\n\n\n\n<p>We ask you try to connect with the original developers first, so they can add you. In some case, that&#8217;s not possible and you should start with fixing the plugin. Make sure it meets coding standards, is secure, and update the copyright information to include yourself. Then you can contact us regarding <a href=\"https://developer.wordpress.org/plugins/wordpress-org/take-over-an-existing-plugin/\">plugin adoption</a>.</p>\n\n\n\n<p>We offer <strong>no</strong> guarantee that you will be given anyone&#8217;s plugin, even following a successful review.</p>\n\n\n\n<h3 class=\"wp-block-heading\">Are these offers to buy my plugin legit?</h3>\n\n\n\n<p>Short answer: Probably not.</p>\n\n\n\n<p>Many developers receive unsolicited emails or offers to purchase their plugin. We have found the vast majority of these to be fraudulent and do <em>not</em> recommend you follow up with them.</p>\n\n\n\n<p>While legitimate offers do come, they&#8217;re usually from the official company to whom a plugin is related, or from a well established plugin company. The ones that start &#8220;We’re reaching out to the WordPress community &#8230;&#8221; or &#8220;We are looking to acquire existing WordPress plugins &#8230;&#8221; should not be trusted. Such purchases have often destroyed the reputation of the plugin (and the original developer) by engaging in sleazy tactics such as tracking users or other serious guideline violations.</p>\n\n\n\n<p>If you do choose to sell your plugin (or give it away to someone else), please make sure the new owners understand all the <a href=\"https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/\">guidelines of the repository</a>. Should they violate our terms the plugin will be removed, and we may not give it back depending on the level of the violation. Whomever has commit access to a plugin has the ownership and responsibility of it’s behavior for users. Spamming, inserting tracking data, and adding junk features are the fastest way to ruin your plugin.</p>\n\n\n\n<p>We advocate only giving your plugin to people you <em>personally</em> have vetted, and that you trust with being responsible with your code and your users.</p>\n\n\n\n<h3 class=\"wp-block-heading\">What happens when a plugin developer dies?</h3>\n\n\n\n<p>When a developer is determined to have died, they are removed from their own plugins in order to prevent the unethical from gaining access and harming users. If they are the only developer, the plugin may be closed. All attempts are made to find their friends and coworkers, to offer them a chance to adopt the code first, but if no one reliable or willing&nbsp;can be found the plugin is closed.</p>\n",
        "protected": false
    },
    "author": 71562,
    "featured_media": 0,
    "parent": 11185,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-15282",
        "plugin-handbook",
        "type-plugin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15282",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/plugin-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/71562"
            }
        ],
        "version-history": [
            {
                "count": 102,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15282/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155510,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15282/revisions/155510"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11185"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=15282"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}