{
    "id": 15264,
    "date": "2015-04-09T14:22:49",
    "date_gmt": "2015-04-09T14:22:49",
    "guid": {
        "rendered": "http://developer.wordpress.org/?post_type=plugin-handbook&#038;p=15264"
    },
    "modified": "2024-03-15T11:47:07",
    "modified_gmt": "2024-03-15T11:47:07",
    "slug": "detailed-plugin-guidelines",
    "status": "publish",
    "type": "plugin-handbook",
    "link": "https://developer.wordpress.org/plugins/wordpress-org/detailed-plugin-guidelines/",
    "title": {
        "rendered": "Detailed Plugin Guidelines"
    },
    "content": {
        "rendered": "\n<div class=\"wp-block-wporg-notice is-tip-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\">Last Updated: March 15, 2024</div></div>\n\n\n\n\n<div class=\"wp-block-wporg-notice is-info-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\">Adding a Block Only plugin? Please read the <a href=\"https://developer.wordpress.org/plugins/wordpress-org/block-specific-plugin-guidelines/\">Block Specific Guidelines</a></div></div>\n\n\n\n\n<h2 class=\"wp-block-heading\">The Plugin Directory</h2>\n\n\n\n<p>The goal of the WordPress Plugin Directory is to provide a safe place for all WordPress users &#8211; from the non-technical to the developer &#8211; to download plugins that are consistent with the goals of the WordPress project.</p>\n\n\n\n<p>To that end, we want to ensure a simple and transparent process for developers to submit plugins for the directory. As part of our ongoing efforts to make the plugin directory inclusion process more transparent, we have created a list of developer guidelines. We strive to create a level playing field for all developers.</p>\n\n\n\n<p>If you have suggestions to improve the guidelines, or questions about them, please email <code>plugins@wordpress.org</code> and let us know.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Developer Expectations</h2>\n\n\n\n<p>Developers, all users with commit access, and all users who officially support a plugin are expected to abide by the following guidelines:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Plugin Directory Guidelines (this document)</li>\n\n\n\n<li><a href=\"https://make.wordpress.org/handbook/community-code-of-conduct/\">Community Guidelines</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/support/guidelines/\">Forums Guidelines</a> (should they use the forums/reviews)</li>\n</ul>\n\n\n\n<p>Violations may result in plugins or plugin data (for previously approved plugins) being removed from the directory until the issues are resolved. Plugin data, such as user reviews and code, may not be restored depending on the nature of the violation and the results of a peer-review of the situation. Repeat violations may result in all the author’s plugins being removed and the developer being banned from hosting plugins on WordPress.org.</p>\n\n\n\n<p>It is the responsibility of the plugin developer to ensure their contact information on WordPress.org is up to date and accurate, in order that they receive all notifications from the plugins team. Auto-replies and emails that route to a support system are not permitted as they historically prevent humans from addressing emails in a timely fashion.</p>\n\n\n\n<p>All code in the directory should be made as secure as possible. Security is the ultimate responsibility of the plugin developer, and the Plugin Directory enforces this to the best of our ability. Should a plugin be found to have security issues, it will be closed until the situation is resolved. In extreme cases the plugin may be updated by the WordPress Security team and propagated for the safety of the general public.</p>\n\n\n\n<p>While we attempt to account for as many relevant interpretations of the guidelines as possible, it is unreasonable to expect that every circumstance will be explicitly covered. If you are uncertain whether a plugin might violate the guidelines, please contact <code>plugins@wordpress.org</code> and ask.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The Guidelines</h2>\n\n\n\n<h3 class=\"wp-block-heading\">1. Plugins must be compatible with the GNU General Public License</h3>\n\n\n\n<p>Although any GPL-compatible license is acceptable, using the same license as WordPress — “GPLv2 or later” — is strongly recommended. All code, data, and images — anything stored in the plugin directory hosted on WordPress.org — must comply with the GPL or a GPL-Compatible license. Included third-party libraries, code, images, or otherwise, must be compatible. For a specific list of compatible licenses, please read the <a href=\"https://www.gnu.org/philosophy/license-list.html#GPLCompatibleLicenses\">GPL-Compatible license list</a> on gnu.org.</p>\n\n\n\n<h3 class=\"wp-block-heading\">2. Developers are responsible for the contents and actions of their plugins.</h3>\n\n\n\n<p>It is the sole responsibility of plugin developers to ensure all files within their plugins comply with the guidelines. Intentionally writing code to circumvent guidelines, or restoring code they were asked to remove, is prohibited (see #9 illegal/dishonest actions).</p>\n\n\n\n<p>Developers are expected to confirm, before uploading to SVN, the licensing of all included files, from original source code to images and libraries. In addition, they must comply to the terms of use for all third party services and APIs utilized by their plugins. If there is no way to validate the licensing of a library or the terms of an API, then they cannot be used.</p>\n\n\n\n<h3 class=\"wp-block-heading\">3. A stable version of a plugin must be available from its WordPress Plugin Directory page.</h3>\n\n\n\n<p>The only version of the plugin that WordPress.org distributes is the one in the directory. Though people may develop their code somewhere else, users will be downloading from the directory, not the development environment.</p>\n\n\n\n<p>Distributing code via alternate methods, while not keeping the code hosted here up to date, may result in a plugin being removed.</p>\n\n\n\n<h3 class=\"wp-block-heading\">4. Code must be (mostly) human readable.</h3>\n\n\n\n<p>Obscuring code by hiding it with techniques or systems similar to <code>p,a,c,k,e,r</code>&#8216;s obfuscate feature, uglify&#8217;s mangle, or unclear naming conventions such as <code>$z12sdf813d</code>, is not permitted in the directory. Making code non-human readable forces future developers to face an unnecessary hurdle, as well as being a common vector for hidden, malicious code.</p>\n\n\n\n<p>We require developers to provide public, maintained access to their source code and any build tools in one of the following ways:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Include the source code in the deployed plugin</li>\n\n\n\n<li>A link in the readme to the development location</li>\n</ul>\n\n\n\n<p>We strongly recommend you document how any development tools are to be used.</p>\n\n\n\n<h3 class=\"wp-block-heading\">5. Trialware is not permitted.</h3>\n\n\n\n<p>Plugins may not contain functionality that is restricted or locked, only to be made available by payment or upgrade. Functionality may not be disabled after a trial period or quota is met. In addition, plugins that provide sandbox only access to APIs and services are also trial, or test, plugins and not permitted.</p>\n\n\n\n<p>Paid functionality in services <em>is</em> permitted (see guideline 6: serviceware), provided all the code inside a plugin is fully available. We recommend the use of add-on plugins, hosted outside of WordPress.org, in order to exclude the premium code. Situations where a plugin is intended as a developer tool only will be reviewed on a case by case basis.</p>\n\n\n\n<p>Attempting to upsell the user on ad-hoc products and features <em>is</em> acceptable, provided it falls within bounds of guideline 11 (hijacking the admin experience).</p>\n\n\n\n<h3 class=\"wp-block-heading\">6. Software as a Service is permitted.</h3>\n\n\n\n<p>Plugins that act as an interface to some external third party service (e.g. a video hosting site) are allowed, even for paid services. The service itself must provide functionality of substance and be clearly documented in the readme file submitted with the plugin, preferably with a link to the service’s Terms of Use.</p>\n\n\n\n<p>Services and functionality <em>not</em> allowed include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>A service that exists for the sole purpose of validating licenses or keys while all functional aspects of the plugin are included locally is not permitted.</li>\n\n\n\n<li>Creation of a service by moving arbitrary code out of the plugin so that the service may falsely appear to provide supplemented functionality is prohibited.</li>\n\n\n\n<li>Storefronts that are not services. A plugin that acts only as a front-end for products to be purchased from external systems will not be accepted.</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">7. Plugins may not track users without their consent.</h3>\n\n\n\n<p>In the interest of protecting user privacy, plugins may not contact external servers without <em>explicit</em> and authorized consent. This is commonly done via an &#8216;opt in&#8217; method, requiring registration with a service or a checkbox within the plugin settings. Documentation on how any user data is collected, and used, should be included in the plugin’s readme, preferably with a clearly stated privacy policy.</p>\n\n\n\n<p>Some examples of prohibited tracking include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Automated collection of user data without explicit confirmation from the user.</li>\n\n\n\n<li>Intentionally misleading users into submitting information as a requirement for use of the plugin itself.</li>\n\n\n\n<li>Offloading assets (including images and scripts) that are unrelated to a service.</li>\n\n\n\n<li>Undocumented (or poorly documented) use of external data (such as blocklists).</li>\n\n\n\n<li>Third-party advertisement mechanisms which track usage and/or views.</li>\n</ul>\n\n\n\n<p>An exception to this policy is Software as a Service, such as Twitter, an Amazon CDN plugin, or Akismet. By installing, activating, registering, and configuring plugins that utilize those services, consent is granted for those systems.</p>\n\n\n\n<h3 class=\"wp-block-heading\">8. Plugins may not send executable code via third-party systems.</h3>\n\n\n\n<p>Externally loading code from documented services is permitted, however all communication must be made as securely as possible. Executing outside code within a plugin when not acting as a service is not allowed, for example:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Serving updates or otherwise installing plugins, themes, or add-ons from servers other than WordPress.org’s</li>\n\n\n\n<li>Installing premium versions of the same plugin</li>\n\n\n\n<li>Calling third party CDNs for reasons other than font inclusions; all non-service related JavaScript and CSS must be included locally</li>\n\n\n\n<li>Using third party services to manage regularly updated lists of data, when not explicitly permitted in the service’s terms of use</li>\n\n\n\n<li>Using iframes to connect admin pages; APIs should be used to minimize security risks</li>\n</ul>\n\n\n\n<p>Management services that interact with and push software down to a site <em>are</em> permitted, provided the service handles the interaction on it&#8217;s own domain and not within the WordPress dashboard.</p>\n\n\n\n<h3 class=\"wp-block-heading\">9. Developers and their plugins must not do anything illegal, dishonest, or morally offensive.</h3>\n\n\n\n<p>While this is subjective and rather broad, the intent is to prevent plugins, developers, and companies from abusing the freedoms and rights of end users as well as other plugin developers.</p>\n\n\n\n<p>This includes (but is not restricted to) the following examples:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Artificially manipulating search results via keyword stuffing, black hat SEO, or otherwise</li>\n\n\n\n<li>Offering to drive more traffic to sites that use the plugin</li>\n\n\n\n<li>Compensating, misleading, pressuring, extorting, or blackmailing others for reviews or support</li>\n\n\n\n<li>Implying users must pay to unlock included features</li>\n\n\n\n<li>Creating accounts to generate fake reviews or support tickets (i.e. sockpuppeting)</li>\n\n\n\n<li>Taking other developers’ plugins and presenting them as original work</li>\n\n\n\n<li>implying that a plugin can create, provide, automate, or guarantee legal compliance</li>\n\n\n\n<li>Utilizing the user’s server or resources without permission, such as part of a botnet or crypto-mining</li>\n\n\n\n<li>Violations of the <a href=\"https://make.wordpress.org/handbook/community-code-of-conduct/\">WordPress.org Community Code of Conduct</a></li>\n\n\n\n<li>Violations of the <a href=\"https://make.wordpress.org/community/handbook/wordcamp-organizer/planning-details/code-of-conduct/\">WordCamp code of conduct</a></li>\n\n\n\n<li>Violations of the <a href=\"https://wordpress.org/support/guidelines/\">Forum Guidelines</a></li>\n\n\n\n<li>Harassment, threats, or abuse directed at any other member of the WordPress community</li>\n\n\n\n<li>Falsifying personal information to intentionally disguise identities and avoid sanctions for previous infractions</li>\n\n\n\n<li>Intentionally attempting to exploit loopholes in the guidelines</li>\n</ul>\n\n\n\n<h3 class=\"wp-block-heading\">10. Plugins may not embed external links or credits on the public site without explicitly asking the user’s permission.</h3>\n\n\n\n<p>All &#8220;Powered By&#8221; or credit displays and links included in the plugin code must be optional and default to <em>not</em> show on users&#8217; front-facing websites. Users must opt-in to displaying any and all credits and links via clearly stated and understandable choices, not buried in the terms of use or documentation. Plugins may not require credit or links be displayed in order to function. Services <em>are</em> permitted to brand their output as they see fit, provided the code is handled in the service and not the plugin.</p>\n\n\n\n<h3 class=\"wp-block-heading\">11. Plugins should not hijack the admin dashboard.</h3>\n\n\n\n<p>Users prefer and expect plugins to feel like part of WordPress. Constant nags and overwhelming the admin dashboard with unnecessary alerts detract from this experience.</p>\n\n\n\n<p>Upgrade prompts, notices, alerts, and the like must be limited in scope and used sparingly, be that contextually or only on the plugin’s setting page. Site wide notices or embedded dashboard widgets <em>must</em> be dismissible or self-dismiss when resolved. Error messages and alerts must include information on how to resolve the situation, and remove themselves when completed.</p>\n\n\n\n<p>Advertising within the WordPress dashboard should be avoided, as it is generally ineffective. Users normally only visit settings pages when they&#8217;re trying to solve a problem. Making it harder to use a plugin does not generally encourage a good review, and we recommend limiting any ads placed therein. Remember: tracking referrals via those ads is not permitted (see guideline 7) and most third-party systems do not permit back-end advertisements. Abusing the guidelines of an advertising system will result in developers being reported upstream.</p>\n\n\n\n<p>Developers are welcome and encouraged to include links to their own sites or social networks, as well as locally (within the plugin) including images to enhance that experience.</p>\n\n\n\n<h3 class=\"wp-block-heading\">12. Public facing pages on WordPress.org (readmes) must not spam.</h3>\n\n\n\n<p>Public facing pages, including readmes and translation files, may not be used to spam. Spammy behavior includes (but is not limited to) unnecessary affiliate links, tags to competitors plugins, use of over 5 tags total, blackhat SEO, and keyword stuffing.</p>\n\n\n\n<p>Links to directly required products, such as themes or other plugins required for the plugin&#8217;s use, are permitted within moderation. Similarly, related products may be used in tags but not competitors. If a plugin is a WooCommerce extension, it may use the tag &#8216;woocommerce.&#8217; However if the plugin is an alternative to Akismet, it may not use that term as a tag. Repetitive use of a tag or specific term is considered to be keyword stuffing, and is not permitted.</p>\n\n\n\n<p>Readmes are to be written for people, not bots.</p>\n\n\n\n<p>In all cases, affiliate links must be disclosed and must directly link to the affiliate service, not a redirect or cloaked URL.</p>\n\n\n\n<h3 class=\"wp-block-heading\">13. Plugins must use WordPress&#8217; default libraries.</h3>\n\n\n\n<p>WordPress includes a number of useful libraries, such as jQuery, Atom Lib, SimplePie, PHPMailer, PHPass, and more. For security and stability reasons plugins may not include those libraries in their own code. Instead plugins must use the versions of those libraries packaged with WordPress.</p>\n\n\n\n<p>For a list of all javascript libraries included in WordPress, please review <a href=\"https://developer.wordpress.org/reference/functions/wp_enqueue_script/#notes\">Default Scripts Included and Registered by WordPress</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">14. Frequent commits to a plugin should be avoided.</h3>\n\n\n\n<p>The SVN repository is a release repository, not a development one. All commits, code or readme files, will trigger a regeneration of the zip files associated with the plugin, so only code that is ready for deployment (be that a stable release, beta, or RC) should be pushed to SVN. Including a descriptive and informative message with each commit is strongly recommended. Frequent ‘trash’ commit messages like ‘update’ or ‘cleanup’ makes it hard for others to follow changes. Multiple, rapid-fire commits that only tweak minor aspects of the plugin (including the readme) cause undue strain on the system and can be seen as gaming Recently Updated lists.</p>\n\n\n\n<p>An exception to this is when readme files are updated solely to indicate support of the latest release of WordPress.</p>\n\n\n\n<h3 class=\"wp-block-heading\">15. Plugin version numbers must be incremented for each new release.</h3>\n\n\n\n<p>Users are only alerted to updates when the plugin version is increased. The trunk readme.txt must always reflect the current version of the plugin. For more information on tagging, please read our <a href=\"https://developer.wordpress.org/plugins/wordpress-org/how-to-use-subversion/#tags\">SVN directions on tagging</a> and <a href=\"https://developer.wordpress.org/plugins/wordpress-org/how-your-readme-txt-works/\">how the readme.txt works</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\">16. A complete plugin must be available at the time of submission.</h3>\n\n\n\n<p>All plugins are examined prior to approval, which is why a zip file is required. Names cannot be “reserved” for future use or to protect brands (see #17: respect brands). Directory names for approved plugins that are not used may be given to other developers.</p>\n\n\n\n<h3 class=\"wp-block-heading\">17. Plugins must respect trademarks, copyrights, and project names.</h3>\n\n\n\n<p>The use of trademarks or other projects as the sole or initial term of a plugin slug is prohibited unless proof of legal ownership/representation can be confirmed. For example, the <a href=\"http://wordpressfoundation.org/trademark-policy/\">WordPress Foundation has trademarked the term “WordPress”</a> and it is a violation to use “wordpress” in a domain name. This policy extends to plugin slugs, and we will not permit a slug to begin with another product&#8217;s term.</p>\n\n\n\n<p>For example only employees of Super Sandbox should use the slug “super-sandbox,&#8221; or their brand in a context such as “Super Sandbox Dancing Sloths.” Non-employees should use a format such as “Dancing Sloths for Superbox” instead to avoid potentially misleading users into believing the plugin was developed by Super Sandbox. Similarly, if you don&#8217;t represent the &#8220;MellowYellowSandbox.js&#8221; project, it&#8217;s inappropriate to use that as the name of your plugin.</p>\n\n\n\n<p>Original branding is recommended as it not only helps to avoid confusion, but is more memorable to the user.</p>\n\n\n\n<h3 class=\"wp-block-heading\">18. We reserve the right to maintain the Plugin Directory to the best of our ability.</h3>\n\n\n\n<p>Our intent is to enforce these guidelines with as much fairness as humanly possible. We do this to ensure overall plugin quality and the safety of their users. To that end, we reserve the following rights:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>&#8230; to update these guidelines at any time.</li>\n\n\n\n<li>&#8230; to disable or remove any plugin from the directory, even for reasons not explicitly covered by the guidelines.</li>\n\n\n\n<li>&#8230; to grant exceptions and allow developers time to address issues, even security related.</li>\n\n\n\n<li>&#8230; to remove developer access to a plugin in lieu of a new, active, developer.</li>\n\n\n\n<li>&#8230; to make changes to a plugin, without developer consent, in the interest of public safety.</li>\n</ul>\n\n\n\n<p>In return, we promise to use those rights sparingly and with as much respect as possible for both end users and developers.</p>\n",
        "protected": false
    },
    "author": 71562,
    "featured_media": 0,
    "parent": 11185,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-15264",
        "plugin-handbook",
        "type-plugin-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15264",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/plugin-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/71562"
            }
        ],
        "version-history": [
            {
                "count": 41,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15264/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 152774,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/15264/revisions/152774"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/plugin-handbook/11185"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=15264"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}