{
    "id": 25388,
    "date": "2017-02-06T19:13:11",
    "date_gmt": "2017-02-06T19:13:11",
    "guid": {
        "rendered": "https://developer.wordpress.org/?post_type=rest-api-handbook&#038;p=25388"
    },
    "modified": "2024-09-18T14:55:32",
    "modified_gmt": "2024-09-18T14:55:32",
    "slug": "adding-custom-endpoints",
    "status": "publish",
    "type": "rest-api-handbook",
    "link": "https://developer.wordpress.org/rest-api/extending-the-rest-api/adding-custom-endpoints/",
    "title": {
        "rendered": "Adding Custom Endpoints"
    },
    "content": {
        "rendered": "<p>The WordPress REST API is more than just a set of default routes. It is also a tool for creating custom routes and endpoints. The WordPress front-end provides a default set of URL mappings, but the tools used to create them (e.g. the Rewrites API, as well as the query classes: <code>WP_Query</code>, <code>WP_User</code>, etc) are also available for creating your own URL mappings, or custom queries.</p>\n<p>This document details how to create a new and completely custom route with its own endpoints. We&#8217;ll first work through a short example and then expand it out to the full controller pattern as used internally.</p>\n<h2>Bare Basics</h2>\n<p>So you want to add custom endpoints to the API? Fantastic! Let&#8217;s get started with a simple example.<br />\nLet&#8217;s start with a simple function that looks like this:</p>\n<pre><code class=\"language-php\">&lt;?php\n/**\n * Grab latest post title by an author!\n *\n * @param array $data Options for the function.\n * @return string|null Post title for the latest,\u2028 * or null if none.\n */\nfunction my_awesome_func( $data ) {\n  $posts = get_posts( array(\n    'author' =&gt; $data['id'],\n  ) );\n\n  if ( empty( $posts ) ) {\n    return null;\n  }\n\n  return $posts[0]-&gt;post_title;\n}\n</code></pre>\n<p>To make this available via the API, we need to register a route. This tells the API to respond to a given request with our function. We do this through a function called <code>register_rest_route</code>, which should be called in a callback on <code>rest_api_init</code> to avoid doing extra work when the API isn&#8217;t loaded.</p>\n<p>We need to pass in three things to <code>register_rest_route</code>: the namespace, the route we want, and the options. We&#8217;ll come back to the namespace in a bit, but for now, let&#8217;s pick <code>myplugin/v1</code>. We&#8217;re going to have the route match anything with <code>/author/{id}</code>, where <code>{id}</code> is an integer.</p>\n<pre><code class=\"language-php\">&lt;?php\nadd_action( 'rest_api_init', function () {\n  register_rest_route( 'myplugin/v1', '/author/(?P&lt;id&gt;\\d+)', array(\n    'methods' =&gt; 'GET',\n    'callback' =&gt; 'my_awesome_func',\n  ) );\n} );\n</code></pre>\n<p>Right now, we&#8217;re only registering the one endpoint for the route. The term &#8220;route&#8221; refers to the URL, whereas &#8220;endpoint&#8221; refers to the function behind it that corresponds to a method <em>and</em> a URL (for more information, see the <a href=\"https://developer.wordpress.org/rest-api/glossary/\">Glossary</a>).</p>\n<p>For example, if your site domain is <code>example.com</code> and you&#8217;ve kept the API path of <code>wp-json</code>, then the full URL would be `http://example.com/wp-json/myplugin/v1/author/(?P\\d+)`.</p>\n\n<div class=\"wp-block-wporg-notice is-alert-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\"><p>\nOn sites without pretty permalinks, the route is instead added to the URL as the <code>rest_route</code> parameter. For the above example, the full URL would then be <code>http://example.com/?rest_route=/myplugin/v1/author/(?P\\d+)</code></p>\n</div></div>\n\n<p>Each route can have any number of endpoints, and for each endpoint, you can define the HTTP methods allowed, a callback function for responding to the request and a permissions callback for creating custom permissions. In addition you can define allowed fields in the request and for each field specify a default value, a sanitization callback, a validation callback, and whether the field is required.</p>\n<h3>Namespacing</h3>\n<p>Namespaces are the first part of the URL for the endpoint. They should be used as a vendor/package prefix to prevent clashes between custom routes. Namespaces allows for two plugins to add a route of the same name, with different functionality.</p>\n<p>Namespaces in general should follow the pattern of <code>vendor/v1</code>, where <code>vendor</code> is typically your plugin or theme slug, and <code>v1</code> represents the first version of the API. If you ever need to break compatibility with new endpoints, you can then bump this to <code>v2</code>.</p>\n<p>The above scenario, two routes with the same name, from two different plugins, requires all vendors to use a unique namespace. Failing to do so is analogous to a failure to use a vendor function prefix, class prefix and/ or class namespace in a theme or plugin, which is <strong>very very bad</strong>.</p>\n<p>An added benefit of using namespaces is that clients can detect support for your custom API. The API index lists out the available namespaces on a site:</p>\n<pre><code class=\"language-php\">{\n  \"name\": \"WordPress Site\",\n  \"description\": \"Just another WordPress site\",\n  \"url\": \"http://example.com/\",\n  \"namespaces\": [\n    \"wp/v2\",\n    \"vendor/v1\",\n    \"myplugin/v1\",\n    \"myplugin/v2\",\n  ]\n}\n</code></pre>\n<p>If a client wants to check that your API exists on a site, they can check against this list. (For more information, see the <a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/discovery/\">Discovery guide</a>.)</p>\n<h3>Arguments</h3>\n<p>By default, routes receive all arguments passed in from the request. These are merged into a single set of parameters, then added to the Request object, which is passed in as the first parameter to your endpoint:</p>\n<pre><code class=\"language-php\">&lt;?php\nfunction my_awesome_func( WP_REST_Request $request ) {\n  // You can access parameters via direct array access on the object:\n  $param = $request['some_param'];\n\n  // Or via the helper method:\n  $param = $request-&gt;get_param( 'some_param' );\n\n  // You can get the combined, merged set of parameters:\n  $parameters = $request-&gt;get_params();\n\n  // The individual sets of parameters are also available, if needed:\n  $parameters = $request-&gt;get_url_params();\n  $parameters = $request-&gt;get_query_params();\n  $parameters = $request-&gt;get_body_params();\n  $parameters = $request-&gt;get_json_params();\n  $parameters = $request-&gt;get_default_params();\n\n  // Uploads aren't merged in, but can be accessed separately:\n  $parameters = $request-&gt;get_file_params();\n}\n</code></pre>\n<p>(To find out exactly how parameters are merged, check the source of <code>WP_REST_Request::get_parameter_order()</code>; the basic order is body, query, URL, then defaults.)</p>\n<p>Normally, you&#8217;ll get every parameter brought in unaltered. However, you can register your arguments when registering your route, which allows you to run sanitization and validation on these.</p>\n<p>If the request has the <code>Content-type: application/json</code> header set and valid JSON in the body, <code>get_json_params()</code> will return the parsed JSON body as an associative array.</p>\n<p>Arguments are defined as a map in the key <code>args</code> for each endpoint (next to your <code>callback</code> option). This map uses the name of the argument of the key, with the value being a map of options for that argument. This array can contain a key for <code>default</code>, <code>required</code>, <code>sanitize_callback</code> and <code>validate_callback</code>.</p>\n<ul>\n<li><code>default</code>: Used as the default value for the argument, if none is supplied.</li>\n<li><code>required</code>: If defined as true, and no value is passed for that argument, an error will be returned. No effect if a default value is set, as the argument will always have a value.</li>\n<li><code>validate_callback</code>: Used to pass a function that will be passed the value of the argument. That function should return true if the value is valid, and false if not.</li>\n<li><code>sanitize_callback</code>: Used to pass a function that is used to sanitize the value of the argument before passing it to the main callback.</li>\n</ul>\n<p>Using <code>sanitize_callback</code> and <code>validate_callback</code> allows the main callback to act only to process the request, and prepare data to be returned using the <code>WP_REST_Response</code> class. By using these two callbacks, you will be able to safely assume your inputs are valid and safe when processing.</p>\n<p>Taking our previous example, we can ensure the parameter passed in is always a number:</p>\n<pre><code class=\"language-php\">&lt;?php\nadd_action( 'rest_api_init', function () {\n  register_rest_route( 'myplugin/v1', '/author/(?P&lt;id&gt;\\d+)', array(\n    'methods' =&gt; 'GET',\n    'callback' =&gt; 'my_awesome_func',\n    'args' =&gt; array(\n      'id' =&gt; array(\n        'validate_callback' =&gt; function($param, $request, $key) {\n          return is_numeric( $param );\n        }\n      ),\n    ),\n  ) );\n} );\n</code></pre>\n<p>You could also pass in a function name to <code>validate_callback</code>, but passing certain functions like <code>is_numeric</code> directly will not only throw a warning about having extra parameters passed to it, but will also return <code>NULL</code> causing the callback function to be called with invalid data. We hope to <a href=\"https://core.trac.wordpress.org/ticket/34659\">eventually solve this problem in WordPress core</a>.</p>\n<p>We could also use something like <code>'sanitize_callback' =&gt; 'absint'</code> instead, but validation will throw an error, allowing clients to understand what they&#8217;re doing wrong. Sanitization is useful when you would rather change the data being input rather than throwing an error (such as invalid HTML).</p>\n<h3>Return Value</h3>\n<p>After your callback is called, the return value is then converted to JSON, and returned to the client. This allows you to return basically any form of data. In our example above, we&#8217;re returning either a string or null, which are automatically handled by the API and converted to JSON.</p>\n<p>Like any other WordPress function, you can also return a <code>WP_Error</code> instance. This error information will be passed along to the client, along with a 500 Internal Service Error status code. You can further customise your error by setting the <code>status</code> option in the <code>WP_Error</code> instance data to a code, such as <code>400</code> for bad input data.<br />\nTaking our example from before, we can now return an error instance:</p>\n<pre><code class=\"language-php\">&lt;?php\n/**\n * Grab latest post title by an author!\n *\n * @param array $data Options for the function.\n * @return string|null Post title for the latest,\n * or null if none.\n */\nfunction my_awesome_func( $data ) {\n  $posts = get_posts( array(\n    'author' =&gt; $data['id'],\n  ) );\n\n  if ( empty( $posts ) ) {\n    return new WP_Error( 'no_author', 'Invalid author', array( 'status' =&gt; 404 ) );\n  }\n\n  return $posts[0]-&gt;post_title;\n}\n</code></pre>\n<p>When an author doesn&#8217;t have any posts belonging to them, this will return a 404 Not Found error to the client:</p>\n<pre><code>HTTP/1.1 404 Not Found\n\n[{\n   \"code\": \"no_author\",\n   \"message\": \"Invalid author\",\n   \"data\": { \"status\": 404 }\n}]\n</code></pre>\n<p>For more advanced usage, you can return a <code>WP_REST_Response</code> object. This object &#8220;wraps&#8221; normal body data, but allows you to return a custom status code, or custom headers. You can also <a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/linking-and-embedding/\">add links to your response</a>. The quickest way to use this is via the constructor:</p>\n<pre><code class=\"language-php\">&lt;?php\n$data = array( 'some', 'response', 'data' );\n\n// Create the response object\n$response = new WP_REST_Response( $data );\n\n// Add a custom status code\n$response-&gt;set_status( 201 );\n\n// Add a custom header\n$response-&gt;header( 'Location', 'http://example.com/' );\n</code></pre>\n<p>When wrapping existing callbacks, you should always use <code>rest_ensure_response()</code> on the return value. This will take raw data returned from an endpoint and automatically turn it into a <code>WP_REST_Response</code> for you. (Note that <code>WP_Error</code> is not converted to a <code>WP_REST_Response</code> to allow proper error handling.)</p>\n<p>Importantly, a REST API route&#8217;s callback should <em>always</em> return data; it shouldn&#8217;t attempt to send the response body itself. This ensures that the additional processing that the REST API server does, like handling linking/embedding, sending headers, etc… takes place. In other words, don&#8217;t call <code>die( wp_json_encode( $data ) );</code> or <code>wp_send_json( $data )</code>. As of <a href=\"https://core.trac.wordpress.org/changeset/48361\">WordPress 5.5</a>, a <code>_doing_it_wrong</code> notice is issued if the <code>wp_send_json()</code> family of functions is used during a REST API request.</p>\n<blockquote><p>\n  Return a <a href=\"https://developer.wordpress.org/reference/classes/wp_rest_response/\" rel=\"class\">WP_REST_Response</a> or <a href=\"https://developer.wordpress.org/reference/classes/wp_error/\" rel=\"class\">WP_Error</a> object from your callback when using the REST API.\n</p></blockquote>\n<h3>Permissions Callback</h3>\n<p>You must also register a permissions callback for the endpoint. This is a function that checks if the user can perform the action (reading, updating, etc) before the real callback is called. This allows the API to tell the client what actions they can perform on a given URL without needing to attempt the request first.</p>\n<p>This callback can be registered as <code>permission_callback</code>, again in the endpoint options next to your <code>callback</code> option. This callback should return a boolean or a <code>WP_Error</code> instance. If this function returns true, the response will be processed. If it returns false, a default error message will be returned and the request will not proceed with processing. If it returns a <code>WP_Error</code>, that error will be returned to the client.</p>\n<p>The permissions callback is run after remote authentication, which sets the current user. This means you can use <code>current_user_can</code> to check if the user that has been authenticated has the appropriate capability for the action, or any other check based on current user ID. Where possible, you should always use <code>current_user_can</code>; instead of checking if the user is logged in (authentication), check whether they can perform the action (authorization).</p>\n<p>Once you register a <code>permission_callback</code>, you will need to authenticate your requests (for example by including a nonce parameter) or you will receive a <code>rest_forbidden</code> error. See <a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/authentication/\">Authentication</a> for more details.</p>\n<p>Continuing with our previous example, we can make it so that only editors or above can view this author data. We can check a number of different capabilities here, but the best is <code>edit_others_posts</code>, which is really the core of what an editor is. To do this, we just need a callback here:</p>\n<pre><code class=\"language-php\">&lt;?php\nadd_action( 'rest_api_init', function () {\n  register_rest_route( 'myplugin/v1', '/author/(?P&lt;id&gt;\\d+)', array(\n    'methods' =&gt; 'GET',\n    'callback' =&gt; 'my_awesome_func',\n    'args' =&gt; array(\n      'id' =&gt; array(\n        'validate_callback' =&gt; 'is_numeric'\n      ),\n    ),\n    'permission_callback' =&gt; function () {\n      return current_user_can( 'edit_others_posts' );\n    }\n  ) );\n} );\n</code></pre>\n<p>Note that the permission callback also receives the Request object as the first parameter, so you can do checks based on request arguments if you need to.</p>\n<p>As of <a href=\"https://core.trac.wordpress.org/changeset/48526\">WordPress 5.5</a>, if a <code>permission_callback</code> is not provided, the REST API will issue a <code>_doing_it_wrong</code> notice.</p>\n<blockquote><p>\n  The REST API route definition for myplugin/v1/author is missing the required permission_callback argument. For REST API routes that are intended to be public, use __return_true as the permission callback.\n</p></blockquote>\n<p>If your REST API endpoint is public, you can use <code>__return_true</code> as the permission callback.</p>\n<pre><code class=\"language-php\">&lt;?php\nadd_action( 'rest_api_init', function () {\n  register_rest_route( 'myplugin/v1', '/author/(?P&lt;id&gt;\\d+)', array(\n    'methods' =&gt; 'GET',\n    'callback' =&gt; 'my_awesome_func',\n    'permission_callback' =&gt; '__return_true',\n  ) );\n} );\n</code></pre>\n<h3>Discovery</h3>\n<p>If you&#8217;d like to enable <a href=\"https://developer.wordpress.org/rest-api/using-the-rest-api/discovery/#resource-discovery\">Resource Discovery</a> for your custom endpoint, you can do so using the <code>rest_queried_resource_route</code> filter. For example, consider a <a href=\"https://developer.wordpress.org/reference/hooks/query_vars/\">custom query var</a> <code>my-route</code> that contains the id of your custom resource. The following code snippet would add a discovery link whenever the <code>my-route</code> query var is used.</p>\n<pre><code class=\"language-php\">function my_plugin_rest_queried_resource_route( $route ) {\n    $id = get_query_var( 'my-route' );\n    if ( ! $route &amp;&amp; $id ) {\n        $route = '/my-ns/v1/items/' . $id;\n    }\n\n    return $route;\n}\nadd_filter( 'rest_queried_resource_route', 'my_plugin_rest_queried_resource_route' );\n</code></pre>\n<p>Note: If your endpoint is describing a custom post type or custom taxonomy you will most likely want to be using the <code>rest_route_for_post</code> or <code>rest_route_for_term</code> filters instead.</p>\n<h2>The Controller Pattern</h2>\n<p>The controller pattern is a best practice for working with complex endpoints with the API.</p>\n<p>It is recommended that you read <a href=\"https://developer.wordpress.org/rest-api/extending-the-rest-api/controller-classes/#extending-internal-classes\">&#8220;Extending Internal Classes&#8221;</a> before reading this section. Doing so will familiarize you with the patterns used by the default routes, which is the best practice. While it is not required that the class you use to process your request extends the <code>WP_REST_Controller</code> class or a class that extends it, doing so allows you to inherit work done in those classes. In addition, you can rest assured that you&#8217;re following best practices based on the controller methods you&#8217;re using.</p>\n<p>At their core, controllers are nothing more than a set of commonly named methods to match up with REST conventions, along with some handy helpers. Controllers register their routes in a <code>register_routes</code> method, respond to requests with <code>get_items</code>, <code>get_item</code>, <code>create_item</code>, <code>update_item</code> and <code>delete_item</code>, and have similarly named permission check methods. Following this pattern will ensure you don&#8217;t miss any steps or functionality in your endpoints.</p>\n<p>To use controllers, you first need to subclass the base controller. This gives you a base set of methods, ready for you to add your own behaviour into.</p>\n<p>Once we&#8217;ve subclassed the controller, we need to instantiate the class to get it working. This should be done inside of a callback hooked into <code>rest_api_init</code>, which ensures we only instantiate the class when we need to. The normal controller pattern is to call <code>$controller-&gt;register_routes()</code> inside this callback, where the class can then register its endpoints.</p>\n<h2>Examples</h2>\n<p>The following is a &#8220;starter&#8221; custom route:</p>\n<pre><code class=\"language-php\">&lt;?php\n\nclass Slug_Custom_Route extends WP_REST_Controller {\n\n  /**\n   * Register the routes for the objects of the controller.\n   */\n  public function register_routes() {\n    $version = '1';\n    $namespace = 'vendor/v' . $version;\n    $base = 'route';\n    register_rest_route( $namespace, '/' . $base, array(\n      array(\n        'methods'             =&gt; WP_REST_Server::READABLE,\n        'callback'            =&gt; array( $this, 'get_items' ),\n        'permission_callback' =&gt; array( $this, 'get_items_permissions_check' ),\n        'args'                =&gt; array(\n\n        ),\n      ),\n      array(\n        'methods'             =&gt; WP_REST_Server::CREATABLE,\n        'callback'            =&gt; array( $this, 'create_item' ),\n        'permission_callback' =&gt; array( $this, 'create_item_permissions_check' ),\n        'args'                =&gt; $this-&gt;get_endpoint_args_for_item_schema( true ),\n      ),\n    ) );\n    register_rest_route( $namespace, '/' . $base . '/(?P&lt;id&gt;[\\d]+)', array(\n      array(\n        'methods'             =&gt; WP_REST_Server::READABLE,\n        'callback'            =&gt; array( $this, 'get_item' ),\n        'permission_callback' =&gt; array( $this, 'get_item_permissions_check' ),\n        'args'                =&gt; array(\n          'context' =&gt; array(\n            'default' =&gt; 'view',\n          ),\n        ),\n      ),\n      array(\n        'methods'             =&gt; WP_REST_Server::EDITABLE,\n        'callback'            =&gt; array( $this, 'update_item' ),\n        'permission_callback' =&gt; array( $this, 'update_item_permissions_check' ),\n        'args'                =&gt; $this-&gt;get_endpoint_args_for_item_schema( false ),\n      ),\n      array(\n        'methods'             =&gt; WP_REST_Server::DELETABLE,\n        'callback'            =&gt; array( $this, 'delete_item' ),\n        'permission_callback' =&gt; array( $this, 'delete_item_permissions_check' ),\n        'args'                =&gt; array(\n          'force' =&gt; array(\n            'default' =&gt; false,\n          ),\n        ),\n      ),\n    ) );\n    register_rest_route( $namespace, '/' . $base . '/schema', array(\n      'methods'  =&gt; WP_REST_Server::READABLE,\n      'callback' =&gt; array( $this, 'get_public_item_schema' ),\n    ) );\n  }\n\n  /**\n   * Get a collection of items\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|WP_REST_Response\n   */\n  public function get_items( $request ) {\n    $items = array(); //do a query, call another class, etc\n    $data = array();\n    foreach( $items as $item ) {\n      $itemdata = $this-&gt;prepare_item_for_response( $item, $request );\n      $data[] = $this-&gt;prepare_response_for_collection( $itemdata );\n    }\n\n    return new WP_REST_Response( $data, 200 );\n  }\n\n  /**\n   * Get one item from the collection\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|WP_REST_Response\n   */\n  public function get_item( $request ) {\n    //get parameters from request\n    $params = $request-&gt;get_params();\n    $item = array();//do a query, call another class, etc\n    $data = $this-&gt;prepare_item_for_response( $item, $request );\n\n    //return a response or error based on some conditional\n    if ( 1 == 1 ) {\n      return new WP_REST_Response( $data, 200 );\n    } else {\n      return new WP_Error( 'code', __( 'message', 'text-domain' ) );\n    }\n  }\n\n  /**\n   * Create one item from the collection\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|WP_REST_Response\n   */\n  public function create_item( $request ) {\n    $item = $this-&gt;prepare_item_for_database( $request );\n\n    if ( function_exists( 'slug_some_function_to_create_item' ) ) {\n      $data = slug_some_function_to_create_item( $item );\n      if ( is_array( $data ) ) {\n        return new WP_REST_Response( $data, 200 );\n      }\n    }\n\n    return new WP_Error( 'cant-create', __( 'message', 'text-domain' ), array( 'status' =&gt; 500 ) );\n  }\n\n  /**\n   * Update one item from the collection\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|WP_REST_Response\n   */\n  public function update_item( $request ) {\n    $item = $this-&gt;prepare_item_for_database( $request );\n\n    if ( function_exists( 'slug_some_function_to_update_item' ) ) {\n      $data = slug_some_function_to_update_item( $item );\n      if ( is_array( $data ) ) {\n        return new WP_REST_Response( $data, 200 );\n      }\n    }\n\n    return new WP_Error( 'cant-update', __( 'message', 'text-domain' ), array( 'status' =&gt; 500 ) );\n  }\n\n  /**\n   * Delete one item from the collection\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|WP_REST_Response\n   */\n  public function delete_item( $request ) {\n    $item = $this-&gt;prepare_item_for_database( $request );\n\n    if ( function_exists( 'slug_some_function_to_delete_item' ) ) {\n      $deleted = slug_some_function_to_delete_item( $item );\n      if ( $deleted ) {\n        return new WP_REST_Response( true, 200 );\n      }\n    }\n\n    return new WP_Error( 'cant-delete', __( 'message', 'text-domain' ), array( 'status' =&gt; 500 ) );\n  }\n\n  /**\n   * Check if a given request has access to get items\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|bool\n   */\n  public function get_items_permissions_check( $request ) {\n    //return true; &lt;--use to make readable by all\n    return current_user_can( 'edit_something' );\n  }\n\n  /**\n   * Check if a given request has access to get a specific item\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|bool\n   */\n  public function get_item_permissions_check( $request ) {\n    return $this-&gt;get_items_permissions_check( $request );\n  }\n\n  /**\n   * Check if a given request has access to create items\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|bool\n   */\n  public function create_item_permissions_check( $request ) {\n    return current_user_can( 'edit_something' );\n  }\n\n  /**\n   * Check if a given request has access to update a specific item\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|bool\n   */\n  public function update_item_permissions_check( $request ) {\n    return $this-&gt;create_item_permissions_check( $request );\n  }\n\n  /**\n   * Check if a given request has access to delete a specific item\n   *\n   * @param WP_REST_Request $request Full data about the request.\n   * @return WP_Error|bool\n   */\n  public function delete_item_permissions_check( $request ) {\n    return $this-&gt;create_item_permissions_check( $request );\n  }\n\n  /**\n   * Prepare the item for create or update operation\n   *\n   * @param WP_REST_Request $request Request object\n   * @return WP_Error|object $prepared_item\n   */\n  protected function prepare_item_for_database( $request ) {\n    return array();\n  }\n\n  /**\n   * Prepare the item for the REST response\n   *\n   * @param mixed $item WordPress representation of the item.\n   * @param WP_REST_Request $request Request object.\n   * @return mixed\n   */\n  public function prepare_item_for_response( $item, $request ) {\n    return array();\n  }\n\n  /**\n   * Get the query params for collections\n   *\n   * @return array\n   */\n  public function get_collection_params() {\n    return array(\n      'page'     =&gt; array(\n        'description'       =&gt; 'Current page of the collection.',\n        'type'              =&gt; 'integer',\n        'default'           =&gt; 1,\n        'sanitize_callback' =&gt; 'absint',\n      ),\n      'per_page' =&gt; array(\n        'description'       =&gt; 'Maximum number of items to be returned in result set.',\n        'type'              =&gt; 'integer',\n        'default'           =&gt; 10,\n        'sanitize_callback' =&gt; 'absint',\n      ),\n      'search'   =&gt; array(\n        'description'       =&gt; 'Limit results to those matching a string.',\n        'type'              =&gt; 'string',\n        'sanitize_callback' =&gt; 'sanitize_text_field',\n      ),\n    );\n  }\n}\n</code></pre>\n",
        "protected": false
    },
    "author": 5896197,
    "featured_media": 0,
    "parent": 25312,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-25388",
        "rest-api-handbook",
        "type-rest-api-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/25388",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/rest-api-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/5896197"
            }
        ],
        "version-history": [
            {
                "count": 27,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/25388/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155242,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/25388/revisions/155242"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/25312"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=25388"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}