{
    "id": 22842,
    "date": "2016-11-08T19:25:40",
    "date_gmt": "2016-11-08T19:25:40",
    "guid": {
        "rendered": "https://developer.wordpress.org/?post_type=rest-api-handbook&#038;p=22842"
    },
    "modified": "2024-01-16T20:30:21",
    "modified_gmt": "2024-01-16T20:30:21",
    "slug": "routes-and-endpoints",
    "status": "publish",
    "type": "rest-api-handbook",
    "link": "https://developer.wordpress.org/rest-api/extending-the-rest-api/routes-and-endpoints/",
    "title": {
        "rendered": "Routes and Endpoints"
    },
    "content": {
        "rendered": "<h2>Overview</h2>\n\nThe REST API provides us a way to match URIs to various resources in our WordPress install. By default, if you have pretty permalinks enabled, the WordPress REST API &#8220;lives&#8221; at <code>/wp-json/</code>. At our WordPress site <code>https://ourawesomesite.com`, we can access the REST API's index by making a</code>GET<code>request to</code>https://ourawesomesite.com/wp-json/`. The index provides information regarding what routes are available for that particular WordPress install, along with what HTTP methods are supported and what endpoints are registered.\n\n<h2>Routes vs Endpoints</h2>\n\nEndpoints are functions available through the API. This can be things like retrieving the API index, updating a post, or deleting a comment. Endpoints perform a specific function, taking some number of parameters and return data to the client.\n\nA route is the &#8220;name&#8221; you use to access endpoints, used in the URL. A route can have multiple endpoints associated with it, and which is used depends on the HTTP verb.\n\nFor example, with the URL `http://example.com/wp-json/wp/v2/posts/123`:\n\n<ul>\n<li>The &#8220;route&#8221; is <code>wp/v2/posts/123</code> &#8211; The route doesn&#8217;t include <code>wp-json</code> because <code>wp-json</code> is the base path for the API itself.</li>\n<li>This route has 3 endpoints:\n\n<ul>\n<li><code>GET</code> triggers a <code>get_item</code> method, returning the post data to the client.</li>\n<li><code>PUT</code> triggers an <code>update_item</code> method, taking the data to update, and returning the updated post data.</li>\n<li><code>DELETE</code> triggers a <code>delete_item</code> method, returning the now-deleted post data to the client.</li>\n</ul></li>\n</ul>\n\n\n<div class=\"wp-block-wporg-notice is-alert-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\">\nOn sites without pretty permalinks, the route is instead added to the URL as the <code>rest_route</code> parameter. For the above example, the full URL would then be <code>http://example.com/?rest_route=/wp/v2/posts/123</code>\n</div></div>\n\n\n<h2>Creating Endpoints</h2>\n\nIf we wanted to create an endpoint that would return the phrase &#8220;Hello World, this is the WordPress REST API&#8221; when it receives a GET request, we would first need to register the route for that endpoint. To register routes you should use the <code>register_rest_route()</code> function. It needs to be called on the <code>rest_api_init</code> action hook. <code>register_rest_route()</code> handles all of the mapping for routes to endpoints. Let&#8217;s try to create a &#8220;Hello World, this is the WordPress REST API&#8221; route.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function that embeds our phrase in a WP_REST_Response\n */\nfunction prefix_get_endpoint_phrase() {\n    // rest_ensure_response() wraps the data we want to return into a WP_REST_Response, and ensures it will be properly returned.\n    return rest_ensure_response( 'Hello World, this is the WordPress REST API' );\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_example_routes() {\n    // register_rest_route() handles more arguments but we are going to stick to the basics for now.\n    register_rest_route( 'hello-world/v1', '/phrase', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_endpoint_phrase',\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_example_routes' );\n</code></pre>\n\nThe first argument passed into <code>register_rest_route()</code> is the namespace, which provides us a way to group our routes. The second argument passed in is the resource path, or resource base. For our example, the resource we are retrieving is the &#8220;Hello World, this is the WordPress REST API&#8221; phrase. The third argument is an array of options. We specify what methods the endpoint can use and what callback should happen when the endpoint is matched (more things can be done but these are the fundamentals).\n\nThe third argument also allows us to provide a permissions callback, which can restrict access for the endpoint to only certain users. The third argument also offers a way to register arguments for the endpoint so that requests can modify the response of our endpoint. We will get into those concepts in the endpoints section of this guide.\n\nWhen we go to `https://ourawesomesite.com/wp-json/hello-world/v1/phrase` we can now see our REST API greeting us kindly. Let&#8217;s take a look at routes a bit more in depth.\n\n<h2>Routes</h2>\n\nRoutes in the REST API are represented by URIs. The route itself is what is tacked onto the end of <code>https://ourawesomesite.com/wp-json`. The index route for the API is</code>/<code>which is why</code>https://ourawesomesite.com/wp-json/` returns all of the available information for the API. All routes should be built onto this route, the <code>wp-json</code> portion can be changed, but in general, it is advised to keep it the same.\n\nWe want to make sure that our routes are unique. For instance we could have a route for books like this: <code>/books</code>. Our books route would now live at <code>https://ourawesomesite.com/wp-json/books`. However, this is not a good practice as we would end up polluting potential routes for the API. What if another plugin we wanted to register a books route as well? We would be in big trouble in that case, as the two routes would conflict with each other and only one could be used. The fourth parameter to</code><a href=\"https://developer.wordpress.org/reference/functions/register_rest_route/\" rel=\"function\">register_rest_route()</a> ` is a boolean for whether the route should override an existing route.\n\nThe override parameter does not really solve our problem either, as both routes could override or we would want to use both routes for different things. This is where using namespaces for our routes comes in.\n\n<h3>Namespaces</h3>\n\nIt is extremely important to add namespaces to your routes. The &#8220;core&#8221; endpoints use the <code>wp/v2</code> namespace.\n\n\n<div class=\"wp-block-wporg-notice is-warning-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\"><strong>Do not place anything into the <code>wp</code> namespace unless you are making endpoints with the intention of merging them into core.</strong></div></div>\n\n\nThere are some key things to take notice of in the core endpoint namespace. The first part of the namespace is <code>wp</code>, which represents the vendor name; WordPress. For our plugins we will want to come up with unique names for what we call the vendor portion of the namespace. In the example above we used <code>hello-world</code>.\n\nFollowing the vendor portion is the version portion of the namespace. The &#8220;core&#8221; endpoints utilize <code>v2</code> to represent version 2 of the WordPress REST API. If you are writing a plugin, you can maintain backwards compatibility of your REST API endpoints by simply creating new endpoints and bumping up the version number you provide. This way both the original <code>v1</code> and <code>v2</code> endpoints can be accessed.\n\nThe part of the route that follows the namespace is the resource path.\n\n<h3>Resource Paths</h3>\n\nThe resource path should signify what resource the endpoint is associated with. In the example we used above, we used the word <code>phrase</code> to signify that the resource we are interacting with is a phrase. To avoid any collisions, each resource path we register should also be unique within a namespace. Resource paths should be used to define different resource routes within a given namespace.\n\nLet&#8217;s say we have a plugin that handles some basic eCommerce functionality. We will have two main resource types orders, and products. Orders are a request for product(s) but they are not the product themselves. The same concept applies to products. Although these resources are related they are not the same thing and each should live in a separate resource paths. Our routes will end up looking something like this for our eCommerce plugin: <code>/my-shop/v1/orders</code> and <code>/my-shop/v1/products</code>.\n\nUsing routes like this, we would want each to return a collection of orders or products. What if we wanted to grab a specific product by ID, we would need to use path variables in our routes.\n\n<h3>Path Variables</h3>\n\nPath variables enable us to add dynamic routes. To expand on our eCommerce routes, we could register a route to grab individual products.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function to return our products.\n *\n * @param WP_REST_Request $request This function accepts a rest request to process data.\n */\nfunction prefix_get_products( $request ) {\n    // In practice this function would fetch the desired data. Here we are just making stuff up.\n    $products = array(\n        '1' =&gt; 'I am product 1',\n        '2' =&gt; 'I am product 2',\n        '3' =&gt; 'I am product 3',\n    );\n\n    return rest_ensure_response( $products );\n}\n\n/**\n * This is our callback function to return a single product.\n *\n * @param WP_REST_Request $request This function accepts a rest request to process data.\n */\nfunction prefix_get_product( $request ) {\n    // In practice this function would fetch the desired data. Here we are just making stuff up.\n    $products = array(\n        '1' =&gt; 'I am product 1',\n        '2' =&gt; 'I am product 2',\n        '3' =&gt; 'I am product 3',\n    );\n\n    // Here we are grabbing the 'id' path variable from the $request object. WP_REST_Request implements ArrayAccess, which allows us to grab properties as though it is an array.\n    $id = (string) $request['id'];\n\n    if ( isset( $products[ $id ] ) ) {\n        // Grab the product.\n        $product = $products[ $id ];\n\n        // Return the product as a response.\n        return rest_ensure_response( $product );\n    } else {\n        // Return a WP_Error because the request product was not found. In this case we return a 404 because the main resource was not found.\n        return new WP_Error( 'rest_product_invalid', esc_html__( 'The product does not exist.', 'my-text-domain' ), array( 'status' =&gt; 404 ) );\n    }\n\n    // If the code somehow executes to here something bad happened return a 500.\n    return new WP_Error( 'rest_api_sad', esc_html__( 'Something went horribly wrong.', 'my-text-domain' ), array( 'status' =&gt; 500 ) );\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_product_routes() {\n    // Here we are registering our route for a collection of products.\n    register_rest_route( 'my-shop/v1', '/products', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_products',\n    ) );\n    // Here we are registering our route for single products. The (?P&lt;id&gt;[\\d]+) is our path variable for the ID, which, in this example, can only be some form of positive number.\n    register_rest_route( 'my-shop/v1', '/products/(?P&lt;id&gt;[\\d]+)', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_product',\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_product_routes' );\n</code></pre>\n\nThe above example covers a lot. The important part to note is that in the second route we register, we add on a path variable <code>/(?P&lt;id&gt;[\\d]+)</code> to our resource path <code>/products</code>. The path variable is a regular expression. In this case it uses <code>[\\d]+</code> to signify that should be any numerical character at least once. If you are using numeric IDs for your resources, then this is a great example of how to use a path variable. When using path variables, we now have to be careful around what can be matched as it is user input.\n\nThe regex luckily will filter out anything that is not numerical. However, what if the product for the requested ID doesn&#8217;t exist. We need to do error handling. You can see the basic way we are handling errors in the code example above. When you return a <code>WP_Error</code> in your endpoint callbacks the API server will automatically handle serving the error to the client.\n\nAlthough this section is about routes, we have covered quite a bit about endpoints. Endpoints and routes are interrelated, but they definitely have distinctions.\n\n<h2>Endpoints</h2>\n\nEndpoints are the destination that a route needs to map to. For any given route, you could have a number of different endpoints registered to it. We will expand on our fictitious eCommerce plugin, to better show the distinction between routes and endpoints. We are going to create two endpoints that exist at the <code>/wp-json/my-shop/v1/products/</code> route. One endpoint uses the HTTP verb <code>GET</code> to get products, and the other endpoint uses the HTTP verb <code>POST</code> to create a new product.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function to return our products.\n *\n * @param WP_REST_Request $request This function accepts a rest request to process data.\n */\nfunction prefix_get_products( $request ) {\n    // In practice this function would fetch the desired data. Here we are just making stuff up.\n    $products = array(\n        '1' =&gt; 'I am product 1',\n        '2' =&gt; 'I am product 2',\n        '3' =&gt; 'I am product 3',\n    );\n\n    return rest_ensure_response( $products );\n}\n\n/**\n * This is our callback function to return a single product.\n *\n * @param WP_REST_Request $request This function accepts a rest request to process data.\n */\nfunction prefix_create_product( $request ) {\n    // In practice this function would create a product. Here we are just making stuff up.\n   return rest_ensure_response( 'Product has been created' );\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_product_routes() {\n    // Here we are registering our route for a collection of products and creation of products.\n    register_rest_route( 'my-shop/v1', '/products', array(\n        array(\n            // By using this constant we ensure that when the WP_REST_Server changes, our readable endpoints will work as intended.\n            'methods'  =&gt; WP_REST_Server::READABLE,\n            // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n            'callback' =&gt; 'prefix_get_products',\n        ),\n        array(\n            // By using this constant we ensure that when the WP_REST_Server changes, our create endpoints will work as intended.\n            'methods'  =&gt; WP_REST_Server::CREATABLE,\n            // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n            'callback' =&gt; 'prefix_create_product',\n        ),\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_product_routes' );\n</code></pre>\n\nDepending on what HTTP Method we use for the route <code>/wp-json/my-shop/v1/products</code>, we are matched to a different endpoint and a different callback is fired. When we use <code>POST</code> we trigger the <code>prefix_create_product()</code> callback, and when we use <code>GET</code> we trigger the <code>prefix_get_products()</code> callback.\n\nThere are a number of different HTTP methods and the REST API can make use of any of them.\n\n<h3>HTTP Methods</h3>\n\nHTTP methods are sometimes referred to as HTTP verbs. They are simply just different ways to communicate via HTTP. The main ones used by the WordPress REST API are:\n\n<ul>\n<li><code>GET</code> should be used for retrieving data from the API.</li>\n<li><code>POST</code> should be used for creating new resources (i.e users, posts, taxonomies).</li>\n<li><code>PUT</code> should be used for updating resources.</li>\n<li><code>DELETE</code> should be used for deleting resources.</li>\n<li><code>OPTIONS</code> should be used to provide context about our resources.</li>\n</ul>\n\nIt is important to note that these methods are not supported by every client, as they were introduced in HTTP 1.1. Luckily, the API provides a workaround for these unfortunate cases. If you want to delete a resource but can&#8217;t send a <code>DELETE</code> request, then you can use the <code>_method</code> parameter or the <code>X-HTTP-Method-Override</code> header in your request. How this works is you will send a <code>POST</code> request to `https://ourawesomesite.com/wp-json/my-shop/v1/products/1?_method=DELETE`. Now you will have deleted product number 1, even though your client could not send the proper HTTP method in the request, or maybe there was a firewall in place that blocks out DELETE requests.\n\nThe HTTP method, in combination with the route and callbacks, are what make up the core of an endpoint.\n\n<h3>Callbacks</h3>\n\nThere are currently only two types of callbacks for endpoints supported by the REST API; <code>callback</code> and <code>permission_callback</code>. The main callback should handle the interaction with the resource. The permissions callback should handle what users have access to the endpoint. You can add additional callbacks by adding additional information when registering an endpoint. You can then hook into <code>rest_pre_dispatch</code>, <code>rest_dispatch_request</code>, or <code>rest_post_dispatch</code> hooks to fire your new custom callbacks.\n\n<h4>Endpoint Callback</h4>\n\nThe main callback for a delete endpoint should only delete the resource and return a copy of it in the response. The main callback for a creation endpoint should only create the resource and return a response matching the newly created data. An update callback should only modify resources that actually exist. A reading callback should only retrieve data that already exists. It is important to take into account the concept of idempotence.\n\nIdempotence, in the context of a REST API, means that if you make the same request to an endpoint the server will process the request the same way. Imagine if our read endpoint was not idempotent. Whenever we made a request to it the state of our server would be modified by the request, even though we were only trying to get data. This could be catastrophic. Any time someone fetched data from your server something would change internally. It is important to make sure that read, update, and delete endpoints do not have nasty side effects and just stick to what they are intended to do.\n\nIn a REST API, the concept of idempotence is tied to HTTP methods instead of endpoint callbacks. Any callback using <code>GET</code>, <code>HEAD</code>, <code>TRACE</code>, <code>OPTIONS</code>, <code>PUT</code>, or <code>DELETE</code>, should not produce any side effects. <code>POST</code> requests are not idempotent, and are typically used for creating resources. If you created an idempotent creation method then you would only ever create one resource because when you make the same request there would be no more side effects to the server. For creating, if you make the same request over and over the server should generate new resources each time.\n\nTo restrict usage of endpoints we need to register a permissions callback.\n\n<h4>Permissions Callback</h4>\n\nPermissions callbacks are extremely important for security with the WordPress REST API. If you have any private data that should not be displayed publicly, then you need to have permissions callbacks registered for your endpoints. Below is an example of how to register permissions callbacks.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function that embeds our resource in a WP_REST_Response\n */\nfunction prefix_get_private_data() {\n    // rest_ensure_response() wraps the data we want to return into a WP_REST_Response, and ensures it will be properly returned.\n    return rest_ensure_response( 'This is private data.' );\n}\n\n/**\n * This is our callback function that embeds our resource in a WP_REST_Response\n */\nfunction prefix_get_private_data_permissions_check() {\n    // Restrict endpoint to only users who have the edit_posts capability.\n    if ( ! current_user_can( 'edit_posts' ) ) {\n        return new WP_Error( 'rest_forbidden', esc_html__( 'OMG you can not view private data.', 'my-text-domain' ), array( 'status' =&gt; 401 ) );\n    }\n\n    // This is a black-listing approach. You could alternatively do this via white-listing, by returning false here and changing the permissions check.\n    return true;\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_example_routes() {\n    // register_rest_route() handles more arguments but we are going to stick to the basics for now.\n    register_rest_route( 'my-plugin/v1', '/private-data', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_private_data',\n        // Here we register our permissions callback. The callback is fired before the main callback to check if the current user can access the endpoint.\n        'permission_callback' =&gt; 'prefix_get_private_data_permissions_check',\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_example_routes' );\n</code></pre>\n\nIf you try out this endpoint without any Authentication enabled then you will also be returned the error response, preventing you from seeing the data. Authentication is a huge topic and eventually a portion of this chapter will be created to show you how to create your own authentication processes.\n\n<h3>Arguments</h3>\n\nWhen making requests to an endpoint you might need to specify extra parameters to change the response. These extra parameters can be added while registering endpoints. Let&#8217;s look at an example of how to use arguments with an endpoint.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function that embeds our resource in a WP_REST_Response\n */\nfunction prefix_get_colors( $request ) {\n    // In practice this function would fetch the desired data. Here we are just making stuff up.\n    $colors = array(\n        'blue',\n        'blue',\n        'red',\n        'red',\n        'green',\n        'green',\n    );\n\n    if ( isset( $request['filter'] ) ) {\n       $filtered_colors = array();\n       foreach ( $colors as $color ) {\n           if ( $request['filter'] === $color ) {\n               $filtered_colors[] = $color;\n           }\n       }\n       return rest_ensure_response( $filtered_colors );\n    }\n    return rest_ensure_response( $colors );\n}\n\n/**\n * We can use this function to contain our arguments for the example product endpoint.\n */\nfunction prefix_get_color_arguments() {\n    $args = array();\n    // Here we are registering the schema for the filter argument.\n    $args['filter'] = array(\n        // description should be a human readable description of the argument.\n        'description' =&gt; esc_html__( 'The filter parameter is used to filter the collection of colors', 'my-text-domain' ),\n        // type specifies the type of data that the argument should be.\n        'type'        =&gt; 'string',\n        // enum specified what values filter can take on.\n        'enum'        =&gt; array( 'red', 'green', 'blue' ),\n    );\n    return $args;\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_example_routes() {\n    // register_rest_route() handles more arguments but we are going to stick to the basics for now.\n    register_rest_route( 'my-colors/v1', '/colors', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_colors',\n        // Here we register our permissions callback. The callback is fired before the main callback to check if the current user can access the endpoint.\n        'args' =&gt; prefix_get_color_arguments(),\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_example_routes' );\n</code></pre>\n\nWe have now specified a <code>filter</code> argument for this example. We can specify the argument as a query parameter when we request the endpoint. If we make a <code>GET</code> request to `https://ourawesomesitem.com/my-colors/v1/colors?filter=blue`, we will be returned only the blue colors in our collection. You could also pass these as body parameters in the request body, instead of in the query string. To understand the distinction between query parameters and body parameters you should read about the HTTP spec. Query parameters live in the query string tacked onto the URL and body parameters are directly embedded in the body of an HTTP request.\n\nWe have created an argument for our endpoint, but how do we verify that the argument is a string and tell whether it matches the value red, green, or blue. To do this we need to specify a validation callback for our argument.\n\n<h4>Validation</h4>\n\nValidation and sanitization are extremely important for security in the API. The validate callback (in WP 4.6+), fires before the sanitize callback. You should use the <code>validate_callback</code> for your arguments to verify whether the input you are receiving is valid. The <code>sanitize_callback</code> should be used to transform the argument input or clean out unwanted parts out of the argument, before the argument is processed by the main callback.\n\nIn the example above, we need to verify that the <code>filter</code> parameter is a string, and it matches the value red, green, or blue. Let&#8217;s look at what the code looks like after adding in a <code>validate_callback</code>.\n\n<pre><code class=\"language-php\">/**\n * This is our callback function that embeds our resource in a WP_REST_Response\n */\nfunction prefix_get_colors( $request ) {\n    // In practice this function would fetch more practical data. Here we are just making stuff up.\n    $colors = array(\n        'blue',\n        'blue',\n        'red',\n        'red',\n        'green',\n        'green',\n    );\n\n    if ( isset( $request['filter'] ) ) {\n       $filtered_colors = array();\n       foreach ( $colors as $color ) {\n           if ( $request['filter'] === $color ) {\n               $filtered_colors[] = $color;\n           }\n       }\n       return rest_ensure_response( $filtered_colors );\n    }\n    return rest_ensure_response( $colors );\n}\n/**\n * Validate a request argument based on details registered to the route.\n *\n * @param  mixed            $value   Value of the 'filter' argument.\n * @param  WP_REST_Request  $request The current request object.\n * @param  string           $param   Key of the parameter. In this case it is 'filter'.\n * @return WP_Error|boolean\n */\nfunction prefix_filter_arg_validate_callback( $value, $request, $param ) {\n    // If the 'filter' argument is not a string return an error.\n    if ( ! is_string( $value ) ) {\n        return new WP_Error( 'rest_invalid_param', esc_html__( 'The filter argument must be a string.', 'my-text-domain' ), array( 'status' =&gt; 400 ) );\n    }\n\n    // Get the registered attributes for this endpoint request.\n    $attributes = $request-&gt;get_attributes();\n\n    // Grab the filter param schema.\n    $args = $attributes['args'][ $param ];\n\n    // If the filter param is not a value in our enum then we should return an error as well.\n    if ( ! in_array( $value, $args['enum'], true ) ) {\n        return new WP_Error( 'rest_invalid_param', sprintf( __( '%s is not one of %s' ), $param, implode( ', ', $args['enum'] ) ), array( 'status' =&gt; 400 ) );\n    }\n}\n\n/**\n * We can use this function to contain our arguments for the example product endpoint.\n */\nfunction prefix_get_color_arguments() {\n    $args = array();\n    // Here we are registering the schema for the filter argument.\n    $args['filter'] = array(\n        // description should be a human readable description of the argument.\n        'description' =&gt; esc_html__( 'The filter parameter is used to filter the collection of colors', 'my-text-domain' ),\n        // type specifies the type of data that the argument should be.\n        'type'        =&gt; 'string',\n        // enum specified what values filter can take on.\n        'enum'        =&gt; array( 'red', 'green', 'blue' ),\n        // Here we register the validation callback for the filter argument.\n        'validate_callback' =&gt; 'prefix_filter_arg_validate_callback',\n    );\n    return $args;\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_example_routes() {\n    // register_rest_route() handles more arguments but we are going to stick to the basics for now.\n    register_rest_route( 'my-colors/v1', '/colors', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_colors',\n        // Here we register our permissions callback. The callback is fired before the main callback to check if the current user can access the endpoint.\n        'args' =&gt; prefix_get_color_arguments(),\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_example_routes' );\n</code></pre>\n\n<h4>Sanitizing</h4>\n\nIn the above example, we do not need to use a <code>sanitize_callback</code>, because we are restricting input to only values in our enum. If we did not have strict validation and accepted any string as a parameter, we would definitely need to register a <code>sanitize_callback</code>. What if we wanted to update a content field and the user entered something like <code>alert('ZOMG Hacking you');</code>. The field value could potentially be an executable script. To strip out unwanted data or to transform data into a desired format we need to register a <code>sanitize_callback</code> for our arguments. Here is an example of how to use WordPress&#8217;s <code>sanitize_text_field()</code> for a sanitize callback:\n\n<pre><code class=\"language-php\">/**\n * This is our callback function that embeds our resource in a WP_REST_Response.\n *\n * The parameter is already sanitized by this point so we can use it without any worries.\n */\nfunction prefix_get_item( $request ) {\n    if ( isset( $request['data'] ) ) {\n        return rest_ensure_response( $request['data'] );\n    }\n\n    return new WP_Error( 'rest_invalid', esc_html__( 'The data parameter is required.', 'my-text-domain' ), array( 'status' =&gt; 400 ) );\n}\n\n/**\n * Validate a request argument based on details registered to the route.\n *\n * @param  mixed            $value   Value of the 'filter' argument.\n * @param  WP_REST_Request  $request The current request object.\n * @param  string           $param   Key of the parameter. In this case it is 'filter'.\n * @return WP_Error|boolean\n */\nfunction prefix_data_arg_validate_callback( $value, $request, $param ) {\n    // If the 'data' argument is not a string return an error.\n    if ( ! is_string( $value ) ) {\n        return new WP_Error( 'rest_invalid_param', esc_html__( 'The filter argument must be a string.', 'my-text-domain' ), array( 'status' =&gt; 400 ) );\n    }\n}\n\n/**\n * Sanitize a request argument based on details registered to the route.\n *\n * @param  mixed            $value   Value of the 'filter' argument.\n * @param  WP_REST_Request  $request The current request object.\n * @param  string           $param   Key of the parameter. In this case it is 'filter'.\n * @return WP_Error|boolean\n */\nfunction prefix_data_arg_sanitize_callback( $value, $request, $param ) {\n    // It is as simple as returning the sanitized value.\n    return sanitize_text_field( $value );\n}\n\n/**\n * We can use this function to contain our arguments for the example product endpoint.\n */\nfunction prefix_get_data_arguments() {\n    $args = array();\n    // Here we are registering the schema for the filter argument.\n    $args['data'] = array(\n        // description should be a human readable description of the argument.\n        'description' =&gt; esc_html__( 'The data parameter is used to be sanitized and returned in the response.', 'my-text-domain' ),\n        // type specifies the type of data that the argument should be.\n        'type'        =&gt; 'string',\n        // Set the argument to be required for the endpoint.\n        'required'    =&gt; true,\n        // We are registering a basic validation callback for the data argument.\n        'validate_callback' =&gt; 'prefix_data_arg_validate_callback',\n        // Here we register the validation callback for the filter argument.\n        'sanitize_callback' =&gt; 'prefix_data_arg_sanitize_callback',\n    );\n    return $args;\n}\n\n/**\n * This function is where we register our routes for our example endpoint.\n */\nfunction prefix_register_example_routes() {\n    // register_rest_route() handles more arguments but we are going to stick to the basics for now.\n    register_rest_route( 'my-plugin/v1', '/sanitized-data', array(\n        // By using this constant we ensure that when the WP_REST_Server changes our readable endpoints will work as intended.\n        'methods'  =&gt; WP_REST_Server::READABLE,\n        // Here we register our callback. The callback is fired when this endpoint is matched by the WP_REST_Server class.\n        'callback' =&gt; 'prefix_get_item',\n        // Here we register our permissions callback. The callback is fired before the main callback to check if the current user can access the endpoint.\n        'args' =&gt; prefix_get_data_arguments(),\n    ) );\n}\n\nadd_action( 'rest_api_init', 'prefix_register_example_routes' );\n</code></pre>\n\n<h2>Summary</h2>\n\nWe have covered the basics of registering endpoints for the WordPress REST API. Routes are the URIs that our endpoints live at. Endpoints are a collection of callbacks, methods, args, and other options. Each endpoint is mapped to a route when using <code>register_rest_route()</code>. An endpoint by default can support various HTTP methods, a main callback, a permissions callback, and registered arguments. We can register endpoints to cover any of our use cases for interacting with WordPress. The endpoints serve as the core interaction point with the REST API, but there are many other topics to explore and understand, to fully utilize this powerful API.\n",
        "protected": false
    },
    "author": 5851951,
    "featured_media": 0,
    "parent": 25312,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-22842",
        "rest-api-handbook",
        "type-rest-api-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/22842",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/rest-api-handbook"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/users/5851951"
            }
        ],
        "version-history": [
            {
                "count": 17,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/22842/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 152017,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/22842/revisions/152017"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/25312"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=22842"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}