{
    "id": 126821,
    "date": "2020-01-04T19:43:30",
    "date_gmt": "2020-01-04T19:43:30",
    "guid": {
        "rendered": "https://developer.wordpress.org/rest-api/key-concepts/"
    },
    "modified": "2024-03-27T18:25:30",
    "modified_gmt": "2024-03-27T18:25:30",
    "slug": "key-concepts",
    "status": "publish",
    "type": "rest-api-handbook",
    "link": "https://developer.wordpress.org/rest-api/key-concepts/",
    "title": {
        "rendered": "Key Concepts"
    },
    "content": {
        "rendered": "<p>In this page we&#8217;ll break down some of the key concepts and terms associated with the REST API: <strong>Routes &amp; Endpoints,</strong> <strong>Requests</strong>, <strong>Responses</strong>, <strong>Schema</strong>, and <strong>Controller Classes</strong>. Each of these concepts play a crucial role in understanding, using, and extending the WordPress REST API, and each is explored in greater depth within this handbook.</p>\n<h2>Routes &amp; Endpoints</h2>\n<p>In the context of the WordPress REST API a <strong>route</strong> is a URI which can be mapped to different HTTP methods. The mapping of an individual HTTP method to a route is known as an <strong>endpoint</strong>.</p>\n<p>As an example, if we make a <code>GET</code> request to the URI <code>http://oursite.com/wp-json/</code> we are returned a JSON response showing what routes are available, and what endpoints are available within each route.</p>\n<p><code>/wp-json/</code> is a route, and when that route receives a <code>GET</code> request then that request is handled by the endpoint which displays what is known as the index for the WordPress REST API.</p>\n<p>The route <code>wp-json/wp/v2/posts</code> by contrast has a <code>GET</code> endpoint which returns a list of posts, but also a <code>POST</code> endpoint which accepts authenticated requests to create new posts.</p>\n<p>We will learn how to register our own routes and endpoints in the following sections.</p>\n<p>\n<div class=\"wp-block-wporg-notice is-info-notice\">\n<div class=\"wp-block-wporg-notice__icon\"></div>\n<div class=\"wp-block-wporg-notice__content\"><p>If you are using <a href=\"https://wordpress.org/support/article/using-permalinks/\">non-pretty permalinks</a>, you should pass the REST API route as a query string parameter. The route <code>http://oursite.com/wp-json/</code> in the example above would hence be <code>http://oursite.com/?rest_route=/</code>.</p>\n</div></div>\n</p>\n<p>If you get a <code>404</code> error when trying to access <code>http://oursite.com/wp-json/</code>, consider enabling pretty permalinks or try using the <code>rest_route</code> parameter instead.</p>\n<h2>Requests</h2>\n<p>A REST API request is represented within WordPress by an instance of the <code>WP_REST_Request</code> class, which is used to store and retrieve information for the current request. A <code>WP_REST_Request</code> object is automatically generated when you make an HTTP request to a registered API route.</p>\n<p>The data specified in this object (derived from the route URI or the JSON payload sent as a part of the request) determines what response you will get back out of the API.</p>\n<p>Requests are usually submitted remotely via HTTP but may also be made internally from PHP within WordPress plugin or theme code. There are a lot of neat things you can do using this class, detailed further elsewhere in the handbook.</p>\n<h2>Responses</h2>\n<p>Responses are the data you get back from the API. The <code>WP_REST_Response</code> class provides a way to interact with the response data returned by endpoints. Responses return the requested data, or can also be used to return errors if something goes wrong while fulfilling the request.</p>\n<h2>Schema</h2>\n<p>Each endpoint requires a particular structure of input data, and returns data using a defined and predictable structure. Those data structures are defined in the API Schema.</p>\n<p>The schema structures API data and provides a comprehensive list of all of the properties the API can return and which input parameters it can accept.</p>\n<p>Well-defined schema also provides one layer of security within the API, as it enables us to validate and sanitize the requests being made to the API. The <a href=\"https://developer.wordpress.org/rest-api/extending-the-rest-api/schema/\">Schema section</a> explores this large topic further.</p>\n<h2>Controller Classes</h2>\n<p>Controller classes unify and coordinate all these various moving parts within a REST API response cycle. With a controller class you can manage the registration of routes &amp; endpoints, handle requests, utilize schema, and generate API responses.</p>\n<p>A single class usually contains all of the logic for a given route, and a given route usually represents a specific type of data object within your WordPress site (like a custom post type or taxonomy).</p>\n",
        "protected": false
    },
    "author": 20138378,
    "featured_media": 0,
    "parent": 0,
    "menu_order": 2,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-126821",
        "rest-api-handbook",
        "type-rest-api-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/126821",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/rest-api-handbook"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/126821/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 152900,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/rest-api-handbook/126821/revisions/152900"
            }
        ],
        "author": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wporg/v1/users/renyot"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=126821"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}