{
    "id": 41430,
    "date": "2019-04-25T20:55:50",
    "date_gmt": "2019-04-25T20:55:50",
    "guid": {
        "rendered": "https://developer.wordpress.org/coding-standards/wordpress-coding-standards/javascript/"
    },
    "modified": "2024-11-16T15:09:33",
    "modified_gmt": "2024-11-16T15:09:33",
    "slug": "javascript",
    "status": "publish",
    "type": "wpcs-handbook",
    "link": "https://developer.wordpress.org/coding-standards/wordpress-coding-standards/javascript/",
    "title": {
        "rendered": "JavaScript Coding Standards"
    },
    "content": {
        "rendered": "JavaScript has become a critical component in developing WordPress-based applications (themes and plugins) as well as WordPress core. Standards are needed for formatting and styling JavaScript code to maintain the same code consistency as the WordPress standards provide for core PHP, HTML, and CSS code.\n\n<blockquote>\n  All code in any code-base should look like a single person typed it, no matter how many people contributed. &#8211; <a href=\"https://github.com/rwaldron/idiomatic.js/\">Principles of Writing Consistent, Idiomatic JavaScript</a>\n</blockquote>\n\nThe WordPress JavaScript Coding Standards are adapted from the <a href=\"https://contribute.jquery.org/style-guide/js\">jQuery JavaScript Style Guide</a>. Our standard differs from the jQuery guidelines in the following ways:\n\n<ul>\n<li>WordPress uses single quotation marks for string declarations.</li>\n<li>Case statements are indented within switch blocks.</li>\n<li>Function contents are consistently indented, including full-file closure wrappers.</li>\n<li>Some whitespace rules differ, for consistency with the WordPress PHP coding standards.</li>\n<li>jQuery’s 100-character hard line limit is encouraged, but not strictly enforced.</li>\n</ul>\n\nMany of the examples below have been adapted directly from the jQuery style guide; these differences have all been integrated into the examples on this page. Any of the below standards and examples should be considered best practice for WordPress code, unless explicitly noted as anti-patterns.\n\n<h2>Code Refactoring</h2>\n\n<blockquote>\n  &#8220;<a href=\"https://make.wordpress.org/core/2011/03/23/code-refactoring/\">Code refactoring should not be done just because we can.</a>&#8221; &#8211; Lead Developer Andrew Nacin\n</blockquote>\n\nMany parts of the WordPress code structure for JavaScript are inconsistent in their style. WordPress is working to gradually improve this, so the code will be clean and easy to read at a glance.\n\nWhile the coding standards are important, refactoring older .js files simply to conform to the standards is not an urgent issue. &#8220;Whitespace-only&#8221; patches for older files are strongly discouraged.\n\nAll new or updated JavaScript code will be reviewed to ensure it conforms to the standards, and passes JSHint.\n\n<h2>Spacing</h2>\n\nUse spaces liberally throughout your code. &#8220;When in doubt, space it out.&#8221;\n\nThese rules encourage liberal spacing for improved developer readability. The minification process creates a file that is optimized for browsers to read and process.\n\n<ul>\n<li>Indentation with tabs.</li>\n<li>No whitespace at the end of line or on blank lines.</li>\n<li>Lines should usually be no longer than 80 characters, and should not exceed 100 (counting tabs as 4 spaces). <em>This is a &#8220;soft&#8221; rule, but long lines generally indicate unreadable or disorganized code.</em></li>\n<li><code>if</code>/<code>else</code>/<code>for</code>/<code>while</code>/<code>try</code> blocks should always use braces, and always go on multiple lines.</li>\n<li>Unary special-character operators (e.g., <code>++</code>, <code>--</code>) must not have space next to their operand.</li>\n<li>Any <code>,</code> and <code>;</code> must not have preceding space.</li>\n<li>Any <code>;</code> used as a statement terminator must be at the end of the line.</li>\n<li>Any <code>:</code> after a property name in an object definition must not have preceding space.</li>\n<li>The <code>?</code> and <code>:</code> in a ternary conditional must have space on both sides.</li>\n<li>No filler spaces in empty constructs (e.g., <code>{}</code>, <code>[]</code>, <code>fn()</code>).</li>\n<li>There should be a new line at the end of each file.</li>\n<li>Any <code>!</code> negation operator should have a following space.<sup>*</sup></li>\n<li>All function bodies are indented by one tab, even if the entire file is wrapped in a closure.<sup>*</sup></li>\n<li>Spaces may align code within documentation blocks or within a line, but only tabs should be used at the start of a line.<sup>*</sup></li>\n</ul>\n\n<a name=\"spacing-whitespace\">*</a>: The WordPress JavaScript standards prefer slightly broader whitespace rules than the jQuery style guide. These deviations are for consistency between the PHP and JavaScript files in the WordPress codebase.\n\nWhitespace can easily accumulate at the end of a line – avoid this, as trailing whitespace is caught as an error in JSHint. One way to catch whitespace buildup is enabling visible whitespace characters within your text editor.\n\n<h3>Object Declarations</h3>\n\nObject declarations can be made on a single line if they are short (remember the line length guidelines). When an object declaration is too long to fit on one line, there must be one property per line and each line ended by a comma. Property names only need to be quoted if they are reserved words or contain special characters:\n\nArrays can be declared on a single line if they are short (remember the line length guidelines). When an array is too long to fit on one line, each member must be placed on its own line and each line ended by a comma.\n\n<pre><code class=\"language-javascript\">// Preferred\nvar obj = {\n    ready: 9,\n    when: 4,\n    'you are': 15,\n};\nvar arr = [\n    9,\n    4,\n    15,\n];\n\n// Acceptable for small objects and arrays\nvar obj = { ready: 9, when: 4, 'you are': 15 };\nvar arr = [ 9, 4, 15 ];\n\n// Bad\nvar obj = { ready: 9,\n    when: 4, 'you are': 15 };\nvar arr = [ 9,\n    4, 15 ];\n</code></pre>\n\n<h3>Arrays and Function Calls</h3>\n\nAlways include extra spaces around elements and arguments:\n\n<pre><code class=\"language-javascript\">array = [ a, b ];\n\nfoo( arg );\n\nfoo( 'string', object );\n\nfoo( options, object[ property ] );\n\nfoo( node, 'property', 2 );\n\nprop = object[ 'default' ];\n\nfirstArrayElement = arr[ 0 ];\n</code></pre>\n\n<h3>Examples of Good Spacing</h3>\n\n<pre><code class=\"language-javascript\">var i;\n\nif ( condition ) {\n    doSomething( 'with a string' );\n} else if ( otherCondition ) {\n    otherThing( {\n        key: value,\n        otherKey: otherValue\n    } );\n} else {\n    somethingElse( true );\n}\n\n// Unlike jQuery, WordPress prefers a space after the ! negation operator.\n// This is also done to conform to our PHP standards.\nwhile ( ! condition ) {\n    iterating++;\n}\n\nfor ( i = 0; i &lt; 100; i++ ) {\n    object[ array[ i ] ] = someFn( i );\n    $( '.container' ).val( array[ i ] );\n}\n\ntry {\n    // Expressions\n} catch ( e ) {\n    // Expressions\n}\n</code></pre>\n\n<h2>Semicolons</h2>\n\nUse them. Never rely on Automatic Semicolon Insertion (ASI).\n\n<h2>Indentation and Line Breaks</h2>\n\nIndentation and line breaks add readability to complex statements.\n\nTabs should be used for indentation. Even if the entire file is contained in a closure (i.e., an immediately invoked function), the contents of that function should be indented by one tab:\n\n<pre><code class=\"language-javascript\">( function ( $ ) {\n    // Expressions indented\n\n    function doSomething() {\n        // Expressions indented\n    }\n} )( jQuery );\n</code></pre>\n\n<h3>Blocks and Curly Braces</h3>\n\n<code>if</code>, <code>else</code>, <code>for</code>, <code>while</code>, and <code>try</code> blocks should always use braces, and always go on multiple lines. The opening brace should be on the same line as the function definition, the conditional, or the loop. The closing brace should be on the line directly following the last statement of the block.\n\n<pre><code class=\"language-javascript\">var a, b, c;\n\nif ( myFunction() ) {\n    // Expressions\n} else if ( ( a &amp;&amp; b ) || c ) {\n    // Expressions\n} else {\n    // Expressions\n}\n</code></pre>\n\n<h3>Multi-line Statements</h3>\n\nWhen a statement is too long to fit on one line, line breaks must occur after an operator.\n\n<pre><code class=\"language-javascript\">// Bad\nvar html = '&lt;p&gt;The sum of ' + a + ' and ' + b + ' plus ' + c\n    + ' is ' + ( a + b + c ) + '&lt;/p&gt;';\n\n// Good\nvar html = '&lt;p&gt;The sum of ' + a + ' and ' + b + ' plus ' + c +\n    ' is ' + ( a + b + c ) + '&lt;/p&gt;';\n</code></pre>\n\nLines should be broken into logical groups if it improves readability, such as splitting each expression of a ternary operator onto its own line, even if both will fit on a single line.\n\n<pre><code class=\"language-javascript\">// Acceptable\nvar baz = ( true === conditionalStatement() ) ? 'thing 1' : 'thing 2';\n\n// Better\nvar baz = firstCondition( foo ) &amp;&amp; secondCondition( bar ) ?\n    qux( foo, bar ) :\n    foo;\n</code></pre>\n\nWhen a conditional is too long to fit on one line, each operand of a logical operator in the boolean expression must appear on its own line, indented one extra level from the opening and closing parentheses.\n\n<pre><code class=\"language-javascript\">if (\n    firstCondition() &amp;&amp;\n    secondCondition() &amp;&amp;\n    thirdCondition()\n) {\n    doStuff();\n}\n</code></pre>\n\n<h3>Chained Method Calls</h3>\n\nWhen a chain of method calls is too long to fit on one line, there must be one call per line, with the first call on a separate line from the object the methods are called on. If the method changes the context, an extra level of indentation must be used.\n\n<pre><code class=\"language-javascript\">elements\n    .addClass( 'foo' )\n    .children()\n        .html( 'hello' )\n    .end()\n    .appendTo( 'body' );\n</code></pre>\n\n<h2>Assignments and Globals</h2>\n\n<h3>Declaring Variables with <code>const</code> and <code>let</code></h3>\n\nFor code written using ES2015 or newer, <code>const</code> and <code>let</code> should always be used in place of <code>var</code>. A declaration should use <code>const</code> unless its value will be reassigned, in which case <code>let</code> is appropriate.\n\nUnlike <code>var</code>, it is not necessary to declare all variables at the top of a function. Instead, they are to be declared at the point at which they are first used.\n\n<h3>Declaring Variables With <code>var</code></h3>\n\nEach function should begin with a single comma-delimited <code>var</code> statement that declares any local variables necessary. If a function does not declare a variable using <code>var</code>, that variable can leak into an outer scope (which is frequently the global scope, a worst-case scenario), and can unwittingly refer to and modify that data.\n\nAssignments within the <code>var</code> statement should be listed on individual lines, while declarations can be grouped on a single line. Any additional lines should be indented with an additional tab. Objects and functions that occupy more than a handful of lines should be assigned outside of the <code>var</code> statement, to avoid over-indentation.\n\n<pre><code class=\"language-javascript\">// Good\nvar k, m, length,\n    // Indent subsequent lines by one tab\n    value = 'WordPress';\n\n// Bad\nvar foo = true;\nvar bar = false;\nvar a;\nvar b;\nvar c;\n</code></pre>\n\n<h3>Globals</h3>\n\nIn the past, WordPress core made heavier use of global variables. Since core JavaScript files are sometimes used within plugins, existing globals should not be removed.\n\nAll globals used within a file should be documented at the top of that file. Multiple globals can be comma-separated.\n\nThis example would make <code>passwordStrength</code> an allowed global variable within that file:\n\n<pre><code class=\"language-javascript\">/* global passwordStrength:true */\n</code></pre>\n\nThe &#8220;true&#8221; after <code>passwordStrength</code> means that this global is being defined within this file. If you are accessing a global which is defined elsewhere, omit <code>:true</code> to designate the global as read-only.\n\n<h3>Common Libraries</h3>\n\nBackbone, jQuery, Underscore, and the global <code>wp</code> object are all registered as allowed globals in the root <code>.jshintrc</code> file.\n\nBackbone and Underscore may be accessed directly at any time. jQuery should be accessed through <code>$</code> by passing the <code>jQuery</code> object into an anonymous function:\n\n<pre><code class=\"language-javascript\">( function ( $ ) {\n    // Expressions\n} )( jQuery );\n</code></pre>\n\nThis will negate the need to call <code>.noConflict()</code>, or to set <code>$</code> using another variable.\n\nFiles which add to, or modify, the <code>wp</code> object must safely access the global to avoid overwriting previously set properties:\n\n<pre><code class=\"language-javascript\">// At the top of the file, set \"wp\" to its existing value (if present)\nwindow.wp = window.wp || {};\n</code></pre>\n\n<h2>Naming Conventions</h2>\n\nVariable and function names should be full words, using camel case with a lowercase first letter. This is an area where this standard differs from the <a href=\"https://developer.wordpress.org/coding-standards/wordpress-coding-standards/php/#naming-conventions\">WordPress PHP coding standards</a>.\n\nNames should be descriptive, but not excessively so. Exceptions are allowed for iterators, such as the use of <code>i</code> to represent the index in a loop.\n\n<h3>Abbreviations and Acronyms</h3>\n\n<a href=\"https://en.wikipedia.org/wiki/Acronym\">Acronyms</a> must be written with each of its composing letters capitalized. This is intended to reflect that each letter of the acronym is a proper word in its expanded form.\n\nAll other <a href=\"https://en.wikipedia.org/wiki/Abbreviation\">abbreviations</a> must be written as camel case, with an initial capitalized letter followed by lowercase letters.\n\nIf an abbreviation or an acronym occurs at the start of a variable name, it must be written to respect the camelcase naming rules covering the first letter of a variable or class definition. For variable assignment, this means writing the abbreviation entirely as lowercase. For class definitions, its initial letter should be capitalized.\n\n<pre><code class=\"language-javascript\">// \"Id\" is an abbreviation of \"Identifier\":\nconst userId = 1;\n\n// \"DOM\" is an acronym of \"Document Object Model\":\nconst currentDOMDocument = window.document;\n\n// Acronyms and abbreviations at the start of a variable name are consistent\n// with camelcase rules covering the first letter of a variable or class.\nconst domDocument = window.document;\nclass DOMDocument {}\nclass IdCollection {}\n</code></pre>\n\n<h3>Class Definitions</h3>\n\nConstructors intended for use with <code>new</code> should have a capital first letter (UpperCamelCase).\n\nA <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes\"><code>class</code> definition</a> must use the UpperCamelCase convention, regardless of whether it is intended to be used with <code>new</code> construction.\n\n<pre><code class=\"language-javascript\">class Earth {\n    static addHuman( human ) {\n        Earth.humans.push( human );\n    }\n\n    static getHumans() {\n        return Earth.humans;\n    }\n}\n\nEarth.humans = [];\n</code></pre>\n\nAll <a href=\"https://www.npmjs.com/package/@wordpress/element\"><code>@wordpress/element</code></a> Components, including stateless function components, should be named using Class Definition naming rules, both for consistency and to reflect the fact that a component may need to be transitioned from a function to a class without breaking compatibility.\n\n<h3>Constants</h3>\n\nAn exception to camel case is made for constant values which are never intended to be reassigned or mutated. Such variables must use the <a href=\"https://en.wikipedia.org/wiki/Snake_case#History\">SCREAMING_SNAKE_CASE convention</a>.\n\nIn almost all cases, a constant should be defined in the top-most scope of a file. It is important to note that <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/const\">JavaScript’s <code>const</code> assignment</a> is conceptually more limited than what is implied here, where a value assigned by <code>const</code> in JavaScript can in-fact be mutated, and is only protected against reassignment. A constant as defined in these coding guidelines applies only to values which are expected to never change, and is a strategy for developers to communicate intent moreso than it is a technical restriction.\n\n<h2>Comments</h2>\n\nComments come before the code to which they refer, and should always be preceded by a blank line. Capitalize the first letter of the comment, and include a period at the end when writing full sentences. There must be a single space between the comment token (<code>//</code>) and the comment text.\n\n<pre><code class=\"language-javascript\">someStatement();\n\n// Explanation of something complex on the next line\n$( 'p' ).doSomething();\n\n// This is a comment that is long enough to warrant being stretched\n// over the span of multiple lines.\n</code></pre>\n\nJSDoc comments should use the <code>/**</code> multi-line comment opening. Refer to the <a href=\"https://make.wordpress.org/core/handbook/best-practices/inline-documentation-standards/javascript/#multi-line-comments\">JavaScript Documentation Standards</a> for more information.\n\nInline comments are allowed as an exception when used to annotate special arguments in formal parameter lists:\n\n<pre><code class=\"language-javascript\">function foo( types, selector, data, fn, /* INTERNAL */ one ) {\n    // Do stuff\n}\n</code></pre>\n\n<h2>Equality</h2>\n\nStrict equality checks (<code>===</code>) must be used in favor of abstract equality checks (<code>==</code>).\n\n<h2>Type Checks</h2>\n\nThese are the preferred ways of checking the type of an object:\n\n<ul>\n<li>String: <code>typeof object === 'string'</code></li>\n<li>Number: <code>typeof object === 'number'</code></li>\n<li>Boolean: <code>typeof object === 'boolean'</code></li>\n<li>Object: <code>typeof object === 'object'</code> or <code>_.isObject( object )</code></li>\n<li>Plain Object: <code>jQuery.isPlainObject( object )</code></li>\n<li>Function: <code>_.isFunction( object )</code> or <code>jQuery.isFunction( object )</code></li>\n<li>Array: <code>_.isArray( object )</code> or <code>jQuery.isArray( object )</code></li>\n<li>Element: <code>object.nodeType</code> or <code>_.isElement( object )</code></li>\n<li>null: <code>object === null</code></li>\n<li>null or undefined: <code>object == null</code></li>\n<li>undefined:\n\n<ul>\n<li>Global Variables: <code>typeof variable === 'undefined'</code></li>\n<li>Local Variables: <code>variable === undefined</code></li>\n<li>Properties: <code>object.prop === undefined</code></li>\n<li>Any of the above: <code>_.isUndefined( object )</code></li>\n</ul></li>\n</ul>\n\nAnywhere Backbone or Underscore are already used, you are encouraged to use <a href=\"http://underscorejs.org/#isElement\">Underscore.js</a>&#8216;s type checking methods over jQuery&#8217;s.\n\n<h2>Strings</h2>\n\nUse single-quotes for string literals:\n\n<pre><code class=\"language-javascript\">var myStr = 'strings should be contained in single quotes';\n</code></pre>\n\nWhen a string contains single quotes, they need to be escaped with a backslash (<code>\\</code>):\n\n<pre><code class=\"language-javascript\">// Escape single quotes within strings:\n'Note the backslash before the \\'single quotes\\&apos;&apos;;\n</code></pre>\n\n<h2>Switch Statements</h2>\n\nThe usage of <code>switch</code> statements is generally discouraged, but can be useful when there are a large number of cases &#8211; especially when multiple cases can be handled by the same block, or fall-through logic (the <code>default</code> case) can be leveraged.\n\nWhen using <code>switch</code> statements:\n\n<ul>\n<li>Use a <code>break</code> for each case other than <code>default</code>. When allowing statements to &#8220;fall through,&#8221; note that explicitly.</li>\n<li>Indent <code>case</code> statements one tab within the <code>switch</code>.</li>\n</ul>\n\n<pre><code class=\"language-javascript\">switch ( event.keyCode ) {\n    // ENTER and SPACE both trigger x()\n    case $.ui.keyCode.ENTER:\n    case $.ui.keyCode.SPACE:\n        x();\n        break;\n    case $.ui.keyCode.ESCAPE:\n        y();\n        break;\n    default:\n        z();\n}\n</code></pre>\n\nIt is not recommended to return a value from within a switch statement: use the <code>case</code> blocks to set values, then <code>return</code> those values at the end.\n\n<pre><code class=\"language-javascript\">function getKeyCode( keyCode ) {\n    var result;\n\n    switch ( event.keyCode ) {\n        case $.ui.keyCode.ENTER:\n        case $.ui.keyCode.SPACE:\n            result = 'commit';\n            break;\n        case $.ui.keyCode.ESCAPE:\n            result = 'exit';\n            break;\n        default:\n            result = 'default';\n    }\n\n    return result;\n}\n</code></pre>\n\n<h2>Best Practices</h2>\n\n<h3>Arrays</h3>\n\nCreating arrays in JavaScript should be done using the shorthand <code>[]</code> constructor rather than the <code>new Array()</code> notation.\n\n<pre><code class=\"language-javascript\">var myArray = [];\n</code></pre>\n\nYou can initialize an array during construction:\n\n<pre><code class=\"language-javascript\">var myArray = [ 1, 'WordPress', 2, 'Blog' ];\n</code></pre>\n\nIn JavaScript, associative arrays are defined as objects.\n\n<h3>Objects</h3>\n\nThere are many ways to create objects in JavaScript. Object literal notation, <code>{}</code>, is both the most performant, and also the easiest to read.\n\n<pre><code class=\"language-javascript\">var myObj = {};\n</code></pre>\n\nObject literal notation should be used unless the object requires a specific prototype, in which case the object should be created by calling a constructor function with <code>new</code>.\n\n<pre><code class=\"language-javascript\">var myObj = new ConstructorMethod();\n</code></pre>\n\nObject properties should be accessed via dot notation, unless the key is a variable or a string that would not be a valid identifier:\n\n<pre><code class=\"language-javascript\">prop = object.propertyName;\nprop = object[ variableKey ];\nprop = object['key-with-hyphens'];\n</code></pre>\n\n<h3>Iteration</h3>\n\nWhen iterating over a large collection using a <code>for</code> loop, it is recommended to store the loop&#8217;s max value as a variable rather than re-computing the maximum every time:\n\n<pre><code class=\"language-javascript\">// Good &amp; Efficient\nvar i, max;\n\n// getItemCount() gets called once\nfor ( i = 0, max = getItemCount(); i &lt; max; i++ ) {\n    // Do stuff\n}\n\n// Bad &amp; Potentially Inefficient:\n// getItemCount() gets called every time\nfor ( i = 0; i &lt; getItemCount(); i++ ) {\n    // Do stuff\n}\n</code></pre>\n\n<h3>Underscore.js Collection Functions</h3>\n\nLearn and understand Underscore&#8217;s <a href=\"http://underscorejs.org/#collections\">collection and array methods</a>. These functions, including <code>_.each</code>, <code>_.map</code>, and <code>_.reduce</code>, allow for efficient, readable transformations of large data sets.\n\nUnderscore also permits jQuery-style chaining with regular JavaScript objects:\n\n<pre><code class=\"language-javascript\">var obj = {\n    first: 'thing 1',\n    second: 'thing 2',\n    third: 'lox'\n};\n\nvar arr = _.chain( obj )\n    .keys()\n    .map( function ( key ) {\n        return key + ' comes ' + obj[ key ];\n    } )\n    // Exit the chain\n    .value();\n\n// arr === [ 'first comes thing 1', 'second comes thing 2', 'third comes lox' ]\n</code></pre>\n\n<h3>Iterating Over jQuery Collections</h3>\n\nThe only time jQuery should be used for iteration is when iterating over a collection of jQuery objects:\n\n<pre><code class=\"language-javascript\">$tabs.each( function ( index, element ) {\n    var $element = $( element );\n\n    // Do stuff to $element\n} );\n</code></pre>\n\nNever use jQuery to iterate over raw data or vanilla JavaScript objects.\n\n<h2>JSHint</h2>\n\n<a href=\"https://jshint.com\">JSHint</a> is an automated code quality tool, designed to catch errors in your JavaScript code. JSHint is used in WordPress development to quickly verify that a patch has not introduced any logic or syntax errors to the front-end.\n\n<h3>Installing and Running JSHint</h3>\n\nJSHint is run using a tool called <a href=\"https://gruntjs.com/\">Grunt</a>. Both JSHint and Grunt are programs written in <a href=\"https://nodejs.org/\">Node.js</a>. The <code>package.json</code> configuration file that comes with the WordPress development code allows you to install and configure these tools.\n\nTo install Node.js, click the Install link on the <a href=\"https://nodejs.org/\">Node.js</a> website. The correct install file for your operating system will be downloaded. Follow the installation steps for your operating system to install the program.\n\nOnce Node.js is installed, open a command line window and navigate to the directory where you <a href=\"https://make.wordpress.org/core/handbook/tutorials/installing-wordpress-locally/from-svn/\">checked out a copy of the WordPress SVN repository</a> (use <code>cd ~/directoryname</code>. You should be in the root directory which contains the <code>package.json</code> file.\n\nNext, type <code>npm install</code> into the command line window. This will download and install all the Node packages used in WordPress development.\n\nYou should now be able to type <code>npm run grunt jshint</code> to have Grunt check all the WordPress JavaScript files for syntax and logic errors. To only check core code, type <code>npm run grunt jshint:core</code>; to only check unit test .js files, type <code>npm run grunt jshint:tests</code>.\n\n<h3>JSHint Settings</h3>\n\nThe configuration options used for JSHint are stored within a <a href=\"https://develop.svn.wordpress.org/trunk/.jshintrc\" title=\"WordPress JSHint file in svn trunk\"><code>.jshintrc</code></a> in the WordPress SVN repository. This file defines which errors JSHint should flag if it finds them within the WordPress source code.\n\n<h3>Target A Single File</h3>\n\nTo specify a single file for JSHint to check, add <code>--file=filename.js</code> to the end of the command. For example, this will only check the file named &#8220;admin-bar.js&#8221; within WordPress&#8217;s core JavaScript files:\n\n<code>npm run grunt jshint:core --file=admin-bar.js</code>\n\nAnd this would only check the &#8220;password-strength-meter.js&#8221; file within the unit tests directory:\n\n<code>npm run grunt jshint:tests --file=password-strength-meter.js</code>\n\nLimiting JSHint to a single file can be useful if you are only working on one or two specific files and don&#8217;t want to wait for JSHint to process every single file each time it runs.\n\n<h3>JSHint Overrides: Ignore Blocks</h3>\n\nIn some situations, parts of a file should be excluded from JSHint. As an example, the script file for the admin bar contains the minified code for the jQuery HoverIntent plugin &#8211; this is third-party code that should not pass through JSHint, even though it is part of a WordPress core JavaScript file.\n\nTo exclude a specific file region from being processed by JSHint, enclose it in JSHint directive comments:\n\n<pre><code class=\"language-javascript\">/* jshint ignore:start */\nif ( typeof jQuery.fn.hoverIntent === 'undefined' ) {\n    // hoverIntent r6 - Copy of wp-includes/js/hoverIntent.min.js\n    (function(a){a.fn.hoverIntent=...............\n}\n/* jshint ignore:end */\n</code></pre>\n\n<h2>Credits</h2>\n\n<ul>\n<li>The jQuery examples are adapted from the <a href=\"https://contribute.jquery.org/style-guide/js\">jQuery JavaScript Style Guide</a>, which is made available under the MIT license.</li>\n</ul>\n",
        "protected": false
    },
    "author": 0,
    "featured_media": 0,
    "parent": 41426,
    "menu_order": 0,
    "template": "",
    "meta": {
        "footnotes": ""
    },
    "class_list": [
        "post-41430",
        "wpcs-handbook",
        "type-wpcs-handbook",
        "status-publish",
        "hentry",
        "type-handbook"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/wpcs-handbook/41430",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/wpcs-handbook"
            }
        ],
        "about": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/types/wpcs-handbook"
            }
        ],
        "version-history": [
            {
                "count": 12,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/wpcs-handbook/41430/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 155746,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/wpcs-handbook/41430/revisions/155746"
            }
        ],
        "up": [
            {
                "embeddable": true,
                "href": "https://developer.wordpress.org/wp-json/wp/v2/wpcs-handbook/41426"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://developer.wordpress.org/wp-json/wp/v2/media?parent=41430"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}