{
    "id": 10778686,
    "date": "2018-10-20T03:50:22",
    "date_gmt": "2018-10-20T03:50:22",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10778686"
    },
    "modified": "2023-01-11T10:58:30",
    "modified_gmt": "2023-01-11T10:58:30",
    "slug": "administration-screens",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/administration-screens/",
    "title": {
        "rendered": "Administration Screens"
    },
    "content": {
        "rendered": "\n<p>The Administration Screen provides access to the control features of your WordPress installation.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"common-layout\">Common Layout</h2>\n\n\n\n<p>Each Administration Screen is presented in sections, the toolbar (and header), the main navigation, the work area, and the footer.</p>\n\n\n\n<figure class=\"wp-block-image is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https://wordpress.org/documentation/files/2018/10/administrations_screen_4.9.4_with_note.jpg\" alt=\"\" class=\"wp-image-10798244\" width=\"872\" height=\"496\" srcset=\"https://wordpress.org/documentation/files/2018/10/administrations_screen_4.9.4_with_note.jpg 1163w, https://wordpress.org/documentation/files/2018/10/administrations_screen_4.9.4_with_note-300x171.jpg 300w, https://wordpress.org/documentation/files/2018/10/administrations_screen_4.9.4_with_note-1024x582.jpg 1024w, https://wordpress.org/documentation/files/2018/10/administrations_screen_4.9.4_with_note-768x436.jpg 768w\" sizes=\"auto, (max-width: 872px) 100vw, 872px\" /><figcaption>Administration Screen</figcaption></figure>\n\n\n\n<p><strong>Toolbar</strong> has links to various administration functions, and is displayed at the top of each Administration Screen. Many Toolbar items expand (flyout) when hovered over to display more information.</p>\n\n\n\n<p><strong>Main Navigation</strong> menu details each of the administrative functions you can perform. At the bottom of that section is a Collapse menu button that shrinks the menu into a set of icons, or to expands to list them by major function. Within each major function, such as Posts, the sub-menu expands (fly-out) when hovered over, and expands fully if an item clicked.</p>\n\n\n\n<p>In the <strong>work area</strong>, the specific information relating to a particular navigation choice, such as adding a new post, is presented and collected.</p>\n\n\n\n<p><strong>Footer</strong>, at the bottom of each Administration Screen in light shading, are links to <a href=\"https://wordpress.org/\">WordPress</a>, thanking you for using it, and the <strong>version</strong> of WordPress you have installed is shown.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"toolbar-keeping-it-all-together\">Toolbar &#8211; Keeping It All Together</h2>\n\n\n\n<p>The Toolbar contains links to information About WordPress, as well as quick-links to create new posts, pages and links, add new plugins and users, review comments, and alerts to available updates to plugins and themes on your site.</p>\n\n\n\n<p><strong>Tips</strong>: To hide the Toolbar, go to Administration Screens &gt; Users &gt; Your Profile, and turn off &#8220;Show Toolbar when viewing site&#8221; of Toolbar option.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"about-wordpress\">About WordPress</h3>\n\n\n\n<p>At the left-most side of the Toolbar is a WordPress logo. Place, or hover, the mouse cursor over the logo to see to <a href=\"https://wordpress.org/about/\">About WordPress</a>, <a href=\"https://wordpress.org/\">WordPress.org</a>, <a href=\"/support\">Documentation</a>, <a href=\"/support\">Support</a>, and <a href=\"/support/forum/requests-and-feedback\">Feedback</a>.</p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"482\" src=\"https://wordpress.org/documentation/files/2018/10/WordPress-About-Menu-1-1024x482.jpg\" alt=\"WordPress About Menu\" class=\"wp-image-11656699\" srcset=\"https://wordpress.org/documentation/files/2018/10/WordPress-About-Menu-1-1024x482.jpg 1024w, https://wordpress.org/documentation/files/2018/10/WordPress-About-Menu-1-300x141.jpg 300w, https://wordpress.org/documentation/files/2018/10/WordPress-About-Menu-1-768x362.jpg 768w, https://wordpress.org/documentation/files/2018/10/WordPress-About-Menu-1.jpg 1130w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>The top link on that menu is for the &#8216;About WordPress&#8217; page, which contains tabs for What&#8217;s New, Credits, Freedoms and Privacy.</p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>What&#8217;s New</strong> screen describes many of the new features WordPress current version.</li><li><strong>Credits</strong> screen provides some details about the various individuals who contribute to the WordPress code base.</li><li><strong>Freedoms</strong> screen describes your rights as a user of WordPress as open source software.</li><li><strong>Privacy</strong> screen describes handling of privacy information in WordPress.     </li></ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"visit-site-link\">Visit Site link</h3>\n\n\n\n<p>In the Toolbar, to the right of the WordPress logo, your site name is displayed as a link. Hover over the site name to see the View Site link to visit the main page of your site.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"howdy-user\">Howdy, User</h3>\n\n\n\n<p>On the far right of the Toolbar is &#8220;Howdy, User&#8221;, with an image of your Gravatar. When hovered over, this expands to link you to your Profile Screen as well as a Log Out link.</p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"264\" height=\"151\" src=\"https://wordpress.org/documentation/files/2018/10/howdyuser.jpg\" alt=\"\" class=\"wp-image-10798287\" /><figcaption>Howdy, User</figcaption></figure>\n\n\n\n<p>When you log in to your blog, WordPress stores a so called <em>cookie</em> in your web browser. This cookie allows WordPress to remember who you are; if you leave your blog&#8217;s site for a while but come back to it later, WordPress will see the cookie and not require you to log in again.</p>\n\n\n\n<p><strong>Tips</strong>:  If you have a WordPress cookie set in your web browser, anyone using your computer can access the Administration Screens of your blog. If you <em>don&#8217;t</em> want this to happen (perhaps you are using a public computer or a computer which other people use), you can click this <strong>Log Out</strong> link, and WordPress will delete the cookie from your web browser.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"screen-options\">Screen Options</h3>\n\n\n\n<p>Screen Options, displayed as a hanging tab under <strong>the toolbar</strong>, allow the user to decide what fields or modules are presented in the <strong>work area</strong> for a given Administration Screen. Each Screen may have a different set of Screen Options.</p>\n\n\n\n<p>Click on the Screen Options tab to expand the options available for a particular Screen, check (or uncheck) the desired options, then click the Screen Options hanging tab to collapse the Screen Options.</p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1195\" height=\"121\" src=\"https://wordpress.org/documentation/files/2018/10/screenoptions.png\" alt=\"\" class=\"wp-image-10798288\" srcset=\"https://wordpress.org/documentation/files/2018/10/screenoptions.png 1195w, https://wordpress.org/documentation/files/2018/10/screenoptions-300x30.png 300w, https://wordpress.org/documentation/files/2018/10/screenoptions-1024x104.png 1024w, https://wordpress.org/documentation/files/2018/10/screenoptions-768x78.png 768w\" sizes=\"auto, (max-width: 1195px) 100vw, 1195px\" /><figcaption>Screen Options</figcaption></figure>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"help\">Help</h3>\n\n\n\n<p>Contextual <strong>Help</strong>, displayed as a hanging tab under <strong>the toolbar</strong>, displays one or more Help items that are related to the Screen that is displayed in the <strong>work area</strong>.</p>\n\n\n\n<p>Click on the Help tab to expand the Help available for a particular Screen, then click the Help hanging tab to collapse the Help display.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"dashboard-information-central\">Dashboard &#8211; Information Central </h2>\n\n\n\n<p>The Dashboard tells you about recent activity both at your site and in the WordPress community, and update information.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"dashboard\">Dashboard</h3>\n\n\n\n<p><strong>Welcome &#8211; </strong>Shows links for some of the most common tasks when setting up a new site.</p>\n\n\n\n<p><strong>At A Glance &#8211; </strong>Displays a summary of the content on your site and identifies which theme and version of WordPress you are using.</p>\n\n\n\n<p><strong>Activity &#8211; </strong>Shows the upcoming scheduled posts, recently published posts, and the most recent comments on your posts and allows you to moderate them.</p>\n\n\n\n<p><strong>Quick Draft &#8211; </strong>Allows you to create a new post and save it as a draft. Also displays links to the 5 most recent draft posts you&#8217;ve started.</p>\n\n\n\n<p><strong>WordPress Events and News</strong> — Latest local events and news from the official WordPress project.</p>\n\n\n\n<p><strong>PHP Info</strong> — Shows the current PHP version your WordPress website is running on and whether the update is needed.</p>\n\n\n\n<p><strong>Site Health Status</strong> — Overview of current state of your website and if any parts of it needs improvements. </p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"updates\">Updates</h3>\n\n\n\n<p>You can update to the latest version of WordPress, as well as update your themes, plugins, and translations from the WordPress.org repositories.</p>\n\n\n\n<p>If an update is available, you᾿ll see a notification appear in the Toolbar and navigation menu. Keeping your site updated is important for security. It also makes the internet a safer place for you and your readers.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"updating-wordpress\">Updating WordPress</h4>\n\n\n\n<p>Click on the <strong>Update Now</strong> button when you are notified that a new version is available.</p>\n\n\n\n<p><strong>Tips</strong>: In most cases, WordPress will automatically apply maintenance and security updates in the background for you.</p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"updating-themes-plugins-and-translations\">Updating Themes, Plugins and Translations</h4>\n\n\n\n<p>To update individual themes, plugins or Translations, use the checkboxes to make your selection, then click on the appropriate <strong>Update</strong> button.</p>\n\n\n\n<p>To update all of your themes, plugins or Translations at once, you can check the box at the top of the section to select all before clicking the <strong>update</strong> button.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"posts-make-some-content\">Posts &#8211; Make some content </h2>\n\n\n\n<p><a href=\"/support/article/glossary/#post\">Posts</a> are the principal element (or content) of a blog. The Posts are the writings, compositions or discussions.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"all-posts\">All Posts</h3>\n\n\n\n<p>Via the <a href=\"/support/article/posts-screen/\">All Posts Screen</a> you can select the Post or Posts you wish to edit, delete, or view. Multiple Posts can be selected for deletion and for editing. A powerful bulk edit feature allows you to change certain fields for a group of Posts. A handy in-line edit tool, called Quick Edit, allows you to update many fields for an individual Post. Various search and filtering options allow you to find the Posts you want to edit or delete.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-new-post\">Add New Post</h3>\n\n\n\n<p><a href=\"/support/article/writing-posts/\">Posts Add New Screen</a> is where you write new Posts. While you are writing those Posts, you can also create new Categories and new Tags. In addition, any Media (pictures, video, recordings, files) can be uploaded and inserted into the Posts.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"categories\">Categories</h3>\n\n\n\n<p>Every Post in WordPress is filed under one or more Categories. Categories allow the classification of your Posts into groups and subgroups, thereby aiding viewers in the navigation and use of your site.</p>\n\n\n\n<p>Each Category may be assigned to a Category Parent so that you may set up a hierarchy within the category structure. Using automobiles as an example, a hierarchy might be Car-&gt;Ford-&gt;Mustang. In creating categories, recognize that each category name must be unique, regardless of hierarchy.</p>\n\n\n\n<p>When using the WordPress default theme, all the Categories to which a given post belongs are displayed under that post. When someone viewing your blog clicks on one of those Category links, a archive page with all the Posts belonging to that Category will be displayed.</p>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Posts Categories Screen\">Posts Categories Screen</a> allows you to add, edit, and delete Categories, as well as organize your categories hierarchically. Multiple Categories can be selected for deletion. A search option allows you to find the Categories you want to edit or delete. Also remember Categories can be added in the <a href=\"/support/article/writing-posts/\">Posts Add New Screen</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"tags\">Tags</h3>\n\n\n\n<p>Tags are the keywords you might assign to each post. Not to be confused with Categories, Tags have no hierarchy, meaning there&#8217;s no relationship from one Tag to another. But like Categories, Tags provide another means to aid your readers in accessing information on your blog.</p>\n\n\n\n<p>When using the WordPress default theme, Tags are displayed under each Post those Tags are assigned. Someone viewing your blog can click on one of those Tag links, and an archive page with all the Posts belonging to that Tag will be displayed.</p>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Posts Tags Screen\">Posts Tags Screen</a> allows you to add, change, or delete Tags. Multiple Tags can be selected for deletion. A search option allows you to find the Tags you want to edit or delete. Also remember Tags can be added in the <a href=\"https://codex.wordpress.org/Posts Add New Screen\">Posts A</a><a href=\"/support/article/writing-posts/\">dd New Screen.</a></p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"media-add-pictures-and-movies-to-your-posts\">Media &#8211; Add pictures and movies to your posts </h2>\n\n\n\n<p>Media is the images, video, recordings, and files, you upload and use in your blog. Media is typically uploaded and inserted into the content when writing a Post or Page. Note that the Uploading Files section in the <a href=\"/support/article/settings-media-screen/\">Settings Media Screen</a> describes the location and structure of the upload directory.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"library\">Library</h3>\n\n\n\n<p>The <a href=\"/support/article/media-library-screen/\">Media Library Screen</a> allows you add, edit, delete or view Media previously uploaded to your blog. Multiple Media objects can be selected for deletion. Search and filtering ability is also provided to allow you to find the desired Media.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-new-media\">Add New Media</h3>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Media Add New Screen\">Media Add New Screen</a> allows you to upload new media to later use with posts and pages. A drag and drop Uploader is provided and the ability to use a Browser Uploader button is also supplied.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"edit-media\">Edit Media</h3>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Edit Media\">Edit Media</a> page allows you to edit the information (title, caption, alt text, etc.) of media files uploaded to your site. This page does not appear as a link in the main Dashboard navigation, but is reached by clicking on the Edit link in the <a href=\"/support/article/media-library-screen/\">Media Library Screen</a> that appears when you hover over each item, or when uploading media for the first time on the&nbsp;<a href=\"https://codex.wordpress.org/Media Add New Screen\">Media Add New Screen</a> once your upload has completed.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"pages-your-static-content\">Pages &#8211; Your Static Content </h2>\n\n\n\n<p>A <a href=\"/support/article/glossary/#page\">Page</a> is another tool to add content to a WordPress site and is often used to present &#8220;static&#8221; information about the site; Pages are typically &#8220;timeless&#8221; in nature. A good example of a Page is the information contained in &#8220;About&#8221; or &#8220;Contact&#8221; Pages. A Page should not be confused with the time-oriented objects called Posts, nor should a WordPress Page be confused with the word &#8220;page&#8221; referring to any web page or HTML document on the Web.</p>\n\n\n\n<p>Because Pages live outside of the normal blog chronology, and as such, are not displayed with the rest of your Posts, but are displayed individually.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"all-pages\">All Pages</h3>\n\n\n\n<p>The <a href=\"/support/article/pages-screen/\">All Pages Screen</a> provides the necessary tools to edit, delete or view existing Pages. On this Screen you can select the Page to edit, delete or view. Multiple Pages can be selected for deletion and for editing. A powerful bulk edit tool allows certain fields to be edited for a whole group of Pages. A handy in-line edit tool, called Quick Edit, allows you to update many fields for an individual Page. Various search and filtering options allow you to find the Pages you want to edit or delete.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-new-page\">Add New Page</h3>\n\n\n\n<p>The <a href=\"/support/article/pages-add-new-screen/\">Add New Page Screen</a> allows you to create new Pages. Also see the <a href=\"/support/article/pages/\">Pages article</a> for an in depth discussion.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"comments-reader-feedback\">Comments &#8211; Reader Feedback </h2>\n\n\n\n<p>Comments are a feature of blogs which allow readers to respond to Posts.</p>\n\n\n\n<p>In the <a href=\"https://wordpress.org/documentation/article/comments-screen/\">Comments Screen</a> you can edit and delete as well as mark comments as spam. Comments that are awaiting moderation can be marked as approved or previously approved comments can be unapproved. Multiple comments can be selected and approved, marked as spam, unapproved, or deleted. A section at the top of the Comments Screen displays the number of comments awaiting moderation and the number of approved comments. A search box allows you to find specific comments</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"appearance-change-the-look-of-your-blog\">Appearance &#8211; Change the Look of your Blog </h2>\n\n\n\n<p>WordPress allows you to easily style your site by either installing and activating new Themes or customizing existing Themes.</p>\n\n\n\n<p><strong>Tips</strong>: From Theme Customizer launched by Appearance &gt; Customize, you can customize all other options such as Theme, Widgets, Menus and Header. Also, modern theme has other settings or options. You should try Theme Customizer </p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"themes\">Themes</h3>\n\n\n\n<p>A Theme is the overall design of a site and encompasses color, graphics, and text. WordPress site-owners have available a long list of Themes to choose from in deciding what to present to their sites&#8217; viewers.</p>\n\n\n\n<p>From the <a href=\"https://codex.wordpress.org/Appearance Themes Screen\">Appearance Themes Screen</a>, you can choose which Theme will be presented to users visiting your site. You can also view screenshots of each Theme you have uploaded to your site. In addition, under the Install Themes tab you can find and install new Themes.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"customize\">Customize</h3>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Appearance Customize Screen\">Customize Screen</a> displays the settings that can be customized for a specific theme. For instance, the WordPress default theme provides options that allows the user to set the colors and a background image.</p>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Appearance Customize Screen\">Customize Screen</a> page describes the details of this feature.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"widgets\">Widgets</h3>\n\n\n\n<p>Widgets are gadgets or gizmos that allow you to add various pieces of information to your Theme&#8217;s sidebar content. Widgets, for example, can be used to add Categories, Archives, Blogroll, Recent Posts, and Recent Comments to your sidebar.</p>\n\n\n\n<p>From the <a href=\"https://wordpress.org/documentation/article/appearance-widgets-screen/\">Appearance Widgets Screen </a>you can add, delete, and configure, the Widgets use in one or more of your Theme&#8217;s <a href=\"/support/article/glossary/#sidebar\">sidebar</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"menus\">Menus</h3>\n\n\n\n<p>The Menus feature allows you to create a navigation menu of pages, categories, custom links, tags, etc. that is presented to your visitors. A custom menu WordPress Widget allows display of a custom menu in the sidebar or other widgetized areas in the Theme.</p>\n\n\n\n<p>From the <a href=\"/support/article/appearance-menus-screen/\">Appearance Menus Screen</a> you can create and edit navigation menus for visitors use.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"header\">Header</h3>\n\n\n\n<p>The Header feature allows you to manage what image is displayed in a Theme&#8217;s header. WordPress default theme allows you to preview, upload, remove, and set as default, the images you want randomly displayed in the header.</p>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Appearance Header Screen\">Appearance Header Screen</a> describes the details of this feature.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"plugins-add-functionality-to-your-blog\">Plugins &#8211; Add Functionality to your Blog </h2>\n\n\n\n<p><a href=\"/support/article/plugins/\">Plugins</a> allow you to add new features to your WordPress blog that don&#8217;t come standard with the default installation. There are a rich variety of Available Plugins for WordPress, and with the following Screens, plugin installation and management is a snap.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"installed-plugins\">Installed Plugins</h3>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Plugins Screen\">Plugins Installed Screen</a> allows you to view the plugins you&#8217;ve downloaded and choose which plugins you want activated on your site. For information on downloading and installing plugins, see <a href=\"/support/article/managing-plugins/\">Managing Plugins</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-new-plugins\">Add New Plugins</h3>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Plugins Add New Screen\">Plugins Add New Screen</a> allows you to add new plugins. For information on downloading and installing plugins, see <a href=\"/support/article/managing-plugins/\">Managing Plugins</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"plugin-file-editor\">Plugin File Editor</h3>\n\n\n\n<p>Using the <a href=\"https://wordpress.org/documentation/article/plugins-editor-screen/\">Plugin File Editor Screen</a>, you can modify the source code of all your plugins. </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"users-your-blogging-family\">Users &#8211; Your Blogging Family </h2>\n\n\n\n<p>Every blog probably has at least two users: <strong>admin</strong>, the account initially set up by WordPress, and the user account you, as the author/owner of the blog, use to write posts. If you want a person to be able to post to your blog, that person must have access to a user account; typically, every person will have her or his <em>own</em> user account.</p>\n\n\n\n<p>Via the Users option in the main navigation menu you can set up all of the user accounts you need, as well as change user information, or delete users. Also you can specify your, and others&#8217;, personal information, such as name, e-mail, etc. from these User Administration Screens.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"all-users\">All Users</h3>\n\n\n\n<p>You can manage the accounts of all your site&#8217;s users at the <a href=\"https://codex.wordpress.org/Users Screen\">All Users Screen</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-new-user\">Add New User</h3>\n\n\n\n<p>You can create new users with the <a href=\"https://codex.wordpress.org/Users Add New Screen\">Users Add New Screen</a>.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"your-profile\">Your Profile</h3>\n\n\n\n<p>The <a href=\"/support/article/users-your-profile-screen/\">Users Your Profile Screen</a> allows to change any information related to your user account.</p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"tools-managing-your-blog\">Tools &#8211; Managing your Blog </h2>\n\n\n\n<p>WordPress Tools provide you the ability to speed up WordPress for your local machine, import content from other sources, export your content, or to upgrade your WordPress software to a new release.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"available-tools\">Available Tools</h3>\n\n\n\n<p>There is a link to the <strong>Categories and Tag Converter</strong>. The <a href=\"https://codex.wordpress.org/Tools Screen\">Available Tools Screen</a> describes the function.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"import\">Import</h3>\n\n\n\n<p>WordPress supports the importing data from a number external sources. In many cases, posts, comments, pages, categories, tags, and users, can be imported.</p>\n\n\n\n<p>The <a href=\"/support/article/importing-content/\">Importing Content</a> for a more extensive list of import possibilites.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"export\">Export</h3>\n\n\n\n<p>WordPress Export will create an XML file for you to save to your computer. The format, which is called a WordPress eXtended RSS or WXR file, will contain your posts, comments, custom fields, categories, and tags.</p>\n\n\n\n<p>The <a href=\"https://codex.wordpress.org/Tools Export Screen\">Tools Export Screen</a> guides you through the easy process of exporting your blog. Take note that the Exporting is a useful method to backup your WordPress data.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"site-health\">Site Health</h3>\n\n\n\n<p>The <a href=\"https://wordpress.org/documentation/article/site-health-screen/\">Site Health Screen</a> offers a diagnosis of your site&#8217;s health. It gives you actionable information on how to improve your WordPress site in the form of critical errors and warnings. It also gives you a summary of the technical aspects of your site.</p>\n\n\n\n<p>There are two tabs on the site health page:</p>\n\n\n\n<p>1. <strong>Status</strong>&nbsp;&#8211; The status tab allows you to see critical information about your WordPress configuration, along with anything else that requires your attention.</p>\n\n\n\n<p>2. <strong>Info</strong> &#8211; The info tab is a granular view of the technical aspects of your WordPress website. You can see detailed information about every aspect of your site such as themes, plugins, and media.&nbsp; There is also a useful export feature that allows you to copy all of the information about your site to the clipboard.Settings &#8211; Configuration Settings </p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"general\">General</h2>\n\n\n\n<p>In the Settings Administration Screen are all of the settings that define your blog as a whole: settings which determine how your site behaves, how you interact with your site, and how the rest of the world interacts with your site.</p>\n\n\n\n<p>The <a href=\"/support/article/settings-general-screen/\">Settings Administration Screen</a> and controls some of the most basic configuration settings for your site: your site&#8217;s title and location, who may register an account at your blog, and how dates and times are calculated and displayed.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"writing\">Writing</h3>\n\n\n\n<p>Using the <a href=\"/support/article/settings-writing-screen/\">Settings Writing Screen</a>, you can control the interface with which you write new posts. These settings control the default <a href=\"https://codex.wordpress.org/Posts_Categories_Screen\">Category</a>, the default <a href=\"/support/article/post-formats/\">Post Format</a>, and the optional feature.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"reading\">Reading</h3>\n\n\n\n<p>The settings in the posts, or a &#8220;static&#8221; <a href=\"/support/article/pages/\">Page</a>, displayed as your blog&#8217;s front (main) page. You can also adjust how many posts are displayed on that main page. In addition, you can adjust <a href=\"/support/article/glossary/#feed\">syndication feed</a> features to determine how the information from your site is sent to a reader&#8217;s web browser or other applications.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"discussion\">Discussion</h3>\n\n\n\n<p>The <a href=\"/getting-started/settings-discussion-screen/\">Setti</a><a href=\"/support/article/settings-discussion-screen/\">ngs Discussion Screen</a> allows you to control settings concerning incoming and outgoing comments, pingbacks and trackbacks. You can also control from this Screen the circumstances under which your blog sends you e-mail notifying you about the goings on at your site, and you can decide if your blog should show <a href=\"/support/article/glossary/#avatar\">Avatars</a> and their ratings.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"media\">Media</h3>\n\n\n\n<p>The <a href=\"/support/article/settings-media-screen/\">Settings Media Screen</a> allows you to determine how images, documents, and other media files will be organized when uploaded, and to specify the maximum dimensions in pixels to use when inserting an image into the body of a post.</p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"permalinks\">Permalinks</h3>\n\n\n\n<p>For a nice introduction to Permalinks, check out the <a href=\"/support/article/introduction-to-blogging/#pretty-permalinks\">Pretty Permalinks</a> section of <a href=\"/support/article/introduction-to-blogging/\">Introduction to Blogging</a>. By default, WordPress uses web URLs which have question marks and lots of numbers in them; however, WordPress offers you the ability to create a custom URL structure for your permalinks and archives. This can improve the aesthetics, usability, and forward-compatibility of your links.</p>\n\n\n\n<p>The <a href=\"/support/article/settings-permalinks-screen/\">Settings Permalinks Screen</a> controls how that custom URL structure is defined.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The Administration Screen provides access to the control features of your WordPress installation. Common Layout Each Administration Screen is presented in sections, the toolbar (and header), the main navigation, the work area, and the footer. Toolbar has links to various administration functions, and is displayed at the top of each Administration Screen. Many Toolbar items [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        79,
        78
    ],
    "class_list": [
        "post-10778686",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-dashboard",
        "category-support-guides"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10778686",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10778686"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10778686/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16355077,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10778686/revisions/16355077"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10778686"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10778686"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}