{
    "id": 10851385,
    "date": "2018-11-06T04:35:02",
    "date_gmt": "2018-11-06T04:35:02",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10851385"
    },
    "modified": "2023-08-24T14:56:12",
    "modified_gmt": "2023-08-24T14:56:12",
    "slug": "introduction-to-blogging",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/introduction-to-blogging/",
    "title": {
        "rendered": "Introduction to Blogging"
    },
    "content": {
        "rendered": "\n<p>You are living in the age of technology, and you would have encountered terms like blogging, blog, and bloggers. People often need clarification about these terms. This document will discuss the concepts associated with blogging and explain the role of content and comments in the quality of blogging.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What is blogging?</h2>\n\n\n\n<p>Blogging deals with the regular sharing of information in the form of blogs on the internet. Understanding the blog concept is essential to get an insight into blogging.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What is a blog?</h2>\n\n\n\n<p>A “blog” is an updated version of the old term “weblog,” used to describe websites that maintain an ongoing chronicle of information. A blog features diary-type commentary and links to articles on other websites, usually presented as a list of entries in reverse chronological order. Blogs range from personal to political and can focus on one narrow subject or a whole range of subjects.</p>\n\n\n\n<p>Many blogs focus on web design, home staging, sports, mobile technology, etc. Few are more eclectic, presenting links to all types of other sites. And others are more like personal journals, presenting the author’s daily life and thoughts.</p>\n\n\n\n<p>Generally speaking (although there are exceptions), blogs tend to have a few things in common:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>A main content area with articles listed chronologically, the newest on top. Often, the articles are organized into categories—an archive of older articles.</li>\n\n\n\n<li>A way for people to leave comments about the articles.</li>\n\n\n\n<li>A list of links to other related sites is sometimes called a “blogroll.”</li>\n\n\n\n<li>One or more “<a href=\"https://wordpress.org/support/article/introduction-to-blogging/\">feeds</a>” like RSS, Atom, or RDF files.</li>\n</ul>\n\n\n\n<p>Some blogs may have additional features beyond these. Watch this <a href=\"http://www.youtube.com/watch?v=NN2I1pWXjXI\">short video</a> for a simple explanation of what a blog is.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What is a blogger?</h2>\n\n\n\n<p>A blogger is a person who owns, runs, or maintains a blog. That is, posting articles or new posts, information, and sharing the most up-to-date news, opinions, and case studies, to name but a few.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The blog content</h2>\n\n\n\n<p>Content has a central importance in any website. The nature of content depends on the type of business. Retail sites feature a catalog of products. University sites contain information about their campuses, curriculum, and faculty. News sites show the latest news stories.&nbsp;</p>\n\n\n\n<p>A blogger should update the content regularly. You might have a bunch of observations or reviews for a personal blog. Without updated content, there is little reason to visit a website more than once.</p>\n\n\n\n<p>Some blogs have a single author, and some have multiple authors. Each author writes his/her own articles. Typically, blog authors compose their articles in a web-based interface built into the blogging system. Some blogging systems also support using <a href=\"https://wordpress.org/support/article/weblog-client/\">stand-alone “weblog client” software</a>, allowing authors to write articles offline and upload them later.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Comments</h2>\n\n\n\n<p>Want an interactive website? Wouldn’t it be nice if a website&#8217;s readers could leave comments, tips, or impressions about the site or a specific article? With blogs, they can! Posting comments is one of the most exciting features of blogs. Most blogs have a method to allow visitors to <a href=\"https://wordpress.org/documentation/article/introduction-to-blogging/#managing-comments\">leave comments</a>. There are also nifty ways for authors of other blogs to leave comments without even visiting the blog! Called “<a href=\"https://wordpress.org/documentation/article/introduction-to-blogging/#pingbacks\">pingbacks</a>” or “<a href=\"https://wordpress.org/documentation/article/introduction-to-blogging/#trackbacks\">trackbacks</a>.“ They can inform other bloggers whenever they cite an article from another site in their own articles. It helps maintain online conversation painlessly among various site users and websites.</p>\n\n\n\n<h2 class=\"wp-block-heading\">The difference between a blog and a CMS?</h2>\n\n\n\n<p>Software that manages your website is commonly called a CMS or <a href=\"https://wordpress.org/support/article/Glossary/#content-management-system\">“Content Management System</a>.” Many blogging software programs are considered a specific type of CMS. They provide the features required to create and maintain a blog. They can make publishing on the internet as simple as writing an article, giving it a title, and organizing it under (one or more) categories. While some CMS programs offer vast and sophisticated features, an essential blogging tool provides an interface where you can work in an easy and, to some degree, intuitive manner. At the same time, it handles the logistics involved in making your composition presentable and publicly available. In other words, you get to focus on what you want to write, and the blogging tool takes care of the rest of the site management.</p>\n\n\n\n<p>WordPress is an advanced blogging tool that provides a rich set of <a href=\"https://wordpress.org/support/article/wordpress-features/\">features</a>. Through its <a href=\"https://wordpress.org/support/article/administration-screens/\">Administration Screen</a>, you can set options for the behavior and presentation of your weblog. Via these <a href=\"https://wordpress.org/support/article/administration-screens/\">Administration Screen</a>, you can easily compose a <a href=\"https://wordpress.org/support/article/glossary#post\">blog post</a>, push a button, and be published on the internet instantly! WordPress takes great pains to see that your blog posts look good, the text looks beautiful, and the HTML code it generates conforms to web standards.</p>\n\n\n\n<p>If you’re just starting, read <a href=\"https://wordpress.org/documentation/article/get-started-with-wordpress/\">Getting Started with WordPress</a>, which contains information on how to get WordPress set up quickly and effectively and on performing basic tasks within WordPress, like creating new posts or editing existing ones.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Blogging tips</h2>\n\n\n\n<p>Starting a new blog is complex and can put many people off. Some may get off to a good start only to become quickly discouraged because of the lack of comments or visits. You want to stand out from this crowd of millions of bloggers and be one of the few hundred thousand blogs that are visited. Here are some simple tips to help you on your way to blogging mastery:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Post regularly, but don’t post if you have nothing worth posting about.</li>\n\n\n\n<li>Stick with only a few specific genres to talk about.</li>\n\n\n\n<li>Don’t put ‘subscribe’ and ‘vote me’ links all over the front page until you have people that like your blog enough to ignore them (they’re usually just in the way).</li>\n\n\n\n<li>Use a clean and simple theme.</li>\n\n\n\n<li>Enjoy a blog for fun, and comment on other peoples’ blogs (as they usually visit back).</li>\n\n\n\n<li>Have fun blogging, and remember, there are no rules to what you post on your blog!</li>\n</ol>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>You are living in the age of technology, and you would have encountered terms like blogging, blog, and bloggers. People often need clarification about these terms. This document will discuss the concepts associated with blogging and explain the role of content and comments in the quality of blogging. What is blogging? Blogging deals with the regular [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        76,
        74
    ],
    "class_list": [
        "post-10851385",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-where-to-start",
        "category-wordpress-overview"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10851385",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10851385"
            }
        ],
        "version-history": [
            {
                "count": 5,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10851385/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16358730,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10851385/revisions/16358730"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10851385"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10851385"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}