{
    "id": 10776396,
    "date": "2018-10-12T23:02:00",
    "date_gmt": "2018-10-12T23:02:00",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10776396"
    },
    "modified": "2024-06-09T10:13:57",
    "modified_gmt": "2024-06-09T10:13:57",
    "slug": "write-posts-classic-editor",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/write-posts-classic-editor/",
    "title": {
        "rendered": "Write posts (Classic Editor)"
    },
    "content": {
        "rendered": "\n<div class=\"wp-block-group has-border-color has-pomegrade-1-border-color has-charcoal-1-color has-pomegrade-3-background-color has-text-color has-background has-link-color wp-elements-ae566d7036d65af94b43db9e24244462 is-layout-constrained wp-container-core-group-is-layout-a9c49bdc wp-block-group-is-layout-constrained\" style=\"border-style:solid;border-width:1px;padding-top:var(--wp--preset--spacing--20);padding-right:var(--wp--preset--spacing--20);padding-bottom:var(--wp--preset--spacing--20);padding-left:var(--wp--preset--spacing--20)\">\n<p><strong>Note</strong>: In December 2018, WordPress 5.0 launched with a new editor. This article was written for the long-available editing experience in prior WordPress versions, which can be used in WordPress 5.0 and up via the <a href=\"https://wordpress.org/plugins/classic-editor/\">Classic Editor Plugin</a>. You may be interested in <a href=\"https://wordpress.org/documentation/article/wordpress-editor/\">user documentation for the new block editor</a>.</p>\n</div>\n\n\n\n<p>Posts are entries that display in reverse order on your home page and/or blog page. Posts usually have comment fields beneath them and are included in your site&#8217;s RSS feed.</p>\n\n\n\n<p>To write a post:</p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Log in to your WordPress Administration Screen (Dashboard).</li>\n\n\n\n<li>Click the &#8216;Posts&#8217; tab.</li>\n\n\n\n<li>Click the &#8216;Add New&#8217; sub-tab.</li>\n\n\n\n<li>Start filling in the blanks: enter your post title in the upper field, and enter your post body content in the main post editing box below it.</li>\n\n\n\n<li>As needed, select a category, add tags, and make other selections from the sections below the post. (Each of these sections is explained below.)</li>\n\n\n\n<li>When you are ready, click <strong>Publish</strong>.</li>\n</ol>\n\n\n\n<h2 class=\"wp-block-heading\">Screen Options</h2>\n\n\n\n<p>There are more editing fields available to you than you see on first login. The Screen Options area allows you to choose which Post Fields are displayed or hidden from your editing area, which allows you to minimize clutter and customize according to your needs.</p>\n\n\n\n<p>You&#8217;ll find the Screen Options tab at the very top of your screen, and if you click on it, you&#8217;ll see a list of available editing boxes that you can use. Check the box for each Post Field you want displayed, or uncheck the box to hide that module. Click the Screen Options tab again to close the tab.</p>\n\n\n\n<p>Once you&#8217;ve customized how editing screen, your options are saved so you don&#8217;t have to select or hide them again next time you log in.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Post Field Descriptions</h2>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://wordpress.org/support/files/2018/10/add-new-post.png\"><img loading=\"lazy\" decoding=\"async\" width=\"1275\" height=\"876\" src=\"https://wordpress.org/support/files/2018/10/add-new-post.png\" alt=\"Adding a new post in the classic editor.\" class=\"wp-image-10776405\" srcset=\"https://wordpress.org/documentation/files/2018/10/add-new-post.png 1275w, https://wordpress.org/documentation/files/2018/10/add-new-post-300x206.png 300w, https://wordpress.org/documentation/files/2018/10/add-new-post-1024x704.png 1024w, https://wordpress.org/documentation/files/2018/10/add-new-post-768x528.png 768w\" sizes=\"auto, (max-width: 1275px) 100vw, 1275px\" /></a></figure>\n\n\n\n<p>Classic Editor &#8211; Top of Page</p>\n\n\n\n<p><strong>Title/Headline Box</strong></p>\n\n\n\n<p>This box should contain the title of your post. You can use any phrase, words, or characters. (Avoid using the same title on more than one page.) You can use commas, apostrophes, quotes, hyphens/dashes, and other typical symbols in the post like “My Site – Here’s Lookin’ at You, Kid.” WordPress will then clean it up to generate a user-friendly and URL-valid name of the post (also called the “post slug”) to create the permalink for the post.</p>\n\n\n\n<p><strong>Permalink</strong></p>\n\n\n\n<p>Permalink stands for &#8220;permanent link.&#8221; That means a post URL that does not expose the post ID which could be subject to a change (e.g. when moving to different blogging system), but it rather contains a user-friendly post name derived from the post title which could also change, although not recommended, but in a more controllable way. This post name (also referred to as &#8220;post slug&#8221; or just &#8220;slug&#8221;) can be edited, depending on your <a href=\"https://wordpress.org/documentation/article/using-permalinks/\">Permalinks</a> settings, using the &#8220;Edit&#8221; button. (To change your settings, go to Administration Screens &gt; Settings &gt; Permalinks). The permalink is automatically generated based on the title you set to the post and is shown below the title field. Punctuation such as commas, quotes, apostrophes, and invalid URL characters are removed and spaces are substituted with dashes to separate each word. If your title is &#8220;My Site &#8211; Here&#8217;s Lookin&#8217; at You, Kid&#8221;, it will be cleaned up to create the slug &#8220;my-site-heres-lookin-at-you-kid&#8221;. You can manually change this, maybe shortening it to &#8220;my-site-lookin-at-you-kid&#8221;.</p>\n\n\n\n<p><strong>Body Copy Box</strong></p>\n\n\n\n<p>The blank box where you enter your writing, links, images, links to images, and any information you want to display on your site. You can use either the visual (WYSIWYG) editor or the text view to compose your posts. For more on the text view, see the section below, <a href=\"/support/article/writing-posts/#visual-versus-text-editor\">Visual Versus Text Editor</a>.</p>\n\n\n\n<p><strong>Publish Box</strong></p>\n\n\n\n<p>Contains buttons that control the state of your post. The main states are Draft and Published. <em>Draft</em> means the post has not been published and remains in draft status for the post creator. A <em>Published</em> status means the post has been published and is live on your site.</p>\n\n\n\n<p><em>Preview Button<br> </em>Allows you to view the post before publishing.</p>\n\n\n\n<p><em>Save Draft</em><br> Allows you to save your post as a draft rather than immediately publishing it. To return to your drafts later, visit Posts &#8211; Edit in the menu bar, then select your post from the list.</p>\n\n\n\n<p><em>Status</em><br> If you select a specific publish status (click <em>Edit</em> next to <em>Status:Draft</em>) and click the update post or &#8220;Publish&#8221; button, that status is applied to the post. For example, to save a post in the <em>Pending Review</em> status, select Pending Review from the Publish Status drop-down box, and click Save As Pending. (You will see all posts organized by status by going to Administration Screens &gt; Posts &gt; Edit).</p>\n\n\n\n<p><em>Visibility</em><br> This determines how your post appears to the world. (click <em>Edit</em> next to <em>Visibility</em>) Public posts will be visible by all website visitors once published. Password Protected posts are published to all, but visitors must know the password to view the post content. Private posts are visible only to you (and to other editors or admins within your site).</p>\n\n\n\n<p><em>Revisions</em><br> Click <em>Browse</em> to see all of the changes you&#8217;ve made to your post.</p>\n\n\n\n<p><em>Scheduling</em><br> To schedule a post for publication on a future time or date, click <em>Edit</em> next to the words &#8220;Publish immediately.&#8221; You can also change the publish date to a date in the past to back-date posts. Change the settings to the desired time and date. You must also click the <em>Publish</em> button when you have completed the post to publish at the desired time and date.</p>\n\n\n\n<p><strong>Format Box<br> </strong></p>\n\n\n\n<p>Allows you to choose a format for a post. Styling and appearance are handled by the individual themes.</p>\n\n\n\n<p><strong>Categories Box</strong></p>\n\n\n\n<p>The general topic of the post. It is typical for a blog to have 7-10 categories for content. Readers can browse specific categories to see all posts in the category. You can manage your categories by going to Administration Screens &gt; Posts &gt; Categories.</p>\n\n\n\n<p><strong>Tags Box</strong></p>\n\n\n\n<p>These are micro-categories for the post, similar to including index entries for a page. Posts with similar tags are linked together when a user clicks one of the tags. Tags have to be enabled with the right code in your theme for them to appear in your post. Add new tags to the post by typing the tag into the box and clicking &#8220;Add.&#8221; You can also click on the &#8220;Choose from the most-used tags&#8221; link to see all of the tags used by the site.</p>\n\n\n\n<p><strong>Excerpt</strong></p>\n\n\n\n<p>A summary or brief teaser of your post that may appear on the front page of your site as well as on the category, archives, and search non-single post pages. Note: the Excerpt does not usually appear by default. It only appears in your post if you have modified the template file listing the post to use the_excerpt() instead of the_content() to display the Excerpt instead of the full content of a post. If so, WordPress will automatically use as the Excerpt the first 55 words of your post content or the content before the &lt;!&#8211;more&#8211;&gt; quicktag. If you use the &#8220;Excerpt&#8221; field when editing the post, this will be used no matter what. For more information, see Excerpt.</p>\n\n\n\n<p><strong>Send Trackbacks</strong></p>\n\n\n\n<p>A way to notify legacy blog systems that you&#8217;ve linked to them. If you link other WordPress blogs, they&#8217;ll be notified automatically using pingbacks. No other action is necessary. For those blogs that don&#8217;t recognize pingbacks, you can send a trackback to the blog by entering the website address(es) in this box, separating each one by a space. See Trackbacks and Pingbacks for more information.</p>\n\n\n\n<p><strong>Custom Fields</strong></p>\n\n\n\n<p>Custom Fields offer a way to add information to your site. In conjunction with extra code in your template files or plugins, Custom Fields can modify the way a post is displayed. These are primarily used by plugins, but you can manually edit that information in this section.</p>\n\n\n\n<p><strong>Discussion</strong></p>\n\n\n\n<p>Options to enable interactivity and notification of your posts. This section hosts two check boxes: <em>Allow Comments on this post </em>and <em>Allow trackbacks and pingbacks on this post</em>. If <em>Allowing Comments</em> is unchecked, no one can post comments to this particular post. If <em>Allowing Pings</em> is unchecked, no one can post pingbacks or trackbacks to this particular post.</p>\n\n\n\n<p><strong>Post Author</strong></p>\n\n\n\n<p>A list of all blog authors you can select from to attribute as the post author. This section only shows if you have multiple users with authoring rights in your blog. To view your list of users, see Administration Screens &gt; Users. For more information, see Users and Authors.</p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https://wordpress.org/documentation/files/2018/10/add-new-post-options-1024x750-1.png\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"750\" src=\"https://wordpress.org/documentation/files/2018/10/add-new-post-options-1024x750-1.png\" alt=\"Adding new post options\" class=\"wp-image-10776411\" srcset=\"https://wordpress.org/documentation/files/2018/10/add-new-post-options-1024x750-1.png 1024w, https://wordpress.org/documentation/files/2018/10/add-new-post-options-1024x750-1-300x220.png 300w, https://wordpress.org/documentation/files/2018/10/add-new-post-options-1024x750-1-768x563.png 768w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\" /></a></figure>\n\n\n\n<p>Classic Editor &#8211; Bottom of Page</p>\n\n\n\n<p><strong>Note:</strong> You can set basic options for writing, such as the size of the post box, how smiley tags are converted, and other details by going to Administration Screens &gt; Settings &gt; Writing.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Best Practices For Posting</h2>\n\n\n\n<p>You can say or show the world anything you like on your WordPress site. Here are some tips you need to know to help you write your posts in WordPress.</p>\n\n\n\n<p><strong>Practice Accessibility</strong></p>\n\n\n\n<p>To be compliant with web standards for accessibility, be sure to include ALT and TITLE descriptions on links and images to help your users, such as &lt;a title=&#8221;WordPress.ORG&#8221; href=&#8221;<a href=\"https://wordpress.org\">https://wordpress.org/</a>&#8220;&gt;WordPress.ORG&lt;/a&gt;.</p>\n\n\n\n<p><strong>Use Paragraphs</strong></p>\n\n\n\n<p>No one likes to read writing that never pauses for a line break. To break your writing up into paragraphs, use double spaces between your paragraphs. WordPress will automatically detect these and insert &lt;p&gt; HTML paragraph tags into your writing.</p>\n\n\n\n<p><strong>Use Headings</strong></p>\n\n\n\n<p>If you are writing long posts, break up the sections by using headings, small titles to highlight a change of subject. In HTML, headings are set by the use of h1, h2, h3, h4, and so on.</p>\n\n\n\n<p><strong>Use HTML</strong></p>\n\n\n\n<p>You don&#8217;t have to use HTML when writing your posts. WordPress will automatically add it to your site, but if you do want control over different elements like boxes, headings, and other additional containers or elements, use HTML.</p>\n\n\n\n<p><strong>Spell Check and Proofread</strong></p>\n\n\n\n<p>There are spell check Plugins available, but even those can&#8217;t check for everything. Some serious writers will write their posts in a text editor with spell check, check all the spelling and proof it thoroughly before copying and pasting into WordPress.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Visual Versus Text Editor</h2>\n\n\n\n<p>When writing your post, you have the option of using the Visual or Text mode of the editor. The visual mode lets you see your post as is, while the Text mode shows you the code and replaces the WYSIWYG editor buttons with quicktags. These quicktags are explained as follows.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>b</strong> &#8211; <code>&lt;strong&gt;&lt;/strong&gt;</code> HTML tag for strong emphasis of text (i.e. <strong>b</strong>old).</li>\n\n\n\n<li><em>i</em> &#8211; <code>&lt;em&gt;&lt;/em&gt;</code> HTML tag for emphasis of text (i.e. <em>i</em>talicize).</li>\n\n\n\n<li>b-quote &#8211; <code>&lt;blockquote&gt;&lt;/blockquote&gt;</code> HTML tag to distinguish quoted or cited text.</li>\n\n\n\n<li>del &#8211; <code>&lt;del&gt;&lt;/del&gt;</code> HTML tag to label text considered deleted from a post. Most browsers display as striked through text.</li>\n\n\n\n<li>link &#8211; <code>&lt;a href=\"http://example.com\"&gt;&lt;/a&gt;</code> HTML tag to create a hyperlink.</li>\n\n\n\n<li>ins &#8211; <code>&lt;ins&gt;&lt;/ins&gt;</code> HTML tag to label text considered inserted into a post. Most browsers display as underlined text.</li>\n\n\n\n<li>ul &#8211; <code>&lt;ul&gt;&lt;/ul&gt;</code> HTML tag will insert an unordered list, or wrap the selected text in same. An unordered list will typically be a bulleted list of items.</li>\n\n\n\n<li>ol &#8211; <code>&lt;ol&gt;&lt;/ol&gt;</code> HTML tag will insert a numbered list, or wrap the selected text in same. Each item in an ordered list is typically numbered.</li>\n\n\n\n<li>li &#8211; <code>&lt;li&gt;&lt;/li&gt;</code> HTML tag will insert or make the selected text a list item. Used in conjunction with the ul or ol tag.</li>\n\n\n\n<li>code &#8211; <code>&lt;code&gt;&lt;/code&gt;</code> HTML tag for preformatted styling of text. Generally sets text in a <code>monospaced font, such as Courier</code>.</li>\n\n\n\n<li>more &#8211; <code>&lt;!--more--&gt;</code> WordPress tag that breaks a post into &#8220;teaser&#8221; and content sections. Type a few paragraphs, insert this tag, then compose the rest of your post. On your blog&#8217;s home page you&#8217;ll see only those first paragraphs with a hyperlink (<code>(more...)</code>), which when followed displays the rest of the post&#8217;s content.</li>\n\n\n\n<li>page &#8211; <code>&lt;!--nextpage--&gt;</code> WordPress tag similar to the <code>more</code> tag, except it can be used any number of times in a post, and each insert will &#8220;break&#8221; and paginate the post at that location. Hyperlinks to the paginated sections of the post are then generated in combination with the wp_link_pages() or link_pages() template tag.</li>\n\n\n\n<li>lookup &#8211; Opens a JavaScript dialogue box that prompts for a word to search for through the online dictionary at answers.com. You can use this to check spelling on individual words.</li>\n\n\n\n<li>Close Tags &#8211; Closes any open HTML tags left open&#8211;but pay attention to the closing tags. WordPress is not a mind reader (!), so make sure the tags enclose what you want, and in the proper way.</li>\n</ul>\n\n\n\n<p><strong><em>Workflow Note</em></strong> &#8211; With Quicktag buttons that insert HTML tags, you can for example click <em>i</em> to insert the opening <code>&lt;em&gt;</code> tag, type the text to be enclosed, and click <em>/i</em> or Close Tags to insert the closing tag. However, you can eliminate the need for this &#8216;close&#8217; step by changing your workflow a bit: type your text, select the portion to be emphasized (that is, italicized), then click <em>i</em> and your highlighted text will be wrapped in the opening and closing tags.</p>\n\n\n\n<h2 class=\"wp-block-heading\">More Information and Resources</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"/support/article/introduction-to-blogging/\"> About Weblogs &#8211; What is Blogging all about?</a></li>\n\n\n\n<li><a href=\"/support/article/first-steps-with-wordpress/\">First Steps With WordPress</a></li>\n</ul>\n\n\n\n<p>See also <a href=\"/support/article/administration-screens/\">Administration Screens</a>.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Note: In December 2018, WordPress 5.0 launched with a new editor. This article was written for the long-available editing experience in prior WordPress versions, which can be used in WordPress 5.0 and up via the Classic Editor Plugin. You may be interested in user documentation for the new block editor. Posts are entries that display [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        86,
        78
    ],
    "class_list": [
        "post-10776396",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-publishing",
        "category-support-guides"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10776396",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10776396"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10776396/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16360458,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10776396/revisions/16360458"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10776396"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10776396"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}