{
    "id": 10821282,
    "date": "2018-10-27T09:38:13",
    "date_gmt": "2018-10-27T09:38:13",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10821282"
    },
    "modified": "2023-01-12T14:52:26",
    "modified_gmt": "2023-01-12T14:52:26",
    "slug": "faq-my-site-was-hacked",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/faq-my-site-was-hacked/",
    "title": {
        "rendered": "FAQ My site was hacked"
    },
    "content": {
        "rendered": "\n<h2 class=\"wp-block-heading\">Help I think I&#8217;ve been hacked</h2>\n\n\n\n<p>Suffering a hack can be one of the more frustrating experiences you&#8217;ll have on your online journey. Like most things however, taking a pragmatic approach can help you maintain your sanity. While also moving beyond the issues with as little impact as possible.</p>\n\n\n\n<p>A hack is a very ambiguous term, which in it of itself will provide little insights into what exactly happened. To ensure you get the help you need via the forums, be sure to understand the specific symptoms that lead you to believe you&#8217;ve been hacked. These are otherwise known as Indicators of Compromise (IoC).</p>\n\n\n\n<p>A couple of IoC&#8217;s that are clear indicators of a hack include:</p>\n\n\n\n<ul class=\"wp-block-list\"><li>Website is blacklisted by Google, Bing, etc..</li><li>Host has disabled your website</li><li>Website has been flagged for distributing malware</li><li>Readers complaining that their desktop AV&#8217;s are flagging your site</li><li>Contacted that your website is being used to attack other sites</li><li>Notice behavior that was not authorized (i.e., creation of new users, etc&#8230;)</li><li>You can visibly see that your site has been hacked when you open it in the browser</li></ul>\n\n\n\n<p>Not all hacks are created equal, so when engaging in the forums please keep this in mind. If you can better understand the symptoms the teams will be better equipped to provide help.</p>\n\n\n\n<p>Below you will find a series of steps that are designed to help you start working through the post-hack process. They are not all encompassing as it would be impractical to account for every scenario, but they are designed to help you think through the process.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Some steps to take</h2>\n\n\n\n<p><strong>Stay calm.</strong></p>\n\n\n\n<p>When addressing a security issue, as a website owner, you&#8217;re likely experiencing an undue amount of stress. It&#8217;s often the most vulnerable you have found yourself since being on line and it&#8217;s contrary to what every one told you, &#8220;Hey, WordPress is Easy!!&#8221;</p>\n\n\n\n<p>The good news is that all is not lost! Yes, you might lose some money. Yes, you might take a hit against your brand. Yes, you will recover from this.</p>\n\n\n\n<p>So, yes, take a step back and compose yourself. Doing so will allow you to more effectively take control of the situation and allow you to recover your online presence.</p>\n\n\n\n<p><strong>Document.</strong></p>\n\n\n\n<p>The first actionable step you should take post-compromise is documentation. Take a moment to document what you&#8217;re experiencing, and if possible times. A couple of things you want to keep in mind:</p>\n\n\n\n<ul class=\"wp-block-list\"><li>What are you seeing that leads you to believe you are hacked?</li><li>What time did you notice this issue? What timezone?</li><li>What actions have you taken recently? Was a new plugin installed? Did you make a change to a theme? Modify a widget?</li></ul>\n\n\n\n<p>You are creating the baseline for what is recognized as an incident report. Whether you are planning to perform the incident response yourself, or engage a professional organization, this document will prove invaluable over time.</p>\n\n\n\n<p>Recommend taking a moment to annotate details of your host environment as well. It will be required at some point during the incident response process.</p>\n\n\n\n<p><strong>Scan your website.</strong></p>\n\n\n\n<p>When scanning your website you have a few different ways to do this, you can use external remote scanners or application level scanners. Each are designed to look and report on different things. No one solution is the best approach, but together you improve your odds greatly.</p>\n\n\n\n<p>Application Based Scanners (Plugins):</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"https://wordpress.org/plugins/quttera-web-malware-scanner/\">Quttera</a></li><li><a href=\"https://wordpress.org/plugins/gotmls/\">GOTMLS</a></li><li><a href=\"https://wordpress.org/plugins/wordfence/\">WordFence</a></li><li><a href=\"https://wordpress.org/plugins/sucuri-scanner/\">Sucuri</a></li></ul>\n\n\n\n<p>Remote Based Scanners (Crawlers):</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"https://virustotal.com/\">VirusTotal</a></li><li><a href=\"https://sitecheck.sucuri.net\">Sitecheck</a></li></ul>\n\n\n\n<p>There are also a number of other related security <a href=\"https://wordpress.org/plugins/search.php?q=malware+scanner\">plugins</a> available in the WP repo. The ones annotated above have been around a long time and have strong communities behind each of them.</p>\n\n\n\n<p><strong>Scan your local environment.</strong></p>\n\n\n\n<p>In addition to scanning your website, you should start scanning your local environment. In many instances, the source of the attack / infection begins on your local box (i.e., notebook, desktop, etc&#8230;). Attackers are running trojans locally that allow them to sniff login access information to things like FTP and /wp-admin that allow them to log in as the site owner.</p>\n\n\n\n<p>Make sure you run a full anti-virus/malware scan on your local machine. Some viruses are good at detecting AV software and hiding from them. So maybe try a different one. This advice extends to both Windows, OS X and Linux machines.</p>\n\n\n\n<p><strong>Check with your hosting provider.</strong></p>\n\n\n\n<p>The hack may have affected more than just your site, especially if you are using shared hosting. It is worth checking with your hosting provider in case they are taking steps or need to. Your hosting provider might also be able to confirm if a hack is an actual hack or a loss of service, for example.</p>\n\n\n\n<p>One very serious implication of a hack these days is around Email blacklisting. This seems to be happening more and more. As websites are abused to send out SPAM emails, Email Blacklist authorities are flagging the website IP&#8217;s and those IP&#8217;s are often associated with the same server being used for email. The best thing you can do is look at Email providers like <a href=\"http://www.google.com/enterprise/apps/business/index.html\">Google Apps</a> when it comes to your business needs.</p>\n\n\n\n<p><strong>Be Mindful of Website Blacklists.</strong></p>\n\n\n\n<p><a href=\"https://sucuri.net/guides/what-is-google-blocklist\">Google Blacklist</a> issues can be detrimental to your brand. They currently blacklist somewhere in the neighborhood of 9,500 to 10,000 websites a day. This number grows daily. There are various forms of warnings, from large splash pages warning users to stay away, to more subtle warnings that pop up in your Search Engine Result Pages (SERPs).</p>\n\n\n\n<p>Although Google is one of the more prominent ones, there are a number of other blacklist entities like Bing, Yahoo and a wide range of Desktop AntiVirus applications. Understand that your clients / website visitors may leverage any number of tools and any one of them could be causing the issue.</p>\n\n\n\n<p>It&#8217;s recommended that you register your site with the various online webmaster consoles like:</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"https://www.google.com/webmasters/\">Google Search Console</a></li><li><a href=\"http://www.bing.com/toolbox/webmaster\">Bing Webmaster</a></li><li><a href=\"https://webmaster.yandex.com/\">Yandex Webmaster</a></li><li><a href=\"https://safeweb.norton.com/tags/show?tag=WebMaster\">Norton Webmaster</a></li></ul>\n\n\n\n<p><strong>Improve your Access Controls.</strong></p>\n\n\n\n<p>You will often hear folks talking about updating things like Passwords. Yes, this is a very important piece, but it&#8217;s one small piece in a much larger problem. We need improve our overall posture when it comes to access control. This means using Complex, Long and Unique passwords for starters. The best recommendation is to use a Password Generator like those found in apps like <a href=\"https://agilebits.com/onepassword\">1Password</a> and <a href=\"https://lastpass.com/\">LastPass</a>.</p>\n\n\n\n<p>Remember that this includes changing all access points. When we say access points we mean things like FTP / SFTP, WP-ADMIN, CPANEL (or any other administrator panel you use with your host) and MYSQL.</p>\n\n\n\n<p>This also extends beyond your user, and must include all users that have access to the environment.</p>\n\n\n\n<p>It is also recommended to consider using some form of <a href=\"https://halfelf.org/2013/two-factor-authentication/\">Two Factor / Multi-Factor authentication system</a>. In it&#8217;s most basic form, it introduces, and requires, a second form of authentication when logging into your WordPress instance.</p>\n\n\n\n<p>Some of the plugins available to assist you with this include:</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"https://wordpress.org/plugins/rublon/\">Rublon</a></li><li><a href=\"https://wordpress.org/plugins/duo-wordpress/\">Duo</a></li></ul>\n\n\n\n<p><strong>Reset all Access. </strong></p>\n\n\n\n<p>Once you identify a hack, one of the first steps you will want to do is lock things down so that you can minimize any additional changes. The first place to start is with your users. You can do this by forcing a global password reset for all users, especially administrators.</p>\n\n\n\n<p>Here is a plugin that can assist with this step:</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"https://wordpress.org/plugins/better-wp-security/\">iThemes Security</a></li></ul>\n\n\n\n<p>You also want to clear any users that might be actively logged into WordPress. You do this by updating the secret keys in wp-config. You will need to create a new set here: <a href=\"https://api.wordpress.org/secret-key/1.1/salt/\">the WordPress key generator</a>. Take those values then <a href=\"https://wordpress.org/documentation/article/editing-wp-config-php/\">overwrite the values in your wp-config.php file</a> with the new ones. This will force anyone that might still be logged in off.</p>\n\n\n\n<p><strong>Create a Backup.</strong></p>\n\n\n\n<p>You hopefully have a backup of your website, but if you don&#8217;t, this will be a good time to <a href=\"https://wordpress.org/documentation/article/wordpress-backups/\">create one</a>. Backups are a critical piece of your continuation of operations, and should be something you actively plan for moving forward. You should also ask your host what their policy is as it pertains to backups. If you do have a backup, you should be able to perform a restore and skill right into the forensics work.</p>\n\n\n\n<p>Side note: It&#8217;s important you keep regular backups of your <a href=\"https://wordpress.org/documentation/article/backing-up-your-database/\">database</a> and <a href=\"https://wordpress.org/documentation/article/backing-up-your-wordpress-files/\">files</a>. If this ever happens again.</p>\n\n\n\n<p>Regardless, before you move into the next phase of cleaning, it is recommended you take one more snapshot of the environment. Even if it&#8217;s infected, depending on the type of hack, the impacts can cause a lot of issues and in the event of catastrophic failure you&#8217;ll at least have that bad copy to reference.</p>\n\n\n\n<p><strong>Find and remove the hack.</strong></p>\n\n\n\n<p>This will be the most daunting part of the entire process. Finding and removing the hack. The exact steps you take will be dictated by a number of factors, including, but not limited to, the symptoms provided above. How you approach the problem will be determined by your own technical aptitude working with websites and web servers.</p>\n\n\n\n<p>To help in the process though, we&#8217;ve included a number of different resources that should help you in the process:</p>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"http://ocaoimh.ie/did-your-wordpress-site-get-hacked/\">Did Your WordPress Site Get Hacked?</a></li><li><a href=\"http://smackdown.blogsblogsblogs.com/2008/06/24/how-to-completely-clean-your-hacked-wordpress-installation/\">How to Clean Your Hacked Install</a></li><li><a href=\"https://sucuri.net/guides/how-to-clean-hacked-wordpress\">How To Clean a Hacked WordPress Site</a></li><li><a href=\"http://ottopress.com/2011/how-to-cope-with-a-hacked-site/\">How to Cope With a Hacked Site</a></li><li><a href=\"https://www.smashingmagazine.com/2012/10/four-malware-infections-wordpress/\">Four Malware Infections</a></li><li><a href=\"https://www.wordfence.com/docs/how-to-clean-a-hacked-wordpress-site-using-wordfence/\">How to Clean a WordPress Hack</a></li></ul>\n\n\n\n<p>It might be tempting to purge everything and start over. In some cases that&#8217;s possible, but in many instances it&#8217;s just not possible. What you can do however is reinstall certain elements of the site with little regard to impacting the core of your website. You always want to make sure you reinstall the same version of software your website is using, if you choose an older or newer one you&#8217;re likely to kill your website. When reinstalling, be sure not to use the reinstall options in your WP-ADMIN. Use your FTP / SFTP application to drag and drop the versions. This will prove much more effective in the long run as those installers often only overwrite existing files, and hacks often introduce new files&#8230; You can replace the following directories safely:</p>\n\n\n\n<ul class=\"wp-block-list\"><li>/wp-admin</li><li>/wp-includes</li></ul>\n\n\n\n<p>From there, it&#8217;s recommended that you be more diligent in updating and replacing files as you move through wp-content as it contains your theme and plugin files.</p>\n\n\n\n<p>The one file you will definitely want to look at is your .htaccess file. It&#8217;s one of the more common files, regardless of the type of infection, that is most often updated and used for nefarious activities. This file is often located at the root of your installation folder, but can also be embedded within several other directories on the same installation.</p>\n\n\n\n<p>Regardless of the type of infection, there are will be some common files you will want to keep an eye on during your remediation process. They include:</p>\n\n\n\n<ul class=\"wp-block-list\"><li>index.php</li><li>header.php</li><li>footer.php</li><li>function.php</li></ul>\n\n\n\n<p>If modified, these files can usually adversely affect all page requests, making them high targets for bad actors.</p>\n\n\n\n<p><strong>Leverage the Community</strong></p>\n\n\n\n<p>We often forget but we&#8217;re a community based platform, this means that if you&#8217;re in trouble someone in the community is likely to give a lending hand. A very good place to start if you&#8217;re strapped for cash or just looking for a helping hand is the <a href=\"https://wordpress.org/tags/hacked\">WordPress.org Hacked</a> or <a href=\"https://wordpress.org/tags/malware\">Malware</a> forum.</p>\n\n\n\n<p><strong>Update!</strong></p>\n\n\n\n<p>Once you are clean, you should <a href=\"https://wordpress.org/documentation/article/updating-wordpress/\">update your WordPress installation</a> to the <a href=\"https://wordpress.org/download/\">latest software</a>. Older versions are more prone to hacks than newer versions.</p>\n\n\n\n<p><strong>Change the passwords again!</strong></p>\n\n\n\n<p>Remember, you need to change the passwords for your site <em>after</em> making sure your site is clean. So if you only changed them when you discovered the hack, <a href=\"https://wordpress.org/documentation/article/resetting-your-password/\">change them again now</a>. Again remembering to use Complex, Long and Unique passwords.</p>\n\n\n\n<p>You may consider to change the database user account and password. When you changed them, do not forget enhancing them to wp-config.php file.</p>\n\n\n\n<p><strong>Forensics.</strong></p>\n\n\n\n<p>Forensics is the process of understanding what happened. How did the attackers get in? The goal is to understand the attack vector a bad actor used to ensure they&#8217;re unable to abuse it again. In many instances, it&#8217;s very difficult for website owners to perform this type of analysis due to lack of technical knowledge and / or available data. If you do have the metadata required, then there are tools like like <a href=\"http://www.ossec.net\">OSSEC</a> and <a href=\"https://www.splunk.com/\">splunk</a> that can help you synthesize the data.</p>\n\n\n\n<p><strong>Secure your site.</strong></p>\n\n\n\n<p>Now that you have successfully recovered your site, secure it by implementing some (if not all) of the <a href=\"https://wordpress.org/documentation/article/hardening-wordpress/\">recommended security measures</a>.</p>\n\n\n\n<p><strong>Can&#8217;t Log Into WordPress Admin Panel</strong></p>\n\n\n\n<p>There are times that a bad actor will hijack your administrator account[s]. This is not a reason to panic, there are a few different things you can do to regain control of your account. You can follow these steps to <a href=\"https://wordpress.org/documentation/article/resetting-your-password/\">reset your password</a></p>\n\n\n\n<p>Tools like <a href=\"https://wordpress.org/documentation/article/phpmyadmin/\">phpMyAdmin</a> and <a href=\"https://www.adminer.org/\">Adminer</a> are often made available via your hosting provider. They allow you to log into your database directly, bypassing your <a href=\"https://wordpress.org/documentation/article/administration-screens/\">Administration Screen</a> and resetting your user in the users table <code>wp_users</code>.</p>\n\n\n\n<p>If you don&#8217;t want to mess with password hashes or can&#8217;t figure it out, simply update your email and go back to Login Screen, click forgot password, and wait for the email.</p>\n\n\n\n<p><strong>Using version control?</strong></p>\n\n\n\n<p>If you are using version control, it can be very handy to quickly identify what has changed and to rollback to a previous version of the website. From the terminal or command line you can compare your files with the versions stored in the official WordPress repository.</p>\n\n\n\n<p>$<code> svn diff .</code></p>\n\n\n\n<p>Or compare a specific file:</p>\n\n\n\n<p>$<code> svn diff /path/to/filename</code></p>\n\n\n\n<h2 class=\"wp-block-heading\">Other Resources</h2>\n\n\n\n<ul class=\"wp-block-list\"><li><a href=\"http://ottopress.com/2009/hacked-wordpress-backdoors/\">Hacked WordPress Backdoors (OttoPress)</a></li><li><a href=\"http://blog.sucuri.net/2012/08/wordpress-security-cutting-through-the-bs.html\">WordPress Security &#8211; Cutting Through the BS (Sucuri)</a></li><li><a href=\"http://perishablepress.com/category/security/\">Security Posts (Perishable Press)</a></li></ul>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>Help I think I&#8217;ve been hacked Suffering a hack can be one of the more frustrating experiences you&#8217;ll have on your online journey. Like most things however, taking a pragmatic approach can help you maintain your sanity. While also moving beyond the issues with as little impact as possible. A hack is a very ambiguous [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        77,
        74
    ],
    "class_list": [
        "post-10821282",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-faqs",
        "category-wordpress-overview"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10821282",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10821282"
            }
        ],
        "version-history": [
            {
                "count": 1,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10821282/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16355188,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10821282/revisions/16355188"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10821282"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10821282"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}