{
    "id": 10840109,
    "date": "2018-11-02T04:28:01",
    "date_gmt": "2018-11-02T04:28:01",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10840109"
    },
    "modified": "2023-07-05T09:29:08",
    "modified_gmt": "2023-07-05T09:29:08",
    "slug": "image-size-and-quality",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/image-size-and-quality/",
    "title": {
        "rendered": "Image size and quality"
    },
    "content": {
        "rendered": "\n<p>The size and quality of an image for use on a web page is determined by a variety of things.</p>\n\n\n\n<p><strong>Physical Size </strong></p>\n\n\n\n<p>The physical size of an image is based upon two things: The size of the image on the screen and the file size. Generally, the file size is treated as a different issue.</p>\n\n\n\n<p><strong>File Size </strong></p>\n\n\n\n<p>This is the size of the file on your hard drive or server.</p>\n\n\n\n<p><strong>Resolution </strong></p>\n\n\n\n<p><em>Resolution</em> refers to the number of pixels in an image. Resolution is sometimes identified by the width and height of the image as well as the total number of pixels in the image.</p>\n\n\n\n<p><strong>File Type </strong></p>\n\n\n\n<p>There are basically X image types popularly found on the Internet: <code>jpeg,gif,png</code> and (for <a href=\"https://wordpress.org/documentation/article/create-a-favicon/\" data-type=\"helphub_article\" data-id=\"10846004\">favicons</a> (the icons next to the address)) <code>ico</code>.</p>\n\n\n\n<p>The <strong>physical size</strong> of the image is information we need to know in order to determine how much &#8220;space&#8221; will the image occupy on a web page. If your WordPress Theme features a fixed width content area of 600 pixels and the image you want to use is 800, the image will push the sidebar and layout of your web page around, messing up your design.  Images within that 600 pixel width need to be restricted to that maximum width in order to protect the layout of your page. It&#8217;s up to you to determine what size they should be from there, matching the image to your overall layout and styles.</p>\n\n\n\n<p><strong>File size</strong> dictates the time it takes to load your page, the larger the file size, often increased because of a high <strong>image resolution</strong> quality, the longer it will take to load.  People often don&#8217;t have the patience to wait through long web page loads, so keeping your file sizes low speeds up your web page access times. Typically, large high quality images should be kept between 100K and 60K.  Smaller images should be closer to 30K and lower.</p>\n\n\n\n<p>The <strong>resolution</strong> of the image dictates its clarity. The higher the resolution, though, the larger the file size, so you have to make a compromise between quality and file size.</p>\n\n\n\n<p>Luckily, the various file types most commonly used on the Internet have <em>compression</em> features. When you save the file as one of these types, it condenses or <em>compresses</em> the data information in the image file.  Internet browsers can <em>decompress</em> this information to display the image on the screen.  Some graphic software programs allow you to set the compression rate to control the quality of the image (and file size) at the time you save it.  Depending upon your use of the images on your site, you may have to experiment with this to get the right ratio that keeps the resolution quality good while maintaining a small file size.</p>\n\n\n\n<p>Websites use four common <strong>file types</strong>. The end of a filename (called the <em>extension</em>) tells what type it is.  One type, <code>ico</code>, is to make a <em><a href=\"https://wordpress.org/documentation/article/create-a-favicon/\" data-type=\"helphub_article\" data-id=\"10846004\">favicon</a></em> file &#8212; but this is usually only done when a website is first set up.  The other three types are used for general images:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><code>jpg</code> (JPEG) is good for photographs.  Saving a photo as <code>jpg</code> removes detail from the photo.  Good photo editors let you control how much detail is removed (the &#8220;compression&#8221;).  Different photos need different compression; doing this carefully and viewing the result can give you a usable photo with a small file size.</li>\n\n\n\n<li><code>gif</code> can be poor for photographs.  It&#8217;s better for line art, like logos, with solid areas of the same color.</li>\n\n\n\n<li><code>png</code> is for both photographs and line art.  It compresses photos without losing detail, but usually makes larger photo files than JPEGs.  Some older browsers don&#8217;t completely support <code>png</code>, though.</li>\n</ul>\n\n\n\n<p>If you aren&#8217;t sure which file type is best for a particular image, try saving the image in more than one type and comparing the file sizes.  Using the right type can make a big difference! There&#8217;s more information in <a href=\"https://developer.mozilla.org/en-US/docs/Web/Media/Formats/Image_types\">Image file type and format guide</a>. </p>\n\n\n\n<h2 class=\"wp-block-heading\">Resizing Images</h2>\n\n\n\n<p>Not all graphic software packages allow you to resize images, though most should. Check your graphics software table of contents or index for <em>resize</em>, <em>size</em>, <em>transform</em>, <em>reduce</em>, or <em>enlarge</em>, all synonyms for the for the same thing.  If they don&#8217;t have the feature, you may have to find different software.</p>\n\n\n\n<p>The process of resizing images is fairly simple. There are usually two methods:</p>\n\n\n\n<p>1) You can resize an image through the use of tools provided which allow you to manually shift the edges of an image to deform or resize the image. The best way is to grab a corner, not the edge, to resize the image. The corner &#8220;handle&#8221; will usually resize the image maintaining the overall height-width ratio. Check your manual for specific instructions.</p>\n\n\n\n<p>2) The other method involves simply specifying the image&#8217;s final size. The advanced graphics programs allow you to set it by exact dimensions or a percentage of reduction or enlargement.</p>\n\n\n\n<p>After resizing the image, the image may be smaller, but it may also be slightly out of focus. You can sharpen the focus of the small image by using the <strong>sharpen</strong> feature in your software.</p>\n\n\n\n<p>When you have fine-tuned your small sized image or new thumbnail, export the image as a <code>jpg, gif,</code> or <code>png</code>.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Further reading</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https://wordpress.org/documentation/article/use-images/\">Use Images</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/use-image-and-file-attachments/\">Use image and file attachments</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/settings-media-screen/\">Settings Media Screen</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/media-add-new-screen/\">Media Add New Screen</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/edit-media/\">Edit Media</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/media-library-screen/\">Media library screen</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/inserting-images-into-posts-and-pages-block-editor/\">Inserting Images into Posts and Pages (Block Editor)</a></li>\n\n\n\n<li><a href=\"https://wordpress.org/documentation/article/inserting-images-into-posts-and-pages-classic/\">Inserting Images into Posts and Pages (Classic Editor)</a></li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Resources</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/Media/Formats/Image_types\">Image file type and format guide</a></li>\n</ul>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>The size and quality of an image for use on a web page is determined by a variety of things. Physical Size The physical size of an image is based upon two things: The size of the image on the screen and the file size. Generally, the file size is treated as a different issue. [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        87,
        78
    ],
    "class_list": [
        "post-10840109",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-media",
        "category-support-guides"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10840109",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10840109"
            }
        ],
        "version-history": [
            {
                "count": 4,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10840109/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16357602,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10840109/revisions/16357602"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10840109"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10840109"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}