{
    "id": 10867545,
    "date": "2018-11-16T14:04:57",
    "date_gmt": "2018-11-16T14:04:57",
    "guid": {
        "rendered": "https://wordpress.org/support/?post_type=helphub_article&#038;p=10867545"
    },
    "modified": "2025-04-15T18:18:58",
    "modified_gmt": "2025-04-15T18:18:58",
    "slug": "learn-about-wordpress-and-version-history",
    "status": "publish",
    "type": "helphub_article",
    "link": "https://wordpress.org/documentation/article/learn-about-wordpress-and-version-history/",
    "title": {
        "rendered": "Learn about WordPress origins and version history"
    },
    "content": {
        "rendered": "\n<p>WordPress was born out of a desire for an elegant, well-architectured personal publishing system built on PHP and MySQL and licensed under the GPL. It is the official successor of b2/cafelog. WordPress is modern software, but its roots and development go back to 2001. It is a mature and stable product. We hope that by focusing on user experience and web standards we can create a tool different from anything else out there.</p>\n\n\n\n<p>There are also various post launch versions with improvements for security, bug fixes and stability. Please review the full <a href=\"https://wordpress.org/news/category/releases/\">WordPress Release Archive</a> for details or check out the version announcements!</p>\n\n\n\n<hr class=\"wp-block-separator has-css-opacity\" />\n\n\n\n<p><strong>2025 &#8211; Announcement:</strong> <a href=\"https://wordpress.org/news/2025/04/cecil/\">6.8</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6.8/\">Version 6.8 (Cecil):</a> <strong>(&gt;900 contributors) </strong>Each WordPress release celebrates an artist who has left an indelible mark on music.  WordPress 6.8, code-named “Cecil,” honors the legendary pianist and jazz pioneer <a href=\"https://en.wikipedia.org/wiki/Cecil_Taylor\">Cecil Taylor.</a></p>\n\n\n\n<p><strong>2024 – Announcement:</strong> <a href=\"https://wordpress.org/news/2024/04/regina/\" data-type=\"link\" data-id=\"https://wordpress.org/news/2024/04/wordpress-6-5-regina/\" target=\"_blank\" rel=\"noreferrer noopener\">6.5</a>, <a href=\"https://wordpress.org/news/2024/07/dorsey/\">6.6</a>, <a href=\"https://wordpress.org/news/2024/11/rollins/\">6.7</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-7/\">Version 6.7 (Rollins)</a>: <strong>(&gt;750 contributors)</strong> Each WordPress release celebrates an artist who has made an indelible mark on the world of music. WordPress 6.7, code-named “Rollins,” pays tribute to the legendary jazz saxophonist <a href=\"https://en.wikipedia.org/wiki/Sonny_Rollins\">Sonny Rollins.</a> Known as one of the greatest improvisers and pioneers in jazz, Rollins has influenced generations of musicians with his technical brilliance, innovative spirit, and fearless approach to musical expression.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-6/\">Version 6.6 (Dorsey)</a> : <strong>(&gt;637 contributors)</strong> Say hello to WordPress 6.6 “Dorsey,” named after the legendary American Big Band leader, Tommy Dorsey. Renowned for his smooth-toned trombone and compositions, Dorsey’s music captivated audiences with its emotional depth and vibrant energy. Let your heart swing, sing, and sway to the deep brass notes of&nbsp;<a href=\"https://open.spotify.com/playlist/37i9dQZF1DZ06evO2TT3Ge?si=d9872e46371c4ed7\" target=\"_blank\" rel=\"noreferrer noopener\">Dorsey’s Big Band sound</a>&nbsp;as you explore the new features and enhancements of WordPress 6.6.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-5/\">Version 6.5 (Regina)</a>: <strong>(&gt;700 contributors)</strong> Say hello to WordPress 6.5 “Regina,” inspired by the dynamic versatility of renowned jazz violinist&nbsp;<a href=\"https://en.wikipedia.org/wiki/Regina_Carter\">Regina Carter</a>. An award-winning artist and storied jazz educator known for transcending genre, Regina’s technical foundations in classical music and deep understanding of jazz have earned her the reputation of boldly going beyond what’s possible with the violin.&nbsp;</p>\n\n\n\n<p><strong>2023 – Announcement:</strong> <a href=\"https://wordpress.org/news/2023/03/dolphy/\">6.2</a>, <a href=\"https://wordpress.org/news/2023/08/lionel/\">6.3</a>, <a href=\"https://wordpress.org/news/2023/11/shirley/\">6.4</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-4/\">Version 6.4 (Shirley)</a>: (<strong>&gt;600 contributors)</strong> Say hello to WordPress 6.4 “Shirley,” named after the iconic jazz artist <a href=\"https://wikipedia.org/wiki/Shirley_Horn\">Shirley Horn</a>. Her distinctive voice and extraordinary connection to the piano established her as one of the leading jazz musicians of her generation. Horn’s journey from the Washington D.C. jazz scene to the international stage is a testament to her dedication and perseverance. Her influence reached far beyond the confines of traditional jazz, breaking boundaries and inspiring audiences worldwide. </p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-3/\">Version 6.3 (Lionel)</a>: (<strong>536 contributors)</strong> Say hello to WordPress 6.3 “Lionel,” named after&nbsp;<a href=\"https://en.wikipedia.org/wiki/Lionel_Hampton\">Lionel Hampton</a>, the celebrated American jazz artist. A prolific jazz vibraphonist, pianist, and percussionist, Hampton gained notoriety working in harmony with greats from&nbsp;<a href=\"https://en.wikipedia.org/wiki/Charles_Mingus\">Charles Mingus</a>&nbsp;to&nbsp;<a href=\"https://en.wikipedia.org/wiki/Quincy_Jones\">Quincy Jones</a>&nbsp;and as bandleader of the eponymous Lionel Hampton Orchestra. His artistry and charitable work have been recognized with a Grammy, a star on the Hollywood Walk of Fame, and the National Medal of Arts.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-2/\">Version 6.2 (Dolphy)</a>: (<strong>600 contributors)</strong> Say hello to WordPress 6.2 “Dolphy,” named for the woodwind jazz wiz, the multi-instrumentalist—<a rel=\"noreferrer noopener\" href=\"https://en.wikipedia.org/wiki/Eric_Dolphy\" target=\"_blank\">Eric Allan Dolphy Jr</a>. Dolphy is acclaimed for having brought the bass clarinet to prominence in the jazz scene, creating a place for the flute and extending the lexicon of the alto saxophone. In a career that spanned continents, his artistry was at the forefront of pushing improvisational boundaries, ensemble work, and partnerships with well-respected artists like Charles Mingus and John Coltrane.</p>\n\n\n\n<p><strong>2022 – Announcement(s):</strong> <a href=\"https://wordpress.org/news/2022/01/josephine/\">5.9</a>, <a href=\"https://wordpress.org/news/2022/05/arturo/\">6.0</a>, <a href=\"https://wordpress.org/news/2022/11/misha/\">6.1</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-1/\">Version 6.1 (Misha)</a>: (<strong>800 contributors</strong>) Say hello to “Misha,” the WordPress 6.1 release, inspired by Mikhail “Misha” Alperin acclaimed jazz ensemblist and composer. Site owners and administrators should upgrade today to take full advantage of the many stability, performance, and usability enhancements. Furthermore, WordPress content creators will enjoy a suite of new features geared toward improving the writing and designing experiences.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-6-0/\">Version 6.0 (Arturo)</a>: (<strong>500 contributors</strong>) Say hello to “Arturo” and WordPress 6.0, inspired by Grammy-winning jazz musician, Arturo O’Farrill. With nearly 1,000 enhancements and bug fixes, the second major release of 2022 is here. Site owners and administrators should upgrade to take full advantage of the many stability, performance, and usability enhancements today. WordPress content creators will enjoy a suite of new features geared toward improving the writing and designing experiences.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-9/\">Version 5.9 (Joséphine)</a>: <strong>(624 contributors)</strong> Full site editing arrives and puts you in control of your whole site, right in the WordPress Admin.  A new default block theme, Twenty Twenty-Two, shows off the wide array of visual choices all from the Site Editor.  The new Navigation block provides an always-on responsive menu, one that adapts to your user&#8217;s screen size.  Better block controls, the new Pattern Directory, a revamped List View, and a better Gallery block round out the new tweaks to the publishing flow to help you say more, faster.</p>\n\n\n\n<p><strong>2021 – Announcements:</strong>&nbsp;<a href=\"https://wordpress.org/news/2021/03/esperanza/\">5.7</a>, <a href=\"https://wordpress.org/news/2021/07/tatum/\">5.8</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-8/\">Version 5.8 (Tatum)</a>: <strong>(530 contributors)</strong> The power of blocks has come to both the Block Widgets Editor and the Customizer. The Query Loop Block makes it possible to display posts based on specified parameters. You can also use the familiar block editor to edit templates that hold your content. Worth noting that support for Internet Explorer 11 has been dropped as of this release. WordPress 5.8 also adds support for WebP images.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-7/\" data-type=\"helphub_version\" data-id=\"14145224\">Version 5.7 (Esperanza)</a>: (<strong>481 contributors</strong>) With this new version, WordPress brings you fresh colors. The editor helps you work in a few places you couldn’t before without getting into code or hiring a pro. The controls you use most are right where you need them. Layout changes that should be simple, are even simpler to make.</p>\n\n\n\n<p><strong>2020 – Announcements:</strong>&nbsp;<a href=\"https://wordpress.org/news/2020/03/adderley/\">5.4</a>, <a href=\"https://wordpress.org/news/2020/08/eckstine/\">5.5</a>, <a href=\"https://wordpress.org/news/2020/12/simone/\">5.6</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-6/\" data-type=\"helphub_version\" data-id=\"13752149\">Version 5.6 (Simone)</a>: (<strong>605 contributors</strong>) brings you countless ways to set your ideas free and bring them to life. With a brand-new default theme as your canvas, it supports an ever-growing collection of blocks as your brushes. Paint with words. Pictures. Sound. Or rich embedded media.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-5/\">Version 5.5 (Eckstine)</a>: (<strong>809 contributors</strong>) added speed, search and security improvements to WordPress. The block editor also received a lot of improvements with blocks patterns, inline image editing, and a brand new block directory. In addition to that, this release also made big changes for developers; in the REST API, to the dashicons, environment variables, etc.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-4/\">Version 5.4 (Adderley)</a>: (<strong>595 contributors</strong>) added more ways to make posts and pages come alive with your best images, to bring your visitors in, and keep them engaged, with the richness of embedded media from the web’s top services. This version also added more speed everywhere within the administration dashboard and websites frontend.</p>\n\n\n\n<p><strong>2019 – Announcements:</strong>&nbsp;<a href=\"https://wordpress.org/news/2019/02/betty/\">5.1</a>, <a href=\"https://wordpress.org/news/2019/05/jaco/\">5.2</a>, <a href=\"https://wordpress.org/news/2019/11/kirk/\">5.3</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-3/\">Version 5.3 (Kirk)</a>: (<strong>711 contributors</strong>) expanded and refined the block editor introduced in WordPress 5.0 with new blocks, more intuitive interactions, and improved accessibility. New features in the editor increase design freedoms, provide additional layout options and style variations to allow designers complete control over the look of a site. This release also introduces the Twenty Twenty theme giving the user more design flexibility and integration with the block editor.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-2/\">Version 5.2 (Jaco)</a>: (<strong>389 contributors</strong>) added more robust tools for identifying and fixing configuration issues and fatal errors. For both websites developers and people managing their sites by themselves, these tools can help get the right information about a website when needed.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-5-1/\">Version 5.1 (Betty)</a>: (<strong>552 contributors</strong>) focused on polish, in particular by improving performance of the editor. In addition, this release paves the way for a better, faster, and more secure WordPress with some essential tools for site administrators and developers.</p>\n\n\n\n<p><strong>2018 <strong>–</strong> Announcement:</strong> <a href=\"https://wordpress.org/news/2018/12/bebo/\">5.0</a></p>\n\n\n\n<p><a href=\"/support/wordpress-version/version-5-0/\">Version 5.0 (Bebo)</a>: <strong>(432 Contributors)</strong> introduced a new block based editor with a showcase theme (Twenty Nineteen). Support for the classic editor was maintained and the community translated the release to support a total of 37 languages.</p>\n\n\n\n<p><strong>2017 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2017/06/evans/\">4.8</a>,&nbsp;<a href=\"https://wordpress.org/news/2017/11/tipton/\">4.9</a></p>\n\n\n\n<p><a href=\"/support/wordpress-version/version-4-9\">Version 4.9 (Tipton)</a>&nbsp;<strong>(443 Contributors)</strong> focused on user experience and introduced the ability to save design drafts for review and alteration prior to publishing. Design locking rolled out, protecting two multiple designers to override changes in progress. This was also the introduction point of code syntax checking and error reporting within the Admin experience. An official callout for contributors and testers went out for the Gutenberg project.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-8\">Version 4.8 (Evans)</a>&nbsp;<strong>(346 Contributors)</strong> brought an array of new widgets (image, video, audio and rich text). Adding links improved greatly setting boundaries around groupings of text to avoid mismatching. WordPress event streams became visible in the Admin Dashboard. Developer enhancements were introduced for added accessibility, API introduction to make the editor more portable to different areas via plugins.</p>\n\n\n\n<p><strong>2016 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2016/04/coleman/\">4.5</a>,&nbsp;<a href=\"https://wordpress.org/news/2016/08/pepper/\">4.6</a>,&nbsp;<a href=\"https://wordpress.org/news/2016/12/vaughan/\">4.7</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-7/\">Version 4.7 (Vaughan)</a>&nbsp;<strong>(482 Contributors)</strong> arrived along side a new theme with modern elements (including starter content) with video header support. New Customizer features allow editing CSS with live previewing. REST API endpoints allow for machine-readable external access for enhanced third party interaction. Page template functionality was opened up to all post types. Bulk actions additionally were branched out with custom option support. The Customizer continued extension to support auto saving of drafts. This was an exciting release for WordPress as the number of contributors significantly increased with this release.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-6/\">Version 4.6 (Pepper)</a>&nbsp;<strong>(272 Contributors)</strong> brought significant speed changes to Multisite with cached and comprehensive site queries to improve the network admin experience. Theme addition, activation and plugin updates were adapted to a one screen process. Local draft saving to browser was introduced. Native fonts were also made available to be used from the operating system for speed enhancement.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-5/\">Version 4.5 (Coleman)</a>&nbsp;<strong>(298 Contributors)</strong> added inline links, added formatting shortcuts and responsive previews in Customizer to preview on mobile, tablet or desktop. Additionally, support was added for Custom Logos, smart image resizing for speed improvement and script loading improvements for dependent scripts from the header and footer.</p>\n\n\n\n<p><strong>2015 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2015/04/powell/\">4.2</a>,&nbsp;<a href=\"https://wordpress.org/news/2015/08/billie/\">4.3</a>,&nbsp;<a href=\"https://wordpress.org/news/2015/12/clifford/\">4.4</a></p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>Winner of CMS Critic Award&#8217;s &#8220;Best CMS for Personal Websites.&#8221;</em></p>\n</blockquote>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-4/\">Version 4.4 (Clifford)</a>&nbsp;<strong>(471 Contributors)</strong> added responsive images, embeddable posts, and a new default theme, &#8220;Twenty Sixteen.&#8221; oEmbed support was added for WordPress posts with rich previews and display as well as five new providers (Cloudup, Reddit Comments, ReverbNation, Speaker Deck, and VideoPress). Developer improvements included integration of the REST API structure, query improvements for comments, Term Metadata and two new Objects (Term and Network) for more predictable added interaction capability within code.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-3/\">Version 4.3 (Billie)</a>&nbsp;<strong>(246 Contributors)</strong> added built-in site icons support and introduced formatting shortcuts in the visual editor. Live Menu previews became available from the Customizer. Password processes were improved for security as well as List Views in the Admin panel.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-2/\">Version 4.2 (Powell)</a>&nbsp;<strong>(283 Contributors)</strong> added emoji support, add extended character support and switched database encoding from utf8 to utf8mb4. Plugin updates became dynamic from one page without reloading. Two new oEmbed providers were added (Tumblr, Kickstarter). Theme switching became available through the Customizer. This version also included developer query improvements.</p>\n\n\n\n<p><strong>2014 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2014/04/smith/\">3.9</a>,&nbsp;<a href=\"https://wordpress.org/news/2014/09/benny/\">4.0</a>, <a href=\"https://wordpress.org/news/2014/12/dinah/\">4.1</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-1/\">Version 4.1 (Dinah)</a>&nbsp;<strong>(283 Contributors)</strong> introduced a refreshed Distraction Free Writing mode, language installation from the Settings screen (to switch between 40 different languages with support from Google&#8217;s Noto font family), and a beautiful new default theme, &#8220;Twenty Fifteen.&#8221; Developer improvements included addition of advanced metadata query conditional logic.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-4-0/\">Version 4.0 (Benny)</a>&nbsp;<strong>(275 Contributors)</strong> introduced a grid view for the media library and for installing plugins. Previews for embedded content such as Twitter and YouTube became available from within the editor while preparing content. Editor writing improvements included expanding the editor with content for an easier experience. The Plugin section was enhanced to show more detail and provide a better search experience.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-9/\">Version 3.9 (Smith)</a>&nbsp;<strong>(267 Contributors)</strong> improved the media experience and introduced live widget and header previews. The Visual Editor was improved for speed, accessibility and mobile use. Image and media improvements included adding the ability to upload images via drag and drop from desktop and image editing enhancement. Audio and video playlist support was added as well as Gallery previews from within the editor. Themes became browsable from the Appearance section.</p>\n\n\n\n<p><strong>2013 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2013/08/oscar/\">3.6</a>, <a href=\"https://wordpress.org/news/2013/10/basie/\">3.7</a>, <a href=\"https://wordpress.org/news/2013/12/parker/\">3.8</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-8/\">Version 3.8 (Parker)</a> (<strong>188 Contributors)&nbsp;</strong>introduced a new magazine style default theme called &#8220;Twenty Fourteen.&#8221;&nbsp; The&nbsp;Admin panel was completely overhauled with a fresh modern look and new vector icons. Color schemes were also made available to be applied to the Admin experience. The Widget section was also streamlined for easier use.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-7/\">Version 3.7 (Basie)</a> (<strong>211 Contributors)&nbsp;</strong>introduced automatic updates for maintenance and security updates, a stronger password meter and enhanced language support and auto installation of language files.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-6/\">Version 3.6 (Oscar)</a> introduced a new default theme called &#8220;Twenty Thirteen,&#8221; built-in Audio and Video support, dynamic and scalable Revisions, improved Autosave and Post Locking. Audio and video improvements included&nbsp;native support for audio and video embeds, a built-in HTML5 media player, a new API for supporting metadata (such as ID3 tags) and enhancement to existing oEmbed providers&nbsp;Spotify, Rdio and SoundCloud.</p>\n\n\n\n<p><strong>2012 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2012/06/green/\">3.4</a>, <a href=\"https://wordpress.org/news/2012/12/elvin/\">3.5</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-5/\">Version 3.5 (Elvin)</a> introduced the new media manager and the new default theme called &#8220;Twenty Twelve&#8221; with focus on mobile display. Focus was also placed on the&nbsp;flow for uploading photos and creating galleries.&nbsp; The Admin Dashboard saw the coming of a&nbsp;Retina-ready display with high resolution graphics.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-4/\">Version 3.4 (Green)</a> introduced the Theme Customizer and previewer, allowing to test and check theme revisions prior to applying them. The&nbsp;Media Library was extended to support using images to populate custom headers and to choose the height and width of the images. Image captioning saw improvements to support HTML. With this release,&nbsp;Twitter &#8220;Tweets&#8221; were made to format a nice display by dropping the URL into the editor.&nbsp;There were many developer improvements, including XML-RPC, a custom header API and performance improvements to WP_Query.</p>\n\n\n\n<p><strong>2011 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2011/02/threeone/\">3.1</a>, <a href=\"https://wordpress.org/news/2011/07/gershwin/\">3.2</a>, <a href=\"https://wordpress.org/news/2011/12/sonny/\">3.3</a></p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>Winner of Infoworld&#8217;s &#8220;Bossie award for Best Open Source Software.&#8221;</em></p>\n</blockquote>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-3/\">Version 3.3 (Sonny)</a> made WordPress more friendly for beginners with welcome messages and feature pointers. Improvements included a new drag and drop uploader, improved co-editing support, navigation and toolbar improvements and better touch support for iPad and other tablets.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-2/\">Version 3.2 (Gershwin)</a> made WordPress faster and lighter, this version upgraded minimum requirements to PHP 5.2.4 and MySQL 5.0.15, and introduced a new fully HTML5 default theme called &#8220;Twenty Eleven.&#8221; The Dashboard design was refreshed and the previously introduced Admin Bar saw additions. This release featured introduction of a Distraction Free Writing mode. The Comments Moderation screen was improved for approvals and replies. The update process was streamlined, making updates much faster with added stability.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-1/\">Version 3.1 (Reinhardt)</a>&nbsp;<strong>(180+ Contributors)</strong> introduced Post Formats and the Admin Bar.&nbsp; A redesigned linking workflow was added to more easily work with existing posts and pages.&nbsp; The beginnings of a streamlined writing interface were introduced. The&nbsp;import/export system was overhauled and there were many query improvements to enable performing&nbsp;perform advanced taxonomy and custom fields queries.</p>\n\n\n\n<p><strong>2010 <strong>–</strong> Announcement:</strong> <a href=\"https://wordpress.org/news/2010/06/thelonious/\">3.0</a></p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>Winner of digitalsynergy&#8217;s &#8220;Hall of Fame CMS category in the 2010 Open Source.&#8221;</em></p>\n</blockquote>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-3-0/\">Version 3.0 (Thelonious)</a>&nbsp;<strong>(218 Contributors)</strong> was a major release, it introduced custom post types, made custom taxonomies simpler, added custom menu management, added new API&#8217;s for custom headers and custom backgrounds, introduced a new default theme called &#8220;Twenty Ten&#8221; and merged former WordPress MU (allowing the management of multiple sites) to be part of WordPress Core, renamed to Multisite. Bulk plugin updates were further streamlined from the previous release. Theme developers saw introduction of new APIs allowing implementation of&nbsp;custom backgrounds, headers, shortlinks, menus,&nbsp;post types, and taxonomies without file editing. An initiative to add contextual help going forward saw its start.</p>\n\n\n\n<p><strong>2009 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2009/06/wordpress-28/\">2.8</a>,&nbsp;<a href=\"https://wordpress.org/news/2009/12/wordpress-2-9/\">2.9</a></p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>Winner of Open Source CMS Awards&#8217;s &#8220;Overall Best Open Source CMS.&#8221;</em></p>\n</blockquote>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-9/\">Version 2.9 (Carmen)</a>&nbsp;<strong>(140+ Contributors)</strong>&nbsp;was a development intensive release introducing image editing, a Trash/Undo feature, bulk plugin updating, and oEmbed support allowing integrated 3rd party provider content to seamlessly integrate with content. There were also significant batch updating compatibility improvements, comment framework enhancement, editor upgrades, user profile, registration and automation improvements, gallery items usage across multiple posts introduction and better hooks and filters for excerpts, smilies, HTTP requests, user profiles, author links, taxonomies, SSL support, tag clouds, query_posts and WP_Query.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-8/\">Version 2.8 (Baker)</a> introduced a built-in theme installer and&nbsp;improvements to themes, widgets, taxonomies, and overall speed (including a new Widget API) (and drag and drop). There were&nbsp;significant speed enhancements relative to style and scripting. A new&nbsp;CodePress editor added syntax highlighting to the Dashboard based code editor. Screen Options were added to the Admin in order to customize user interaction with the items being used and the ability to filter out the others.</p>\n\n\n\n<p><strong>2008 <strong>–</strong> Announcements:</strong>&nbsp;<a href=\"https://wordpress.org/news/2008/03/wordpress-25-brecker/\">2.5</a>, <a href=\"https://wordpress.org/news/2008/07/wordpress-26-tyner/\">2.6</a>, <a href=\"https://wordpress.org/news/2008/12/coltrane/\">2.7</a></p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>Winner of Infoworld&#8217;s &#8220;Best of open source software awards: Collaboration.&#8221;</em></p>\n</blockquote>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-7/\">Version 2.7 (Coltrane)</a>&nbsp;which redesigned the administration UI to improve usability and make the admin tool more customizable. Version 2.7 also introduced automatic upgrading, built-in plugin installation, sticky posts, comment threading/paging/replies and a new API, bulk management, and inline documentation.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-6/\">Version 2.6 (Tyner)</a> built on 2.5 and introduced post revisions and Press This. A usability study was done on 2.5 over the summer, leading to the development of the Crazyhorse prototype, and the following release.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-5/\">Version 2.5 (Brecker)</a> was released with a new administration UI design by Happy Cog, and introduced the dashboard widget system and the shortcode API.</p>\n\n\n\n<p><strong>2007 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2007/01/ella-21/\">2.1</a>, <a href=\"https://wordpress.org/news/2007/05/wordpress-22/\">2.2</a>,&nbsp;<a href=\"https://wordpress.org/news/2007/09/wordpress-23/\">2.3</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-3/\">Version 2.3 (Dexter)</a>&nbsp;offered tagging, update notifications, pretty URLs and a new taxonomy system.&nbsp;Core update notifications were introduced allowing users to better keep track of when new release updates were available. The jQuery version was updated bringing speed increases.&nbsp;canonical URL fixes were added and a new $wpdb-&gt;prepare() syntax support rolled out allowing for safer MySQL queries.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-2/\">Version 2.2 (Getz)</a>&nbsp;brought better Atom feed support and speed optimizations for plugins and filters.&nbsp;Widgets introduction laid the groundwork for moving additional features into design, which provided a base for plugin features extension.&nbsp;Protection was added on activating plugins, checking for errors prior to successful activation.&nbsp;phpMailer was added which also provided support for SMTP Mail. Database collation control and many code notation improvements were also part of this release.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-1/\">Version 2.1 (Ella)</a>&nbsp;introduced a new UI, autosave, spell check and other new features. Enhancements added ability to&nbsp;switch between content and code editor, setting pages as the front page, adding no-indexing to the entire site for search engine privacy, XML importing improvements and the addition of the private pages feature. MySQL queries saw an aggressive optimization and re-write. Other developer additions included new hooks and APIs, language improvements and pseudo-cron scheduling.</p>\n\n\n\n<p><strong>2005 <strong>–</strong> Announcements:</strong>&nbsp;<a href=\"https://wordpress.org/news/2005/02/strayhorn/\">1.5</a>, <a href=\"https://wordpress.org/news/2005/12/wp2/\">2.0</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-2-0/\">Version 2.0 (Duke)</a>&nbsp;was introduced with persistent caching, a new user role system and a new backend UI. WYSIWYG editing brought a better experience producing content which also included inline image, video and file uploads. Post previewing allowed to review posts before being made live on sites. Plugin hooks were enhanced to allow for features extension by plugin developers. Theme functions were introduced to enhance themes with code, similar to plugins.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-1-5/\">Version 1.5 (Strayhorn)</a>&nbsp;introduced a Theme system and featured the introduction of static pages, bring WordPress to be poised as a content management system. A new theme became available to showcase how the newly deployed Theme system could be extended and utilized. Hundreds of hooks were made available, allowing for integration of plugins to key parts of WordPress. The WordPress Plugin Repository was created allowing for a collaborative environment between Plugin Developers and users.</p>\n\n\n\n<p><strong>2004 <strong>–</strong> Announcements:</strong> <a href=\"https://wordpress.org/news/2004/01/wordpress-10/\">1.0</a>,&nbsp;<a href=\"https://wordpress.org/news/2004/05/heres-the-beef/\">1.2</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-1-2/\">Version 1.2 (Mingus)</a>&nbsp;introduced plugins,&nbsp;hierarchically category support,&nbsp;OPML import and export as well as&nbsp;introductory language support. Features like&nbsp;automatic thumbnail creation, multiple&nbsp;update service pinging and password encryption also were highlights.</p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-1-0/\">Version 1.0 (Davis)</a> was the official 1.0 bringing browser installation, search engine permalinks, multiple category support, an intelligent upgrade process and&nbsp;import enhancement for moving from other systems to WordPress. Support was added to the Admin experience for editing posts and comments as well as the start of many other features to be improved on in the future.</p>\n\n\n\n<p><strong>2003 <strong>–</strong> Announcement:</strong>&nbsp;<a href=\"https://wordpress.org/news/2003/05/wordpress-now-available/\">0.7 (initial)</a></p>\n\n\n\n<p><a href=\"https://wordpress.org/documentation/wordpress-version/version-0-70/\">Version 0.7</a>&nbsp;&nbsp;<a href=\"https://codex.wordpress.org/_User:Matt_\">Matt Mullenweg </a> and <a href=\"http://mikelittle.org/\">Mike Little</a> fork b2 and create WordPress. This initial release included a texturize engine, links manager, XHTML 1.1 compliant templates, a new administration interface, the ability to do manual excerpts and new templates.</p>\n\n\n\n<p><strong>2001</strong>:</p>\n\n\n\n<p><a href=\"http://cafelog.com/\">b2 cafelog</a> launched by Michel Valdrighi.</p>\n",
        "protected": false
    },
    "excerpt": {
        "rendered": "<p>WordPress was born out of a desire for an elegant, well-architectured personal publishing system built on PHP and MySQL and licensed under the GPL. It is the official successor of b2/cafelog. WordPress is modern software, but its roots and development go back to 2001. It is a mature and stable product. We hope that by [&hellip;]</p>\n",
        "protected": false
    },
    "featured_media": 0,
    "menu_order": 0,
    "comment_status": "open",
    "ping_status": "closed",
    "template": "",
    "meta": {
        "advanced_seo_description": "",
        "jetpack_seo_html_title": "",
        "jetpack_seo_noindex": false
    },
    "category": [
        75,
        74
    ],
    "class_list": [
        "post-10867545",
        "helphub_article",
        "type-helphub_article",
        "status-publish",
        "hentry",
        "category-about-wp",
        "category-wordpress-overview"
    ],
    "revision_note": "",
    "jetpack_sharing_enabled": true,
    "_links": {
        "self": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10867545",
                "targetHints": {
                    "allow": [
                        "GET"
                    ]
                }
            }
        ],
        "collection": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles"
            }
        ],
        "about": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/types/helphub_article"
            }
        ],
        "replies": [
            {
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/comments?post=10867545"
            }
        ],
        "version-history": [
            {
                "count": 14,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10867545/revisions"
            }
        ],
        "predecessor-version": [
            {
                "id": 16365582,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/articles/10867545/revisions/16365582"
            }
        ],
        "wp:attachment": [
            {
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/media?parent=10867545"
            }
        ],
        "wp:term": [
            {
                "taxonomy": "category",
                "embeddable": true,
                "href": "https://wordpress.org/documentation/wp-json/wp/v2/category?post=10867545"
            }
        ],
        "curies": [
            {
                "name": "wp",
                "href": "https://api.w.org/{rel}",
                "templated": true
            }
        ]
    }
}